{
  "success" : true,
  "message" : "The document structure for EML law",
  "responseType" : "law-tree",
  "result" : {
    "lawVersion" : {
      "lawId" : "EML",
      "activeDate" : "2014-09-22"
    },
    "info" : {
      "lawId" : "EML",
      "name" : "Employers' Liability",
      "lawType" : "CONSOLIDATED",
      "chapter" : "74"
    },
    "publishedDates" : [ "2014-09-22" ],
    "documents" : {
      "lawId" : "EML",
      "lawName" : "Employers' Liability",
      "locationId" : "-CH74",
      "title" : "Employers' Liability",
      "docType" : "CHAPTER",
      "docLevelId" : "74",
      "activeDate" : "2014-09-22",
      "sequenceNo" : 1,
      "repealedDate" : null,
      "fromSection" : "1",
      "toSection" : "18",
      "text" : "                                CHAP. 121\\n  AN ACT in relation to employers' liability, constituting chapter\\nseventy-four of the consolidated laws.\\n  Became a law March 28, 192l, with the approval of the Governor.\\nPassed, three-fifths being present.\\n  The People of the State of New York, represented in Senate and\\nAssembly, do enact as follows:\\n             CHAPTER SEVENTY-FOUR OF THE CONSOLIDATED LAWS.\\n                        EMPLOYERS' LIABILITY LAW.\\nArticle 1. Short title (§ 1).\\n        2. Employers' liability (§§ 2-15).\\n        3. Laws repealed; construction; when to take effect (§§ 16-18).\\n",
      "documents" : {
        "items" : [ {
          "lawId" : "EML",
          "lawName" : "Employers' Liability",
          "locationId" : "A1",
          "title" : "Short Title",
          "docType" : "ARTICLE",
          "docLevelId" : "1",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 2,
          "repealedDate" : null,
          "fromSection" : "1",
          "toSection" : "1",
          "text" : "                               ARTICLE 1.\\n                              SHORT TITLE.\\nSection 1. Short title.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "1",
              "title" : "Short title",
              "docType" : "SECTION",
              "docLevelId" : "1",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 3,
              "repealedDate" : null,
              "fromSection" : "1",
              "toSection" : "1",
              "text" : "  § 1. Short title. This chapter shall be known as the \"employers'\\nliability law. \"\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            } ],
            "size" : 1
          },
          "repealed" : false
        }, {
          "lawId" : "EML",
          "lawName" : "Employers' Liability",
          "locationId" : "A2",
          "title" : "Employers' Liability",
          "docType" : "ARTICLE",
          "docLevelId" : "2",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 4,
          "repealedDate" : null,
          "fromSection" : "2",
          "toSection" : "15",
          "text" : "                                ARTICLE 2\\n                          EMPLOYERS' LIABILITY.\\nSection  2. Employers' liability for injuries.\\n         3. Notice to be served.\\n         4. Assumption   of   risks;  contributory  negligence,  when  a\\n              question of fact.\\n         5. Trial; burden of proof.\\n         6. Defense; insurance fund.\\n         7. Existing rights of action continued.\\n         8. Consent by employer and employee to compensation plan.\\n         9. Liability to pay compensation; notice of accident.\\n        10. Amount   of   compensation;   persons   entitled;   physical\\n              examination.\\n        11. Settlement of disputes.\\n        12. Preferential claim; not assignable or subject to attachment;\\n              attorney's fees.\\n        13. Cancellation of consent.\\n        14. Reports of compensation plan.\\n        15. Reports by employer.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "2",
              "title" : "Employers' liability for injuries",
              "docType" : "SECTION",
              "docLevelId" : "2",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 5,
              "repealedDate" : null,
              "fromSection" : "2",
              "toSection" : "2",
              "text" : "  § 2. Employers' liability for injuries. When personal injury is caused\\nto an employee who is himself in the exercise of due care and diligence\\nat the time:\\n  1. By reason of any defect in the condition of the ways, works,\\nmachinery, or plant, connected with or used in the business of the\\nemployer which arose from or had not been discovered or remedied owing\\nto the negligence of the employer or of any person in the service of the\\nemployer and intrusted by him with the duty of seeing that the ways,\\nworks, machinery, or plant, were in proper condition;\\n  2. By reason of the negligence of any person in the service of the\\nemployer intrusted with any superintendence or by reason of the\\nnegligence of any person intrusted with authority to direct, control or\\ncommand any employee in the performance of the duty of such employee,\\nthe employee, or in case the injury results in death, the executor or\\nadministrator of a deceased employee who has left him surviving a\\nhusband, wife or next of kin, shall have the same right of compensation\\nand remedies against the employer as if the employee had not been an\\nemployee of nor in the service of the employer nor engaged in his work.\\nThe provisions of law relating to actions for causing death by\\nnegligence, so far as the same are consistent with this act, shall apply\\nto an action brought by an executor or administrator of a deceased\\nemployee, suing under the provisions of this article. If an employer\\nenters into a contract, written or verbal, with an independent\\ncontractor to do part of such employer's work, or if such contractor\\nenters into a contract with a subcontractor to do all or any part of the\\nwork comprised in such contractor's contract with the employer, such\\ncontract or subcontract shall not bar the liability of the employer for\\nthe injuries to the employees of such contractor or subcontractor,\\ncaused by any defect in the condition of the ways, works, machinery, or\\nplant, if they are the property of the employer or are furnished by him,\\nand if such defect arose, or had not been discovered or remedied,\\nthrough the negligence of the employer, or of some person intrusted by\\nhim with the duty of seeing that they were in proper condition.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "3",
              "title" : "Notice to be served",
              "docType" : "SECTION",
              "docLevelId" : "3",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 6,
              "repealedDate" : null,
              "fromSection" : "3",
              "toSection" : "3",
              "text" : "  § 3. Notice to be served. No action for recovery of compensation for\\ninjury or death under this article shall be maintained unless notice of\\nthe time, place and cause of the injury is given to the employer within\\none hundred and twenty days and the action is commenced within one year\\nafter the occurrence of the accident causing the injury or death. The\\nnotice required by this section shall be in writing and signed by the\\nperson injured or by some one in his behalf, but if from physical or\\nmental incapacity it is impossible for the person injured to give notice\\nwithin the time provided in this section, he may give the same within\\nten days after such incapacity is removed. In case of his death without\\nhaving given such notice, his executor or administrator may give such\\nnotice within sixty days after his appointment, but no notice under the\\nprovisions of this section shall be deemed to be invalid or insufficient\\nsolely by reason of any inaccuracy in stating the time, place or cause\\nof the injury if it be shown that there was no intention to mislead and\\nthat the party entitled to notice was not in fact misled thereby. If\\nsuch notice does not apprise the employer of the time, place or cause of\\ninjury, he may, within eight days after service thereof, serve upon the\\nsender a written demand for a further notice, which demand must specify\\nthe particular in which the first notice is claimed to be defective, and\\na failure by the employer to make such demand as herein provided shall\\nbe a waiver of all defects that the notice may contain. After service of\\nsuch demand as herein provided, the sender of such notice may at anytime\\nwithin eight days thereafter serve an amended notice which shall\\nsupersede such first notice and have the same effect as an original\\nnotice hereunder. The notice required by this section shall be served on\\nthe employer, or if there is more than one employer, upon one of such\\nemployers, and may be served by delivering the same to or at the\\nresidence or place of business of the person on whom it is to be served.\\nThe notice or demand may be served by post by letter addressed to the\\nperson on whom it is to be served, at his last known place of residence\\nor place of business, and if served by post shall be deemed to have been\\nserved at the time when the letter containing the same would be\\ndelivered in the ordinary course of the post. When the employer is a\\ncorporation, notice shall be served by delivering the same or by sending\\nit by post addressed to the office or principal place of business of\\nsuch corporation.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "4",
              "title" : "Assumption of risks; contributory negligence, when a question of fact",
              "docType" : "SECTION",
              "docLevelId" : "4",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 7,
              "repealedDate" : null,
              "fromSection" : "4",
              "toSection" : "4",
              "text" : "  § 4. Assumption of risks; contributory negligence, when a question of\\nfact. An employee by entering upon or continuing in the service of the\\nemployer shall be presumed to have assented to the necessary risks of\\nthe occupation or employment and no others. The necessary risks of the\\noccupation or employment shall, in all cases arising after the first day\\nof September, nineteen hundred and ten, be considered as including those\\nrisks, and those only, inherent in the nature of the business which\\nremain after the employer has exercised due care in providing for the\\nsafety of his employees, and has complied with the laws affecting or\\nregulating such business or occupation for the greater safety of such\\nemployees. In an action brought to recover damages for personal injuries\\nor for death resulting therefrom received after the first day of\\nSeptember, nineteen hundred and ten, owing to any cause, including open\\nand visible defects, for which the employer would be liable but for the\\nhitherto available defense of assumption of risks by the employee, the\\nfact that the employee continued in the service of the employer in the\\nsame place and course of employment after the discovery by such\\nemployee, or after he had been informed of the danger of personal injury\\ntherefrom, shall not be, as matter of fact or as matter of law, an\\nassumption of the risk of injury therefrom, but an employee, or his\\nlegal representative, shall not be entitled under this article to any\\nright of compensation or remedy against the employer in any case where\\nsuch employee knew of the defect or negligence which caused the injury\\nand failed, within a reasonable time, to give, or cause to be given,\\ninformation thereof to the employer, or to some person superior to\\nhimself in the service of the employer, or who had intrusted to him some\\nsuperintendence, unless it shall appear on the trial that such defect or\\nnegligence was known to such employer, or superior person, prior to such\\ninjuries to the employee; or unless such defect could have been\\ndiscovered by such employer by reasonable and proper care, tests or\\ninspection.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "5",
              "title" : "Trial; burden of proof",
              "docType" : "SECTION",
              "docLevelId" : "5",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 8,
              "repealedDate" : null,
              "fromSection" : "5",
              "toSection" : "5",
              "text" : "  § 5. Trial; burden of proof. On the trial of any action brought by an\\nemployee or his personal representative to recover damages for\\nnegligence arising out of and in the course of such employment,\\ncontributory negligence of the injured employee shall be a defense to be\\nso pleaded and proved by the defendant.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "6",
              "title" : "Defense; insurance fund",
              "docType" : "SECTION",
              "docLevelId" : "6",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 9,
              "repealedDate" : null,
              "fromSection" : "6",
              "toSection" : "6",
              "text" : "  § 6. Defense; insurance fund. An employer who shall have contributed\\nto an insurance fund created and maintained for the mutual purpose of\\nindemnifying an employee for personal injuries, for which compensation\\nmay be recovered under this article, or to any relief society or benefit\\nfund created under the laws of this state, may prove in mitigation of\\ndamages recoverable by an employee under this article such proportion of\\nthe pecuniary benefit which has been received by such employee from such\\nfund or society on account of such contribution of the employer, as the\\ncontribution of such employer to such fund or society bears to the whole\\ncontribution thereto.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "7",
              "title" : "Existing rights of action continued",
              "docType" : "SECTION",
              "docLevelId" : "7",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 10,
              "repealedDate" : null,
              "fromSection" : "7",
              "toSection" : "7",
              "text" : "  § 7. Existing rights of action continued. Every right of action\\nexisting on the seventeenth day of February, nineteen hundred and nine,\\nfor negligence or to recover damages for injuries resulting in death is\\ncontinued and nothing in this article contained shall be construed as\\nlimiting any such right of action, nor shall the failure to give the\\nnotice provided for in section three of this article be a bar to the\\nmaintenance of a suit upon any such existing right of action.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "8",
              "title" : "Consent by employer and employee to compensation plan",
              "docType" : "SECTION",
              "docLevelId" : "8",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 11,
              "repealedDate" : null,
              "fromSection" : "8",
              "toSection" : "8",
              "text" : "  § 8. Consent by employer and employee to compensation plan. When and\\nif any employer in this state and any of his employees shall consent to\\nthe compensation plan described in sections nine to fifteen, inclusive,\\nof this article, hereinafter referred to as the plan, and shall signify\\ntheir consent thereto in writing, signed by each of them or their\\nauthorized agents, and acknowledged in the manner prescribed by law for\\ntaking the acknowledgment of a conveyance of real property, and such\\nwriting is filed with the county clerk of the county in which it is\\nsigned by the employee, then so long as such consent has not expired or\\nbeen canceled as hereinafter provided, such employee, or in case injury\\nto him results in death, his executor or administrator, shall have no\\nother right of action against the employer for personal injury or death\\nof any kind, under any statute or at common law, save under the plan so\\nconsented to, except where personal injury to the employee is caused in\\nwhole or in part by the failure of the employer to obey a valid order\\nmade by the industrial commission or other public authority authorized\\nto require the employer to safeguard his employees, or where such injury\\nis caused by the serious or willful misconduct of the employer. In such\\nexcepted cases thus described, no right of action which the employee has\\nat common law or by any other statute shall be affected or lost by his\\nconsent to the plan, if such employee, or in case of death his executor\\nor administrator, commences such action before accepting any benefit\\nunder such plan or giving any notice of injury as provided in section\\nnine hereof. The commencing of any legal action whatsoever at common law\\nor by any statute against the employer on account of such injury, except\\nunder the plan, shall bar the employee, and in the event of his death\\nhis executors, administrators, dependents and other beneficiaries, from\\nall benefit under the plan. This section and sections nine to fifteen,\\ninclusive, of this article shall not apply to a railroad corporation,\\nforeign or domestic, doing business in this state, or a receiver\\nthereof, or to any person employed by such corporation or receiver.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "9",
              "title" : "Liability to pay compensation; notice of accident",
              "docType" : "SECTION",
              "docLevelId" : "9",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 12,
              "repealedDate" : null,
              "fromSection" : "9",
              "toSection" : "9",
              "text" : "  § 9. Liability to pay compensation; notice of accident. If personal\\ninjury by accident arising out of and in the course of the employment is\\ncaused to the employee, the employer shall, subject as hereinafter\\nmentioned, be liable to pay compensation under the plan at the rates set\\nout in section ten of this article: provided that the employer shall not\\nbe liable in respect of any injury which does not disable the employee\\nfor a period of at least two weeks from earning full wages at the work\\nat which he was employed, and that the employer shall not be liable in\\nrespect of any injury to the employee which is caused by the serious and\\nwillful misconduct of that employee. No proceedings for recovery under\\nthe plan provided hereby shall be maintained unless notice of the\\naccident has been given to the employer as soon as practicable after the\\nhappening thereof and before the employee has voluntarily left the\\nemployment in which he was injured and during such disability, and\\nunless claim for compensation with respect to the accident has been made\\nwithin six months from the occurrence of the accident, or in the case of\\ndeath of the employee, or in the event of his physical or mental\\nincapacity within six months after such death or removal of such\\nphysical or mental incapacity, or in event that weekly payments have\\nbeen made under the plan, within six months after such payments have\\nceased; but no want of or defect or inaccuracy of a notice shall be a\\nbar to the maintenance of proceedings under the plan unless the employer\\nproves that he is prejudiced by said want, defect or inaccuracy. Notice\\nof the accident shall apprise the employer of the claim for compensation\\nunder this plan and shall state the name and address of the employee\\ninjured, the date and place of the accident and in simple language the\\ncause thereof. The notice may be served personally or by sending it by\\nmail in a registered letter addressed to the employer at his last known\\nresidence or place of business.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "10",
              "title" : "Amount of compensation; persons entitled; physical examination",
              "docType" : "SECTION",
              "docLevelId" : "10",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 13,
              "repealedDate" : null,
              "fromSection" : "10",
              "toSection" : "10",
              "text" : "  § 10. Amount of compensation; persons entitled; physical examination.\\nThe amount of compensation under the plan shall be: 1. In case death\\nresults from injury:\\n  (a) If the employee leaves a widow or next of kin at the time of his\\ndeath wholly dependent on his earnings, a sum equal to twelve hundred\\ntimes the daily earnings of the employee at the rate at which he was\\nbeing paid by the employer at the time of the accident, but not more in\\nany event than three thousand dollars. Any weekly payments previously\\nmade under the plan shall be deducted in ascertaining such amount\\npayable on death.\\n  (b) If such widow or next of kin or any of them are in part only\\ndependent upon his earnings, such sum not exceeding that provided in\\nsubdivision a as may be determined to be reasonable and proportionate to\\nthe injury to such dependents.\\n  (c) If he leaves no widow, or next of kin so dependent in whole or in\\npart, the reasonable expenses of his medical attendance and burial, not\\nexceeding one hundred dollars. Whatever sum may be determined to be\\npayable under the plan, in case of death of the injured employee, shall\\nbe paid to his legal representative for the benefit of such dependents,\\nor if he leaves no such dependents, for the benefit of the person to\\nwhom the expenses of medical attendance and burial are due.\\n  2. Where total or partial incapacity for work at any gainful\\nemployment results to the employee from the injury, a weekly payment\\ncommencing at the end of the second week after the injury and continuing\\nduring incapacity, subject as herein provided, not exceeding fifty per\\ncentum of his average weekly earnings when at work on full time during\\nthe preceding year during which he shall have been in the employment of\\nthe same employer, or if he shall have been employed less than a year,\\nthen a weekly payment of not exceeding three times the average daily\\nearnings on full time for such less period.\\n  In fixing the amount of the weekly payment, regard shall be had to any\\npayment, allowance or benefit which the workman may have received from\\nthe employer during the period of his incapacity, and in the case of\\npartial incapacity the weekly payment shall in no case exceed the\\ndifference between the amount of the average weekly earnings of the\\nworkman before the accident and the average amount which he is earning\\nor is able to earn in some suitable employment or business after the\\naccident, but shall amount to one-half of such difference. In no event\\nshall any weekly payment payable under the plan exceed ten dollars per\\nweek or extend over more than eight years from the date of the accident.\\nAny person entitled to receive weekly payments under the plan is\\nrequired, if requested by the employer, to submit himself for\\nexamination by a duly qualified medical practitioner or surgeon provided\\nand paid for by the employer, at a time and place reasonably convenient\\nfor the employee, within three weeks after the injury, and thereafter at\\nintervals not oftener than once in six weeks. If the workman refuses so\\nto submit, or obstructs the same, his right to weekly payments shall be\\nsuspended until such examination shall have taken place, and no\\ncompensation shall be payable under the plan during such period. In case\\nan injured employee shall be mentally incompetent at the time when any\\nright or privilege accrues to him under the plan, a committee or\\nguardian of the incompetent, appointed pursuant to law, may, on behalf\\nof such incompetent, claim and exercise any such right or privilege with\\nthe same force and effect as if the employee himself had been competent\\nand had claimed or exercised any such right or privilege; and no\\nlimitation of time herein provided for shall run so long as said\\nincompetent employee has no committee or guardian. In case an injured\\nemployee shall be under a substantial impairment within the meaning of\\nthe conservatorship provisions of article seventy-seven of the mental\\nhygiene law at the time when any property right accrues to him under the\\nplan, a conservator, appointed pursuant to law, may, on behalf of such\\nconservatee, claim and exercise any property right with the same force\\nand effect as if the employee had been capable of managing his affairs\\nand had claimed such right; and no limitation of time herein provided\\nshall run so long as said employee has no conservator.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "11",
              "title" : "Settlement of disputes",
              "docType" : "SECTION",
              "docLevelId" : "11",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 14,
              "repealedDate" : null,
              "fromSection" : "11",
              "toSection" : "11",
              "text" : "  § 11. Settlement of disputes. Any question of law or fact arising in\\nregard to the application of the plan in determining the compensation\\npayable thereunder or otherwise shall be determined either by agreement\\nor by arbitration, or by an action at law as herein provided. In case\\nthe employer shall be in default in any of his obligations to the\\nemployee under the plan, the injured employee or his committee,\\nconservator or guardian, if such be appointed, or his executor or\\nadministrator, may then bring an action to recover compensation under\\nthe plan in any court having jurisdiction thereof as on a written\\ncontract. Such action shall be conducted in the same manner as an action\\nat law for the recovery of damages for breach of a written contract, and\\nshall for all purposes, including the determination of jurisdiction, be\\ndeemed such an action. The judgment in such action, in favor of the\\nplaintiff, shall be for a lump sum equal to the amount of the payments\\nthen due and prospectively due under the plan. In such action by an\\nexecutor or administrator the judgment may provide the proportions of\\nthe award or the costs to be distributed to or between the several\\ndependents. If such determination is not made it shall be determined by\\nthe surrogate's court by which such executor or administrator is\\nappointed, in accordance with the terms of this article on petition of\\nany party on such notice as such court may direct.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "12",
              "title" : "Preferential claim; not assignable or subject to attachment; attorney's fees",
              "docType" : "SECTION",
              "docLevelId" : "12",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 15,
              "repealedDate" : null,
              "fromSection" : "12",
              "toSection" : "12",
              "text" : "  § 12. Preferential claim; not assignable or subject to attachment;\\nattorney's fees. Any person entitled to weekly payments under the plan\\nagainst any employer shall have the same preferential claim therefor\\nagainst the assets of the employer as now allowed by law for a claim by\\nsuch person against such employer for unpaid wages or personal services.\\nWeekly payments due under the plan shall not be assignable or subject to\\nattachment, levy or execution. No claim of an attorney for any\\ncontingent interest in any recovery under the plan for services in\\nsecuring such recovery shall be an enforceable lien thereon, unless the\\namount of the same be approved in writing by a justice of the supreme\\ncourt, or in case the same is tried in any court, before the justice\\npresiding at such trial.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "13",
              "title" : "Cancellation of consent",
              "docType" : "SECTION",
              "docLevelId" : "13",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 16,
              "repealedDate" : null,
              "fromSection" : "13",
              "toSection" : "13",
              "text" : "  § 13. Cancellation of consent. When a consent to the plan shall have\\nbeen filed in the office of the county clerk as herein provided, it\\nshall be binding upon both parties thereto as long as the relation of\\nemployer and employee exists between the parties, and expire at the end\\nof such employment, but it may at any time be canceled on sixty days'\\nnotice in writing from either party to the other. Such notice of\\ncancellation shall be effective only if served personally or sent by\\nregistered letter to the last known post-office address of the party to\\nwhom it is addressed, but no notice of cancellation shall be effective\\nas to a claim for injury occurring previous thereto.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "14",
              "title" : "Reports of compensation plan",
              "docType" : "SECTION",
              "docLevelId" : "14",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 17,
              "repealedDate" : null,
              "fromSection" : "14",
              "toSection" : "14",
              "text" : "  § 14. Reports of compensation plan. Each employer who shall sign with\\nany employee a consent to the plan shall, within thirty days thereafter,\\nfile with the industrial commission a statement thereof, signed by such\\nemployer, which shall show (a) the name of the employer and his\\npost-office address, (b) the name of the employee and his last known\\npost-office address, (c) the date of, and office where the original\\nconsent is filed, (d) the weekly wage of the employee at the time the\\nconsent is signed; unless such statement is duly filed, such consent of\\nthe employee shall not be a bar to any proceeding at law commenced by\\nthe employee against the employer.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "15",
              "title" : "Reports by employer",
              "docType" : "SECTION",
              "docLevelId" : "15",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 18,
              "repealedDate" : null,
              "fromSection" : "15",
              "toSection" : "15",
              "text" : "  § 15. Reports by employer. Each employer of labor in this state who\\nshall have entered into the plan with any employee shall, on or before\\nthe first day of January, nineteen hundred and eleven, and thereafter\\nand at such times as may be required by the industrial commission, make\\na report to such commission of all amounts, if any, paid by him under\\nsuch plan to injured employees, stating the name of such employees, and\\nshowing separately the amounts paid under agreement with the employees,\\nand the amounts paid after proceedings at law, and the proceedings at\\nlaw under the plan then pending. Such reports shall be verified by the\\nemployer or a duly authorized agent in the same manner as affidavits.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            } ],
            "size" : 14
          },
          "repealed" : false
        }, {
          "lawId" : "EML",
          "lawName" : "Employers' Liability",
          "locationId" : "A3",
          "title" : "Laws Repealed; Construction; When to Take Effect",
          "docType" : "ARTICLE",
          "docLevelId" : "3",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 19,
          "repealedDate" : null,
          "fromSection" : "16",
          "toSection" : "18",
          "text" : "                               ARTICLE 3.\\n            LAWS REPEALED; CONSTRUCTION; WHEN TO TAKE EFFECT.\\nSection 16. Laws repealed.\\n        17. Construction.\\n        18. When to take effect.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "16",
              "title" : "Laws repealed",
              "docType" : "SECTION",
              "docLevelId" : "16",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 20,
              "repealedDate" : null,
              "fromSection" : "16",
              "toSection" : "16",
              "text" : "  § 16. Laws repealed. Of the laws enumerated in the schedule hereto\\nannexed, that portion specified in the last column is hereby repealed.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "17",
              "title" : "Construction",
              "docType" : "SECTION",
              "docLevelId" : "17",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 21,
              "repealedDate" : null,
              "fromSection" : "17",
              "toSection" : "17",
              "text" : "  § 17. Construction. The provisions of this chapter shall be construed\\nas a continuation of the provisions of sections two hundred to two\\nhundred and four of chapter thirty-six of the laws of nineteen hundred\\nand nine, as amended by chapter three hundred and fifty-two of the laws\\nof nineteen hundred and ten, and not as a new enactment, and nothing\\ncontained in this chapter shall apply to employers or employees in\\nhazardous occupations as such occupations are defined by the workmen's\\ncompensation law.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "EML",
              "lawName" : "Employers' Liability",
              "locationId" : "18",
              "title" : "This act shall take effect immediately",
              "docType" : "SECTION",
              "docLevelId" : "18",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 22,
              "repealedDate" : null,
              "fromSection" : "18",
              "toSection" : "18",
              "text" : "  § 18. This act shall take effect immediately.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            } ],
            "size" : 3
          },
          "repealed" : false
        } ],
        "size" : 3
      },
      "repealed" : false
    }
  }
}