{
  "success" : true,
  "message" : "The document structure for ETP law",
  "responseType" : "law-tree",
  "result" : {
    "lawVersion" : {
      "lawId" : "ETP",
      "activeDate" : "2019-06-28"
    },
    "info" : {
      "lawId" : "ETP",
      "name" : "Emergency Tenant Protection Act 576/74",
      "lawType" : "UNCONSOLIDATED",
      "chapter" : "1974"
    },
    "publishedDates" : [ "2014-09-22", "2015-06-26", "2015-07-03", "2019-06-28" ],
    "documents" : {
      "lawId" : "ETP",
      "lawName" : "Emergency Tenant Protection Act 576/74",
      "locationId" : "1974",
      "title" : "Emergency Tenant Protection Act 576/74",
      "docType" : "CHAPTER",
      "docLevelId" : "1974",
      "activeDate" : "2019-06-28",
      "sequenceNo" : 1,
      "repealedDate" : null,
      "fromSection" : "1",
      "toSection" : "14",
      "text" : "  § 4. The emergency tenant protection act of nineteen hundred\\nseventy-four is hereby enacted to read as follows:\\n                     EMERGENCY TENANT PROTECTION ACT\\n                        OF NINETEEN SEVENTY-FOUR\\nSection 1.    Short title.\\n        2.    Legislative finding.\\n        3.    Local determination of emergency; end of emergency.\\n        4.    Establishment of rent guidelines boards; duties.\\n        5.    Housing accommodations subject to regulation.\\n        6.    Regulation of rents.\\n        7.    Maintenance of services.\\n        8.    Administration.\\n        9.    Application for adjustment of initial legal regulated\\n                rent.\\n        10.   Regulations.\\n        10-a. Right to sublease.\\n        10-b. Major capital improvements and individual apartment\\n                improvements in rent regulated units.\\n        11.   Non-waiver of rights.\\n        12.   Enforcement and procedures.\\n        12-a. Rent registration.\\n        13.   Cooperation with other governmental agencies.\\n        14.   Application of act.\\n",
      "documents" : {
        "items" : [ {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "1",
          "title" : "Short title",
          "docType" : "SECTION",
          "docLevelId" : "1",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 2,
          "repealedDate" : null,
          "fromSection" : "1",
          "toSection" : "1",
          "text" : "  Section 1. Short title. This act shall be known and may be cited as\\nthe \"emergency tenant protection act of nineteen seventy-four\".\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "2",
          "title" : "Legislative finding",
          "docType" : "SECTION",
          "docLevelId" : "2",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 3,
          "repealedDate" : null,
          "fromSection" : "2",
          "toSection" : "2",
          "text" : "  § 2. Legislative finding. The legislature hereby finds and declares\\nthat a serious public emergency continues to exist in the housing of a\\nconsiderable number of persons in the state of New York, that such\\nemergency necessitates the intervention of federal, state and local\\ngovernment in order to prevent speculative, unwarranted and abnormal\\nincreases in rents; that there continues to exist in many areas of the\\nstate an acute shortage of housing accommodations caused by continued\\nhigh demand, attributable in part to new household formations and\\ndecreased supply, in large measure attributable to reduced availability\\nof federal subsidies, and increased costs of construction and other\\ninflationary factors; that a substantial number of persons residing in\\nhousing not presently subject to the provisions of this act or the\\nemergency housing rent control law or the local emergency housing rent\\ncontrol act are being charged excessive and unwarranted rents and rent\\nincreases; that preventive action by the legislature continues to be\\nimperative in order to prevent exaction of unjust, unreasonable and\\noppressive rents and rental agreements and to forestall profiteering,\\nspeculation and other disruptive practices tending to produce threats to\\nthe public health, safety and general welfare; that in order to prevent\\nuncertainty, hardship and dislocation, the provisions of this act are\\nnecessary and designed to protect the public health, safety and general\\nwelfare; that the transition from regulation to a normal market of free\\nbargaining between landlord and tenant, while the ultimate objective of\\nstate policy, must take place with due regard for such emergency; and\\nthat the policy herein expressed shall be subject to determination of\\nthe existence of a public emergency requiring the regulation of\\nresidential rents within any city, town or village by the local\\nlegislative body of such city, town or village.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "3",
          "title" : "Local determination of emergency; end of emergency",
          "docType" : "SECTION",
          "docLevelId" : "3",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 4,
          "repealedDate" : null,
          "fromSection" : "3",
          "toSection" : "3",
          "text" : "  § 3. Local determination of emergency; end of emergency. a. The\\nexistence of public emergency requiring the regulation of residential\\nrents for all or any class or classes of housing accommodations,\\nincluding any plot or parcel of land which had been rented prior to May\\nfirst, nineteen hundred fifty, for the purpose of permitting the tenant\\nthereof to construct or place his own dwelling thereon and on which plot\\nor parcel of land there exists a dwelling owned and occupied by a tenant\\nof such plot or parcel, heretofore destabilized; heretofore or hereafter\\ndecontrolled, exempt, not subject to control, or exempted from\\nregulation and control under the provisions of the emergency housing\\nrent control law, the local emergency housing rent control act or the\\nNew York city rent stabilization law of nineteen hundred sixty-nine; or\\nsubject to stabilization or control under such rent stabilization law,\\nshall be a matter for local determination within each city, town or\\nvillage. Any such determination shall be made by the local legislative\\nbody of such city, town or village on the basis of the supply of housing\\naccommodations within such city, town or village, the condition of such\\naccommodations and the need for regulating and controlling residential\\nrents within such city, town or village. A declaration of emergency may\\nbe made as to any class of housing accommodations if the vacancy rate\\nfor the housing accommodations in such class within such municipality is\\nnot in excess of five percent and a declaration of emergency may be made\\nas to all housing accommodations if the vacancy rate for the housing\\naccommodations within such municipality is not in excess of five\\npercent.\\n  b. The local governing body of a city, town or village having declared\\nan emergency pursuant to subdivision a of this section may at any time,\\non the basis of the supply of housing accommodations within such city,\\ntown or village, the condition of such accommodations and the need for\\ncontinued regulation and control of residential rents within such\\nmunicipality, declare that the emergency is either wholly or partially\\nabated or that the regulation of rents pursuant to this act does not\\nserve to abate such emergency and thereby remove one or more classes of\\naccommodations from regulation under this act. The emergency must be\\ndeclared at an end once the vacancy rate described in subdivision a of\\nthis section exceeds five percent.\\n  c. No resolution declaring the existence or end of an emergency, as\\nauthorized by subdivisions a and b of this section, may be adopted\\nexcept after public hearing held on not less than ten days public\\nnotice, as the local legislative body may reasonably provide.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "4",
          "title" : "Establishment of rent guidelines boards; duties",
          "docType" : "SECTION",
          "docLevelId" : "4",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 5,
          "repealedDate" : null,
          "fromSection" : "4",
          "toSection" : "4",
          "text" : "  § 4. Establishment of rent guidelines boards; duties. a. In each\\ncounty wherein any city having a population of less than one million or\\nany town or village has determined the existence of an emergency\\npursuant to section three of this act, there shall be created a rent\\nguidelines board to consist of nine members appointed by the\\ncommissioner of housing and community renewal upon recommendation of the\\ncounty legislature, except that a rent guidelines board created\\nsubsequent to the effective date of the chapter of the laws of two\\nthousand nineteen that amended this section shall consist of nine\\nmembers appointed by the commissioner of housing and community renewal\\nupon recommendations of the local legislative body of each city having a\\npopulation of less than one million or town or village which has\\ndetermined the existence of an emergency pursuant to section three of\\nthis act. Such recommendation shall be made within thirty days after the\\nfirst local declaration of an emergency in such county; two such members\\nshall be representative of tenants, two shall be representative of\\nowners of property, and five shall be public members each of whom shall\\nhave had at least five years experience in either finance, economics or\\nhousing. One public member shall be designated by the commissioner to\\nserve as chairman and shall hold no other public office. No member,\\nofficer or employee of any municipal rent regulation agency or the state\\ndivision of housing and community renewal and no person who owns or\\nmanages real estate covered by this law or who is an officer of any\\nowner or tenant organization shall serve on a rent guidelines board. One\\npublic member, one member representative of tenants and one member\\nrepresentative of owners shall serve for a term ending two years from\\nJanuary first next succeeding the date of their appointment; one public\\nmember, one member representative of tenants and one member\\nrepresentative of owners shall serve for terms ending three years from\\nthe January first next succeeding the date of their appointment and\\nthree public members shall serve for terms ending four years from\\nJanuary first next succeeding the dates of their appointment.\\nThereafter, all members shall serve for terms of four years each.\\nMembers shall continue in office until their successors have been\\nappointed and qualified. The commissioner shall fill any vacancy which\\nmay occur by reason of death, resignation or otherwise in a manner\\nconsistent with the original appointment. A member may be removed by the\\ncommissioner for cause, but not without an opportunity to be heard in\\nperson or by counsel, in his defense, upon not less than ten days\\nnotice. Compensation for the members of the board shall be at the rate\\nof one hundred dollars per day, for no more than twenty days a year,\\nexcept that the chairman shall be compensated at the rate of one hundred\\ntwenty-five dollars a day for no more than thirty days a year. The board\\nshall be provided staff assistance by the division of housing and\\ncommunity renewal. The compensation of such members and the costs of\\nstaff assistance shall be paid by the division of housing and community\\nrenewal which shall be reimbursed in the manner prescribed in section\\nfour of this act. The local legislative body of each city having a\\npopulation of less than one million and each town and village in which\\nan emergency has been determined to exist as herein provided shall be\\nauthorized to designate one person who shall be representative of\\ntenants and one person who shall be representative of owners of property\\nto serve at its pleasure and without compensation to advise and assist\\nthe county rent guidelines board in matters affecting the adjustment of\\nrents for housing accommodations in such city, town or village as the\\ncase may be.\\n  a-1. Notwithstanding the provisions of subdivision a of this section\\nto the contrary, in each county that became subject to this act pursuant\\nto the chapter of the laws of two thousand nineteen that amended this\\nsection, the commissioner shall reconstitute the existing rent\\nguidelines board subsequent to any initial local declaration of\\nemergency within such county for the purpose of ensuring representation\\nof all cities having a population of less than one million and all towns\\nand villages within such county having determined the existence of an\\nemergency in accordance with this act are represented, pursuant to rules\\nand regulations promulgated by the division of housing and community\\nrenewal.\\n  b. A county rent guidelines board shall establish annual guidelines\\nfor rent adjustments which, at its sole discretion may be varied and\\ndifferent for and within the several zones and jurisdictions of the\\nboard, and in determining whether rents for housing accommodations as to\\nwhich an emergency has been declared pursuant to this act shall be\\nadjusted, shall consider among other things (1) the economic condition\\nof the residential real estate industry in the affected area including\\nsuch factors as the prevailing and projected (i) real estate taxes and\\nsewer and water rates, (ii) gross operating maintenance costs (including\\ninsurance rates, governmental fees, cost of fuel and labor costs), (iii)\\ncosts and availability of financing (including effective rates of\\ninterest), (iv) over-all supply of housing accommodations and over-all\\nvacancy rates, (2) relevant data from the current and projected cost of\\nliving indices for the affected area, (3) such other data as may be made\\navailable to it. As soon as practicable after its creation and\\nthereafter not later than July first of each year, a rent guidelines\\nboard shall file with the state division of housing and community\\nrenewal its findings for the preceding calendar year, and shall\\naccompany such findings with a statement of the maximum rate or rates of\\nrent adjustment, if any, for one or more classes of accommodation\\nsubject to this act, authorized for leases or other rental agreements\\ncommencing during the next succeeding twelve months. The standards for\\nrent adjustments may be applicable for the entire county or may be\\nvaried according to such zones or jurisdictions within such county as\\nthe board finds necessary to achieve the purposes of this subdivision. A\\nrent guidelines board shall not establish annual guidelines for rent\\nadjustments based on the current rental cost of a unit or on the amount\\nof time that has elapsed since another rent increase was authorized\\npursuant to this chapter.\\n  The standards for rent adjustments established annually shall be\\neffective for leases commencing on October first of each year and during\\nthe next succeeding twelve months whether or not the board has filed its\\nfindings and statement of the maximum rate or rates of rent adjustment\\nby July first of each year. If such lease is entered into before such\\nfiling by the board, it may provide for the rent to be adjusted by the\\nrates then in effect, subject to change by the applicable rates of rent\\nadjustment when filed, such change to be effective as of the date of the\\ncommencement of the lease. Said lease must provide that, if the new\\nrates of rent adjustment differ for leases of different terms, the\\ntenant has the option of changing the original lease term to any other\\nterm for which a rate of rent adjustment is set by the board, with the\\nrental to be adjusted accordingly.\\n  Where a city, town or village shall act to determine the existence of\\npublic emergency pursuant to section three of this act subsequent to the\\nestablishment of annual guidelines for rent adjustments of the\\naccommodations subject to this act, the rent guidelines board as soon as\\npracticable thereafter shall file its findings and rates of rent\\nadjustment for leases or other rental agreements for the housing\\naccommodations in such a city, town or village, which rates shall be\\neffective for leases or other rental agreements commencing on or after\\nthe effective date of the determination.\\n  c. In a city having a population of one million or more, the rent\\nguidelines board shall be the rent guidelines board established pursuant\\nto the New York city rent stabilization law of nineteen hundred\\nsixty-nine as amemded, and such board shall have the powers granted\\npursuant to the New York city rent stabilization law of nineteen hundred\\nsixty-nine as amended.\\n  d. Maximum rates of rent adjustment shall not be established more than\\nonce annually for any housing accommodation within a board's\\njurisdiction. Once established, no such rate shall, within the one-year\\nperiod, be adjusted by any surcharge, supplementary adjustment or other\\nmodification.\\n  e. Notwithstanding any other provision of this act, the adjustment for\\nvacancy leases covered by the provisions of this act shall be determined\\nexclusively pursuant to section ten of this act. Rent guidelines boards\\nshall no longer promulgate adjustments for vacancy leases.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "5",
          "title" : "Housing accommodations subject to regulation",
          "docType" : "SECTION",
          "docLevelId" : "5",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 6,
          "repealedDate" : null,
          "fromSection" : "5",
          "toSection" : "5",
          "text" : "  § 5. Housing accommodations subject to regulation. a. A declaration of\\nemergency may be made pursuant to section three as to all or any class\\nor classes of housing accommodations in a municipality, except:\\n  (1) housing accommodations subject to the emergency housing rent\\ncontrol law, or the local emergency housing rent control act, other than\\nhousing accommodations subject to the New York city rent stabilization\\nlaw of nineteen hundred sixty-nine;\\n  (2) housing accommodations owned or operated by the United States, the\\nstate of New York, any political subdivision, agency or instrumentality\\nthereof, any municipality or any public housing authority;\\n  (3) housing accommodations in buildings in which rentals are fixed by\\nor subject to the supervision of the state division of housing and\\ncommunity renewal under other provisions of law or the New York city\\ndepartment of housing preservation and development or the New York state\\nurban development corporation, or, to the extent that regulation under\\nthis act is inconsistent therewith aided by government insurance under\\nany provision of the National Housing Act;\\n  (4) (a) housing accommodations in a building containing fewer than six\\ndwelling units, other than any plot or parcel of land in cities having a\\npopulation of one million or more which had been rented prior to May\\nfirst, nineteen hundred fifty, for the purpose of permitting the tenant\\nthereof to construct or place his own dwelling thereon and heretofore or\\nhereafter decontrolled, exempt, not subject to control or exempted from\\nregulation and control under the provisions of the emergency housing\\nrent control law or the local emergency housing rent control act and on\\nwhich plot or parcel of land there exists a dwelling owned and occupied\\nby a tenant of such plot or parcel;\\n  (b) for purposes of this paragraph four, a building shall be deemed to\\ncontain six or more dwelling units if it is part of a multiple family\\ngarden-type maisonette dwelling complex containing six or more dwelling\\nunits having common facilities such as a sewer line, water main or\\nheating plant and operated as a unit under common ownership,\\nnotwithstanding that certificates of occupancy were issued for portions\\nthereof as one- or two-family dwellings.\\n  (5) housing accommodations in buildings completed or buildings\\nsubstantially rehabilitated as family units on or after January first,\\nnineteen hundred seventy-four;\\n  (5-a) housing accommodations located outside of a city with a\\npopulation of one million or more in any such buildings that were vacant\\nand unoccupied on June first, two thousand nineteen and had been vacant\\nand unoccupied for at least the one-year period immediately preceding\\nsuch date;\\n  (6) housing accommodations owned or operated by a hospital, convent,\\nmonastery, asylum, public institution, or college or school dormitory or\\nany institution operated exclusively for charitable or educational\\npurposes on a non-profit basis other than (i) those accommodations\\noccupied by a tenant on the date such housing accommodation is acquired\\nby any such institution, or which are occupied subsequently by a tenant\\nwho is not affiliated with such institution at the time of his initial\\noccupancy or (ii) permanent housing accommodations with government\\ncontracted services, as of and after June fourteenth, two thousand\\nnineteen, to vulnerable individuals or individuals with disabilities who\\nare or were homeless or at risk of homelessness; provided, however, that\\nthe terms of leases in existence as of June fourteenth, two thousand\\nnineteen, shall only be affected upon lease renewal, and further\\nprovided that upon the vacancy of such housing accommodations, the legal\\nregulated rent for such housing accommodations shall be the legal\\nregulated rent paid for such housing accommodations by the prior tenant,\\nsubject only to any adjustment adopted by the applicable rent guidelines\\nboard;\\n  (7) rooms or other housing accommodations in hotels, other than hotel\\naccommodations in cities having a population of one million or more not\\noccupied on a transient basis and heretofore subject to the emergency\\nhousing rent control law, the local emergency housing rent control act\\nor to the New York city rent stabilization law of nineteen hundred\\nsixty-nine;\\n  (8) any motor court, or any part thereof, any trailer, or trailer\\nspace used exclusively for transient occupancy or any part thereof; or\\nany tourist home serving transient guests exclusively, or any part\\nthereof;\\n  The term \"motor court\" shall mean an establishment renting rooms,\\ncottages or cabins, supplying parking or storage facilities for motor\\nvehicles in connection with such renting and other services and\\nfacilities customarily supplied by such establishments, and commonly\\nknown as motor, auto or tourist court in the community.\\n  The term \"tourist home\" shall mean a rooming house which caters\\nprimarily to transient guests and is known as a tourist home in the\\ncommunity.\\n  (9) non-housekeeping, furnished housing accommodations, located within\\na single dwelling unit not used as a rooming or boarding house, but only\\nif:\\n  (a) no more than two tenants for whom rent is paid (husband and wife\\nbeing considered one tenant for this purpose), not members of the\\nlandlord's immediate family, live in such dwelling unit, and\\n  (b) the remaining portion of such dwelling unit is occupied by the\\nlandlord or his immediate family.\\n  (10) housing accommodations in buildings operated exclusively for\\ncharitable purposes on a non-profit basis except for permanent housing\\naccommodations with government contracted services, as of and after the\\neffective date of the chapter of the laws of two thousand nineteen that\\namended this paragraph, to vulnerable individuals or individuals with\\ndisabilities who are or were homeless or at risk of homelessness;\\nprovided, however, that the terms of leases in existence as of the\\neffective date of the chapter of the laws of two thousand nineteen that\\namended this paragraph, shall only be affected upon lease renewal, and\\nfurther provided that upon the vacancy of such housing accommodations,\\nthe legal regulated rent for such housing accommodations shall be the\\nlegal regulated rent paid for such housing accommodations by the prior\\ntenant, subject only to any adjustment adopted by the applicable rent\\nguidelines board;\\n  (11) housing accommodations which are not occupied by the tenant, not\\nincluding subtenants or occupants, as his or her primary residence, as\\ndetermined by a court of competent jurisdiction. For the purposes of\\ndetermining primary residency, a tenant who is a victim of domestic\\nviolence, as defined in section four hundred fifty-nine-a of the social\\nservices law, who has left the unit because of such violence, and who\\nasserts an intent to return to the housing accommodation shall be deemed\\nto be occupying the unit as his or her primary residence. For the\\npurposes of this paragraph, where a housing accommodation is rented to a\\nnot-for-profit hospital for residential use, affiliated subtenants\\nauthorized to use such accommodations by such hospital shall be deemed\\nto be tenants. For the purposes of this paragraph, where a housing\\naccommodation is rented to a not-for-profit for providing, as of and\\nafter the effective date of the chapter of the laws of two thousand\\nnineteen that amended this paragraph, permanent housing to individuals\\nwho are or were homeless or at risk of homelessness, affiliated\\nsubtenants authorized to use such accommodations by such not-for-profit\\nshall be deemed to be tenants. No action or proceeding shall be\\ncommenced seeking to recover possession on the ground that a housing\\naccommodation is not occupied by the tenant as his or her primary\\nresidence unless the owner or lessor shall have given thirty days notice\\nto the tenant of his or her intention to commence such action or\\nproceeding on such grounds.\\n  (14) (i) housing accommodations owned as a cooperative or condominium\\nunit which are or become vacant on or after the effective date of this\\nparagraph, except that this subparagraph shall not apply to units\\noccupied by non-purchasing tenants under section three hundred\\nfifty-two-eee of the general business law until the occurrence of a\\nvacancy. (ii) This paragraph shall not apply, however, to or become\\neffective with respect to housing accommodations which the commissioner\\ndetermines or finds the landlord or any person acting on his or her\\nbehalf, with intent to cause the tenant to vacate, engaged in any course\\nof conduct (including, but not limited to, interruption or\\ndiscontinuance of required services) which interfered with or disturbed\\nor was intended to interfere with or disturb the comfort, repose, peace\\nor quiet of the tenant in his or her use or occupancy of the housing\\naccommodations. In connection with such course of conduct any other\\ngeneral enforcement provision of this act shall also apply;\\n  b. Notwithstanding any other provision of this section, nothing shall\\nprevent the declaration of an emergency pursuant to section three of\\nthis act for rental housing accommodations located in buildings or\\nstructures which are subject to the provisions of article eighteen of\\nthe private housing finance law.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "5-A",
          "title" : "High income rent deregulation",
          "docType" : "SECTION",
          "docLevelId" : "5-A",
          "activeDate" : "2015-07-03",
          "sequenceNo" : 7,
          "repealedDate" : null,
          "fromSection" : "5-A",
          "toSection" : "5-A",
          "text" : "  * § 5-a. High income rent deregulation. (a) 1. For purposes of this\\nsection, annual income shall mean the federal adjusted gross income as\\nreported on the New York state income tax return. Total annual income\\nmeans the sum of the annual incomes of all persons whose names are\\nrecited as the tenant or co-tenant on a lease who occupy the housing\\naccommodation and all other persons that occupy the housing\\naccommodation as their primary residence on other than a temporary\\nbasis, excluding bona fide employees of such occupants residing therein\\nin connection with such employment and excluding bona fide subtenants in\\noccupancy pursuant to the provisions of section two hundred twenty-six-b\\nof the real property law. In the case where a housing accommodation is\\nsublet, the annual income of the tenant or co-tenant recited on the\\nlease who will reoccupy the housing accommodation upon the expiration of\\nthe sublease shall be considered.\\n  2. Deregulation income threshold means total annual income equal to\\none hundred seventy-five thousand dollars in each of the two preceding\\ncalendar years for proceedings commenced before July first, two thousand\\neleven. For proceedings commenced on or after July first, two thousand\\neleven, the deregulation income threshold means the total annual income\\nequal to two hundred thousand dollars in each of the two preceding\\ncalendar years.\\n  3. Deregulation rent threshold means two thousand dollars for\\nproceedings commenced before July first, two thousand eleven. For\\nproceedings commenced on or after July first, two thousand eleven, the\\nderegulation rent threshold means two thousand five hundred dollars. For\\nproceedings commenced on or after July first, two thousand fifteen, the\\nderegulation rent threshold means two thousand seven hundred dollars,\\nprovided, however that on January 1, 2016, and annually thereafter, the\\nmaximum legal regulated rent for this deregulation threshold shall be\\nadjusted by the same percentage as the most recent one year renewal\\nadjustment adopted by the rent guidelines board.\\n  (b) On or before the first day of May in each calendar year, the owner\\nof each housing accommodation for which the legal regulated monthly rent\\nequals or exceeds the deregulation rent threshold may provide the tenant\\nor tenants residing therein with an income certification form prepared\\nby the division of housing and community renewal on which such tenant or\\ntenants shall identify all persons referred to in subdivision (a) of\\nthis section and shall certify whether the total annual income is in\\nexcess of the deregulation income threshold in each of the two preceding\\ncalendar years. Such income certification form shall state that the\\nincome level certified to by the tenant may be subject to verification\\nby the department of taxation and finance pursuant to section one\\nhundred seventy-one-b of the tax law, and shall not require disclosure\\nof any information other than whether the aforementioned threshold has\\nbeen exceeded. Such income certification form shall clearly state that:\\n(i) only tenants residing in housing accommodations which had a legal\\nregulated monthly rent that equals or exceeds the deregulation rent\\nthreshold are required to complete the certification form; (ii) that\\ntenants have protections available to them which are designed to prevent\\nharassment; (iii) that tenants are not required to provide any\\ninformation regarding their income except that which is requested on the\\nform and may contain such other information the division deems\\nappropriate. The tenant or tenants shall return the completed\\ncertification to the owner within thirty days after service upon the\\ntenant or tenants. In the event that the total annual income as\\ncertified is in excess of the deregulation income threshold in each of\\nthe two preceding calendar years, the owner may file the certification\\nwith the state division of housing and community renewal on or before\\nJune thirtieth of such year. Upon filing such certification with the\\ndivision, the division shall, within thirty days after the filing, issue\\nan order providing that such housing accommodation shall not be subject\\nto the provisions of this act upon the expiration of the existing lease.\\nA copy of such order shall be mailed by regular and certified mail,\\nreturn receipt requested, to the tenant or tenants and a copy thereof\\nshall be mailed to the owner.\\n  (c) 1. In the event that the tenant or tenants either fail to return\\nthe completed certification to the owner on or before the date required\\nby subdivision (b) of this section or the owner disputes the\\ncertification returned by the tenant or tenants, the owner may, on or\\nbefore June thirtieth of such year, petition the state division of\\nhousing and community renewal to verify, pursuant to section one hundred\\nseventy-one-b of the tax law, whether the total annual income exceeds\\nthe deregulation income threshold in each of the two preceding calendar\\nyears. Within twenty days after the filing of such request with the\\ndivision, the division shall notify the tenant or tenants that such\\ntenant or tenants named on the lease must provide the division with such\\ninformation as the division and the department of taxation and finance\\nshall require to verify whether the total annual income exceeds the\\nderegulation income threshold in each of the two preceding calendar\\nyears. The division's notification shall require the tenant or tenants\\nto provide the information to the division within sixty days of service\\nupon such tenant or tenants and shall include a warning in bold faced\\ntype that failure to respond will result in an order being issued by the\\ndivision providing that such housing accommodations shall not be subject\\nto the provisions of this act.\\n  2. If the department of taxation and finance determines that the total\\nannual income is in excess of the deregulation income threshold in each\\nof the two preceding calendar years, the division shall, on or before\\nNovember fifteenth of such year, notify the owner and tenants of the\\nresults of such verification. Both the owner and the tenants shall have\\nthirty days within which to comment on such verification results. Within\\nforty-five days after the expiration of the comment period, the division\\nshall, where appropriate, issue an order providing that such housing\\naccommodation shall not be subject to the provisions of this act upon\\nexpiration of the existing lease. A copy of such order shall be mailed\\nby regular and certified mail, return receipt requested, to the tenant\\nor tenants and a copy thereof shall be sent to the owner.\\n  3. In the event the tenant or tenants fail to provide the information\\nrequired pursuant to paragraph one of this subdivision, the division\\nshall issue, on or before December first of such year, an order\\nproviding that such housing accommodation shall not be subject to the\\nprovisions of this act upon the expiration of the current lease. A copy\\nof such order shall be mailed by regular and certified mail, return\\nreceipt requested, to the tenant or tenants and a copy thereof shall be\\nsent to the owner.\\n  4. The provisions of the state freedom of information act shall not\\napply to any income information obtained by the division pursuant to\\nthis section.\\n  (d) This section shall apply only to paragraph twelve of subdivision a\\nof section five of this act.\\n  (e) Upon receipt of such order of deregulation pursuant to this\\nsection, an owner shall offer the housing accommodation subject to such\\norder to the tenant at a rent not in excess of the market rent, which\\nfor the purposes of this section means a rent obtainable in an arm's\\nlength transaction. Such rental offer shall be made by the owner in\\nwriting to the tenant by certified and regular mail and shall inform the\\ntenant that such offer must be accepted in writing within ten days of\\nreceipt.  The tenant shall respond within ten days after receipt of such\\noffer. If the tenant declines the offer or fails to respond within such\\nperiod, the owner may commence an action or proceeding for the eviction\\nof such tenant.\\n  * NB Expires June 16, 2019\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "6",
          "title" : "Regulation of rents",
          "docType" : "SECTION",
          "docLevelId" : "6",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 8,
          "repealedDate" : null,
          "fromSection" : "6",
          "toSection" : "6",
          "text" : "  § 6. Regulation of rents. a. Notwithstanding the provisions of any\\nlease or other rental agreement, no owner shall, on or after the first\\nday of the first month or other rental period following a declaration of\\nemergency pursuant to section three, which date shall be referred to in\\nthis act as the local effective date, charge or collect any rent in\\nexcess of the initial legal regulated rent or adjusted initial legal\\nregulated rent until such time as a different legal regulated rent shall\\nbe authorized pursuant to guidelines adopted by a rent guidelines board\\npursuant to section four.\\n  b. The initial legal regulated rents for housing accommodations in a\\ncity having a population of less than one million or a town or village\\nas to which a declaration of emergency has been made pursuant to this\\nact shall be:\\n  (1) For housing accommodations subject to the emergency housing rent\\ncontrol law which become vacant on or after the local effective date of\\nthis act, the rent agreed to by the landlord and the tenant and reserved\\nin a lease or provided for in a rental agreement; provided that such\\ninitial legal regulated rent may be adjusted on application of the owner\\nor tenant pursuant to subdivision a of section nine of this act; and\\nprovided further that no increase of such initial regulated rent\\npursuant to annual guidelines adopted by the rent guidelines board shall\\nbecome effective until the expiration of the first lease or rental\\nagreement taking effect after the local effective date, but in no event\\nbefore one year from the commencement of such rental agreement.\\n  (2) For all other housing accommodations, the rent reserved in the\\nlast effective lease or other rental agreement; provided that an initial\\nrent based upon the rent reserved in a lease or other rental agreement\\nwhich became effective on or after January first, nineteen hundred\\nseventy-four may be adjusted on application of the tenant pursuant to\\nsubdivision b of section nine of this act or on application of either\\nthe owner or tenant pursuant to subdivision a of such section; and\\nfurther provided that if a lease is entered into for such housing\\naccommodations after the local effective date, but before the effective\\ndate of the first guidelines applicable to such accommodations, the\\nlease may provide for an adjustment of rent pursuant to such guidelines,\\nto be effective on the first day of the month next succeeding the\\neffective date of such guidelines.\\n  c. The initial legal regulated rents for housing accommodations in a\\ncity having a population of one million or more shall be the initial\\nrent established pursuant to the New York city rent stabilization law of\\nnineteen hundred sixty-nine as amended.\\n  d. Provision shall be made pursuant to regulations under this act for\\nindividual adjustment of rents where:\\n  (1) there has been a substantial modification or increase of dwelling\\nspace, or installation of new equipment or improvements or new furniture\\nor furnishings, provided in or to a tenant's housing accommodation, on\\nwritten informed tenant consent to the rent increase. In the case of a\\nvacant housing accommodation, tenant consent shall not be required. The\\ntemporary increase in the legal regulated rent for the affected housing\\naccommodation shall be one-one hundred sixty-eighth, in the case of a\\nbuilding with thirty-five or fewer housing accommodations or one-one\\nhundred eightieth in the case of a building with more than thirty-five\\nhousing accommodations where such increase takes effect on or after the\\neffective date of the chapter of the laws of two thousand nineteen that\\namended this paragraph, of the total actual cost incurred by the\\nlandlord up to fifteen thousand dollars in providing such reasonable and\\nverifiable modification or increase in dwelling space, furniture,\\nfurnishings, or equipment, including the cost of installation but\\nexcluding finance charges and any costs that exceed reasonable costs\\nestablished by rules and regulations promulgated by the division of\\nhousing and community renewal. Such rules and regulations shall include:\\n(i) requirements for work to be done by licensed contractors and a\\nprohibition on common ownership between the landlord and the contractor\\nor vendor; and (ii) a requirement that the owner resolve within the\\ndwelling space all outstanding hazardous or immediately hazardous\\nviolations of the Uniform Fire Prevention and Building Code (Uniform\\nCode), New York City Fire Code, or New York City Building and Housing\\nMaintenance Codes, if applicable. Provided further that an owner who is\\nentitled to a rent increase pursuant to this paragraph shall not be\\nentitled to a further rent increase based upon the installation of\\nsimilar equipment, or new furniture or furnishings within the useful\\nlife of such new equipment, or new furniture or furnishings. Provided\\nfurther that the recoverable costs incurred by the landlord, pursuant to\\nthis paragraph, shall be limited to an aggregate cost of fifteen\\nthousand dollars that may be expended on no more than three separate\\nindividual apartment improvements in a fifteen year period beginning\\nwith the first individual apartment improvement on or after June\\nfourteenth, two thousand nineteen. Provided further that increases to\\nthe legal regulated rent pursuant to this paragraph shall be removed\\nfrom the legal regulated rent thirty years from the date the increase\\nbecame effective inclusive of any increases granted by the applicable\\nrent guidelines board.\\n  (2) there has been since January first, nineteen hundred seventy-four\\nan increase in the rental value of the housing accommodations as a\\nresult of a substantial rehabilitation of the building or the housing\\naccommodation therein which materially adds to the value of the property\\nor appreciably prolongs its life, excluding ordinary repairs,\\nmaintenance, and replacements, or\\n  (3) there has been since January first, nineteen hundred seventy-four\\na major capital improvement essential for the preservation, energy\\nefficiency, functionality, or infrastructure of the entire building,\\nimprovement of the structure including heating, windows, plumbing and\\nroofing, but shall not be for operation costs or unnecessary cosmetic\\nimprovements. An adjustment under this paragraph shall be in an amount\\nsufficient to amortize the cost of the improvements pursuant to this\\nparagraph over a twelve-year period for a building with thirty-five or\\nfewer housing accommodations, or a twelve and one-half period for a\\nbuilding with more than thirty-five housing accommodations and shall be\\nremoved from the legal regulated rent thirty years from the date the\\nincrease became effective inclusive of any increases granted by the\\napplicable rent guidelines board, for any determination issued by the\\ndivision of housing and community renewal after the effective date of\\nthe chapter of the laws of two thousand nineteen that amended this\\nparagraph. Temporary major capital improvement increases shall be\\ncollectable prospectively on the first day of the first month beginning\\nsixty days from the date of mailing notice of approval to the tenant.\\nSuch notice shall disclose the total monthly increase in rent and the\\nfirst month in which the tenant would be required to pay the temporary\\nincrease. An approval for a temporary major capital improvement increase\\nshall not include retroactive payments. The collection of any increase\\nshall not exceed two percent in any year from the effective date of the\\norder granting the increase over the rent set forth in the schedule of\\ngross rents, with collectability of any dollar excess above said sum to\\nbe spread forward in similar increments and added to the rent as\\nestablished or set in future years. Upon vacancy, the landlord may add\\nany remaining balance of the temporary major capital improvement\\nincrease to the legal regulated rent. Notwithstanding any other\\nprovision of the law, the collection of any rent increases for any\\nrenewal lease commencing on or after June 14, 2019, due to any major\\ncapital improvements approved on or after June 16, 2012 and before June\\n16, 2019 shall not exceed two percent in any year for any tenant in\\noccupancy on the date the major capital improvement was approved, or\\n  (3-a) an application for a temporary major capital improvement\\nincrease has been filed, a tenant shall have sixty days from the date of\\nmailing of a notice of a proceeding in which to answer or reply. The\\nstate division of housing and community renewal shall provide any\\nresponding tenant with the reasons for the division's approval or denial\\nof such application; or\\n  (4) an owner by application to the state division of housing and\\ncommunity renewal for increases in the rents in excess of the rent\\nadjustment authorized by the rent guidelines board under this act\\nestablishes a hardship, and the state division finds that the rate of\\nrent adjustment is not sufficient to enable the owner to maintain\\napproximately the same ratio between operating expenses, including taxes\\nand labor costs but excluding debt service, financing costs, and\\nmanagement fees, and gross rents which prevailed on the average over the\\nimmediate preceding five year period, or for the entire life of the\\nbuilding if less than five years, or\\n  (5) as an alternative to the hardship application provided under\\nparagraph four of this subdivision, owners of buildings acquired by the\\nsame owner or a related entity owned by the same principals three years\\nprior to the date of application may apply to the division for increases\\nin excess of the level of applicable guideline increases established\\nunder this law based on a finding by the commissioner that such\\nguideline increases are not sufficient to enable the owner to maintain\\nan annual gross rent income for such building which exceeds the annual\\noperating expenses of such building by a sum equal to at least five\\npercent of such gross rent. For the purposes of this paragraph,\\noperating expenses shall consist of the actual, reasonable, costs of\\nfuel, labor, utilities, taxes, other than income or corporate franchise\\ntaxes, fees, permits, necessary contracted services and non-capital\\nrepairs, insurance, parts and supplies, management fees and other\\nadministrative costs and mortgage interest. For the purposes of this\\nparagraph, mortgage interest shall be deemed to mean interest on a bona\\nfide mortgage including an allocable portion of charges related thereto.\\nCriteria to be considered in determining a bona fide mortgage other than\\nan institutional mortgage shall include; condition of the property,\\nlocation of the property, the existing mortgage market at the time the\\nmortgage is placed, the term of the mortgage, the amortization rate, the\\nprincipal amount of the mortgage, security and other terms and\\nconditions of the mortgage. The commissioner shall set a rental value\\nfor any unit occupied by the owner or a person related to the owner or\\nunoccupied at the owner's choice for more than one month at the last\\nregulated rent plus the minimum number of guidelines increases or, if no\\nsuch regulated rent existed or is known, the commissioner shall impute a\\nrent consistent with other rents in the building. The amount of hardship\\nincrease shall be such as may be required to maintain the annual gross\\nrent income as provided by this paragraph. The division shall not grant\\na hardship application under this paragraph or paragraph four of this\\nsubdivision for a period of three years subsequent to granting a\\nhardship application under the provisions of this paragraph. The\\ncollection of any increase in the rent for any housing accommodation\\npursuant to this paragraph shall not exceed six percent in any year from\\nthe effective date of the order granting the increase over the rent set\\nforth in the schedule of gross rents, with collectability of any dollar\\nexcess above said sum to be spread forward in similar increments and\\nadded to the rent as established or set in future years. No application\\nshall be approved unless the owner's equity in such building exceeds\\nfive percent of: (i) the arms length purchase price of the property;\\n(ii) the cost of any capital improvements for which the owner has not\\ncollected a surcharge; (iii) any repayment of principal of any mortgage\\nor loan used to finance the purchase of the property or any capital\\nimprovements for which the owner has not collected a surcharge; and (iv)\\nany increase in the equalized assessed value of the property which\\noccurred subsequent to the first valuation of the property after\\npurchase by the owner. For the purposes of this paragraph, owner's\\nequity shall mean the sum of (i) the purchase price of the property less\\nthe principal of any mortgage or loan used to finance the purchase of\\nthe property, (ii) the cost of any capital improvement for which the\\nowner has not collected a surcharge less the principal of any mortgage\\nor loan used to finance said improvement, (iii) any repayment of the\\nprincipal of any mortgage or loan used to finance the purchase of the\\nproperty or any capital improvement for which the owner has not\\ncollected a surcharge, and (iv) any increase in the equalized assessed\\nvalue of the property which occurred subsequent to the first valuation\\nof the property after purchase by the owner.\\n  This subdivision shall apply to accommodations outside a city of one\\nmillion or more.\\n  e. Notwithstanding any contrary provisions of this act, on and after\\nJuly first, nineteen hundred eighty-four the legal regulated rent shall\\nbe the rent registered pursuant to section twelve-a of this act subject\\nto any modification imposed pursuant to this act.\\n  f. Notwithstanding any inconsistent provision of law, rule,\\nregulation, contract, agreement, lease or other obligation, no owner, in\\naddition to the authorized collection of rent, shall demand, receive or\\nretain a security deposit or advance payment which exceeds the rent of\\none month for or in connection with the use or occupancy of a housing\\naccommodation by (i) any tenant who is sixty-five years of age or older\\nfor any lease or lease renewal entered into after July 1, 1996 or (ii)\\nany tenant who is receiving disability retirement benefits or\\nsupplemental security income pursuant to the federal social security act\\nfor any lease or lease renewal entered into after July 1, 2002.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "7",
          "title" : "Maintenance of services",
          "docType" : "SECTION",
          "docLevelId" : "7",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 9,
          "repealedDate" : null,
          "fromSection" : "7",
          "toSection" : "7",
          "text" : "  § 7. Maintenance of services. a. In order to collect a rent adjustment\\nauthorized pursuant to the provisions of subdivision b of section four,\\nthe owner of housing accommodations subject to this act located in a\\ncity having a population of less than one million or a town or village\\nmust file with the state division of housing and community renewal on a\\nform which it shall prescribe, a written certification that he is\\nmaintaining and will continue to maintain all services furnished on the\\ndate upon which this act becomes a law or required to be furnished by\\nany law, ordinance or regulation applicable to the premises. In addition\\nto any other remedy afforded by law, any tenant may apply to the state\\ndivision of housing and community renewal for a reduction in the rent to\\nthe level in effect prior to its most recent adjustment, and the state\\ndivision of housing and community renewal may so reduce the rent if it\\nfinds that the owner has failed to maintain such services. The owner\\nshall be supplied with a copy of the application and shall be permitted\\nto file an answer thereto. A hearing may be held upon the request of\\neither party, or the state division of housing and community renewal may\\nhold a hearing upon its own motion. The state division of housing and\\ncommunity renewal may consolidate the proceedings for two or more\\npetitions applicable to the same building. If the state division of\\nhousing and community renewal finds that the owner has knowingly filed a\\nfalse certification, it shall, in addition to abating the rent, assess\\nthe owner with the reasonable costs of the proceeding, including\\nreasonable attorneys' fees, and impose a penalty not in excess of two\\nhundred fifty dollars for each false certification. The amount of the\\nreduction in rent ordered by the state division of housing and community\\nrenewal under this subdivision shall be reduced by any credit, abatement\\nor offset in rent which the tenant has received pursuant to section two\\nhundred thirty-five-b of the real property law, that relates to one or\\nmore conditions covered by such order.\\n  b. In order to collect a rent adjustment authorized pursuant to the\\nprovisions of subdivision c of section four, the owner of housing\\naccommodations located in a city having a population of more than one\\nmillion shall comply with the requirements with respect to the\\nmaintenance of services of the New York city rent stabilization law of\\nnineteen hundred sixty-nine.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "8",
          "title" : "Administration",
          "docType" : "SECTION",
          "docLevelId" : "8",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 10,
          "repealedDate" : null,
          "fromSection" : "8",
          "toSection" : "8",
          "text" : "  § 8. Administration. a. Whenever a city having a population of less\\nthan one million, or a town or village has determined the existence of\\nan emergency pursuant to section three of this act, the state division\\nof housing and community renewal shall be designated as the sole\\nadministrative agency to administer the regulation of residential rents\\nas provided in this act. The costs incurred by the state division of\\nhousing and community renewal in administering such regulation shall be\\npaid by such city, town or village. Such local resolution shall\\nforthwith be transmitted to the state division of housing and community\\nrenewal and shall be accompanied by an initial payment in an amount\\npreviously determined by the commissioner of housing and community\\nrenewal as necessary to defray the division's anticipated first year\\ncost. Thereafter, annually, after the close of the fiscal year of the\\nstate, the commissioner of housing and community renewal shall determine\\nthe amount of all costs incurred and shall certify to each such city,\\ntown or village its proportionate share of such costs, after first\\ndeducting therefrom the amount of such initial payment. The amount so\\ncertified shall be paid to the commissioner by such city, town or\\nvillage within ninety days after the receipt of such certification. In\\nthe event that the amount thereof is not paid to the commissioner as\\nherein prescribed, the commissioner shall certify the unpaid amount to\\nthe comptroller, and the comptroller shall withhold such amount from the\\nnext succeeding payment of per capita assistance to be apportioned to\\nsuch city, town or village.\\n  b. The legislative body of any city, town or village acting to impose\\nregulation of residential rents pursuant to the provisions of this act\\nmay impose on the owner of every building containing housing\\naccommodations subject to such regulation an annual charge for each such\\naccommodation in such amount as it determines to be necessary for the\\nexpenses to be incurred in the administration of such regulation.\\n  c. Whenever a city having a population of one million or more has\\ndetermined the existence of an emergency pursuant to section three of\\nthis act, the provisions of this act and the New York city rent\\nstabilization law of nineteen hundred sixty-nine shall be administered\\nby the state division of housing and community renewal as provided in\\nthe New York city rent stabilization law of nineteen hundred sixty-nine,\\nas amended, or as otherwise provided by law. The costs incurred by the\\nstate division of housing and community renewal in administering such\\nregulation shall be paid by such city. All payments for such\\nadministration shall be transmitted to the state division of housing and\\ncommunity renewal as follows: on or after April first of each year\\ncommencing with April, nineteen hundred eighty-four, the commissioner of\\nhousing and community renewal shall determine an amount necessary to\\ndefray the division's anticipated annual cost, and one-quarter of such\\namount shall be paid by such city on or before July first of such year,\\none-quarter of such amount on or before October first of such year,\\none-quarter of such amount on or before January first of the following\\nyear and one-quarter of such amount on or before March thirty-first of\\nthe following year. After the close of the fiscal year of the state, the\\ncommissioner shall determine the amount of all actual costs incurred in\\nsuch fiscal year and shall certify such amount to such city. If such\\ncertified amount shall differ from the amount paid by the city for such\\nfiscal year, appropriate adjustments shall be made in the next quarterly\\npayment to be made by such city. In the event that the amount thereof is\\nnot paid to the commissioner as herein prescribed, the commissioner\\nshall certify the unpaid amount to the comptroller, and the comptroller\\nshall, to the extent not otherwise prohibited by law, withhold such\\namount from any state aid payable to such city. In no event shall the\\namount imposed on the owners exceed twenty dollars per unit per year.\\n  d. The failure to pay the prescribed assessment not to exceed twenty\\ndollars per unit for any housing accommodation subject to this act or\\nthe New York city rent stabilization law of nineteen hundred sixty-nine\\nshall constitute a charge due and owing such city, town or village which\\nhas imposed an annual charge for each such housing accommodation\\npursuant to subdivision b of this section. Any such city, town or\\nvillage shall be authorized to provide for the enforcement of the\\ncollection of such charges by commencing an action or proceeding for the\\nrecovery of such fees or by the filing of a lien upon the building and\\nlot. Such methods for the enforcement of the collection of such charges\\nshall be the sole remedy for the enforcement of this section.\\n  e. The division shall maintain at least one office in each county\\nwhich is governed by the rent stabilization law of nineteen hundred\\nsixty-nine or this act; provided, however, that the division shall not\\nbe required to maintain an office in the counties of Nassau, Rockland,\\nor Richmond.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "9",
          "title" : "Application for adjustment of initial legal regulated rent",
          "docType" : "SECTION",
          "docLevelId" : "9",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 11,
          "repealedDate" : null,
          "fromSection" : "9",
          "toSection" : "9",
          "text" : "  § 9. Application for adjustment of initial legal regulated rent. a.\\nThe owner or tenant of a housing accommodation described in paragraph\\none or two of subdivision b of section six may, within sixty days of the\\nlocal effective date of this act or the commencement of the first\\ntenancy thereafter, whichever is later, file with the state division of\\nhousing and community renewal an application for adjustment of the\\ninitial legal regulated rent for such housing accommodation. The state\\ndivision of housing and community renewal may adjust such initial legal\\nregulated rent upon a finding that the presence of unique or peculiar\\ncircumstances materially affecting the initial legal regulated rent has\\nresulted in a rent which is substantially different from the rents\\ngenerally prevailing in the same area for substantially similar housing\\naccommodations.\\n  b. The tenant of a housing accommodation described in paragraph two,\\nsubdivision b, of section six may file with the state division of\\nhousing and community renewal, within ninety days after notice has been\\nreceived pursuant to subdivision c of this section, an application for\\nadjustment of the initial legal regulated rent for such housing\\naccommodation. Such tenant need only allege that such rent is in excess\\nof the fair market rent and shall present such facts which, to the best\\nof his information and belief, support such allegation. The rent\\nguidelines board shall promulgate as soon as practicable after its\\ncreation guidelines for the determination of fair market rents for\\nhousing accommodations as to which an application may be made pursuant\\nto this subdivision. In rendering a determination on an application\\nfiled pursuant to this subdivision b, the state division of housing and\\ncommunity renewal shall be guided by such guidelines. Where the state\\ndivision of housing and community renewal has determined that the rent\\ncharged is in excess of the fair market rent it shall order a refund, of\\nany excess paid since January first, nineteen hundred seventy-four or\\nthe date of the commencement of the tenancy, whichever is later. Such\\nrefund shall be made by the landlord in cash or as a credit against\\nfuture rents over a period not in excess of six months.\\n  c. Upon receipt of any application filed pursuant to this section\\nnine, the state division of housing and community renewal shall notify\\nthe owner or tenant, as the case may be, and provide a copy to him of\\nsuch application. Such owner or tenant shall be afforded a reasonable\\nopportunity to respond to the application. A hearing may be held upon\\nthe request of either party, or the division may hold a hearing on its\\nown motion. The division shall issue a written opinion to both the\\ntenant and the owner upon rendering its determination.\\n  d. Within thirty days after the local effective date of this act the\\nowner of housing accommodations described in paragraph two of\\nsubdivision b of section six, as to which an emergency has been declared\\npursuant to this act, shall give notice in writing by certified mail to\\nthe tenant of each such housing accommodation on a form prescribed by\\nthe state division of housing and community renewal of the initial legal\\nregulated rent for such housing accommodation and of such tenant's right\\nto file an application for adjustment of the initial legal regulated\\nrent of such housing accommodation.\\n  e. The initial legal regulated rents for housing accommodations in a\\ncity having a population of one million or more shall be subject to\\nadjustment in accordance with the provisions of the New York city rent\\nstabilization law as amended.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "10",
          "title" : "Regulations",
          "docType" : "SECTION",
          "docLevelId" : "10",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 12,
          "repealedDate" : null,
          "fromSection" : "10",
          "toSection" : "10",
          "text" : "  § 10. Regulations. a. For cities having a population of less than one\\nmillion and towns and villages, the state division of housing and\\ncommunity renewal shall be empowered to implement this act by\\nappropriate regulations. Such regulations may encompass such speculative\\nor manipulative practices or renting or leasing practices as the state\\ndivision of housing and community renewal determines constitute or are\\nlikely to cause circumvention of this act. Such regulations shall\\nprohibit practices which are likely to prevent any person from asserting\\nany right or remedy granted by this act, including but not limited to\\nretaliatory termination of periodic tenancies and shall require owners\\nto grant a new one or two year vacancy or renewal lease at the option of\\nthe tenant, except where a mortgage or mortgage commitment existing as\\nof the local effective date of this act provides that the owner shall\\nnot grant a one-year lease; and shall prescribe standards with respect\\nto the terms and conditions of new and renewal leases, additional rent\\nand such related matters as security deposits, advance rental payments,\\nthe use of escalator clauses in leases and provision for increase in\\nrentals for garages and other ancillary facilities, so as to ensure that\\nthe level of rent adjustments authorized under this law will not be\\nsubverted and made ineffective. Any provision of the regulations\\npermitting an owner to refuse to renew a lease on grounds that the owner\\nseeks to recover possession of a housing accommodation for his or her\\nown use and occupancy or for the use and occupancy of his or her\\nimmediate family shall permit recovery of only one housing\\naccommodation, shall require that an owner demonstrate immediate and\\ncompelling need and that the housing accommodation will be the proposed\\noccupants' primary residence and shall not apply where a member of the\\nhousing accommodation is sixty-two years of age or older, has been a\\ntenant in a housing accommodation in that building for fifteen years or\\nmore, or has an impairment which results from anatomical, physiological\\nor psychological conditions, other than addiction to alcohol, gambling,\\nor any controlled substance, which are demonstrable by medically\\nacceptable clinical and laboratory diagnostic techniques, and which are\\nexpected to be permanent and which prevent the tenant from engaging in\\nany substantial gainful employment; provided, however, that a tenant\\nrequired to surrender a housing accommodation under this subdivision\\nshall have a cause of action in any court of competent jurisdiction for\\ndamages, declaratory, and injunctive relief against a landlord or\\npurchaser of the premises who makes a fraudulent statement regarding a\\nproposed use of the housing accommodation. In any action or proceeding\\nbrought pursuant to this subdivision a prevailing tenant shall be\\nentitled to recovery of actual damages, and reasonable attorneys' fees.\\n  (a-2) Where the amount of rent charged to and paid by the tenant is\\nless than the legal regulated rent for the housing accommodation, the\\namount of rent for such housing accommodation which may be charged upon\\nvacancy thereof, may, at the option of the owner, be based upon such\\npreviously established legal regulated rent, as adjusted by the most\\nrecent applicable guidelines increases and other increases authorized by\\nlaw.  For any tenant who is subject to a lease on or after the effective\\ndate of a chapter of the laws of two thousand nineteen which amended\\nthis subdivision, or is or was entitled to receive a renewal or vacancy\\nlease on or after such date, upon renewal of such lease, the amount of\\nrent for such housing accommodation that may be charged and paid shall\\nbe no more than the rent charged to and paid by the tenant prior to that\\nrenewal, as adjusted by the most recent applicable guidelines increases\\nand any other increases authorized by law. Provided, however, that for\\nbuildings that are subject to this statute by virtue of a regulatory\\nagreement with a local government agency and which buildings receive\\nfederal project based rental assistance administered by the United\\nStates department of housing and urban development or a state or local\\nsection eight administering agency, where the rent set by the federal,\\nstate or local governmental agency is less than the legal regulated rent\\nfor the housing accommodation, the amount of rent for such housing\\naccommodation which may be charged with the approval of such federal,\\nstate or local governmental agency upon renewal or upon vacancy thereof,\\nmay be based upon such previously established legal regulated rent, as\\nadjusted by the most recent applicable guidelines increases or other\\nincreases authorized by law; and further provided that such vacancy\\nshall not be caused by the failure of the owner or an agent of the\\nowner, to maintain the housing accommodation in compliance with the\\nwarranty of habitability set forth in subdivision one of section two\\nhundred thirty-five-b of the real property law.\\n  b. For cities having a population of one million or more, this act may\\nbe implemented by regulations adopted pursuant to the New York city rent\\nstabilization law of nineteen hundred sixty-nine, as amended, or as\\notherwise provided by law.\\n  c. Each owner of premises subject to this act shall furnish to each\\ntenant signing a new or renewal lease, a copy of the fully executed new\\nor renewal lease bearing the signatures of owner and tenant and the\\nbeginning and ending dates of the lease term, within thirty days from\\nthe owner's receipt of the new or renewal lease signed by the tenant.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "10-A",
          "title" : "Right to sublease",
          "docType" : "SECTION",
          "docLevelId" : "10-A",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 13,
          "repealedDate" : null,
          "fromSection" : "10-A",
          "toSection" : "10-A",
          "text" : "  § 10-a. Right to sublease. Units subject to this law may be sublet\\npursuant to section two hundred twenty-six-b of the real property law\\nprovided that (a) the rental charged to the subtenant does not exceed\\nthe legal regulated rent plus a ten percent surcharge payable to the\\ntenant if the unit sublet was furnished with the tenant's furniture; (b)\\nthe tenant can establish that at all times he has maintained the unit as\\nhis primary residence and intends to occupy it as such at the expiration\\nof the sublease; (c) an owner may terminate the tenancy of a tenant who\\nsublets or assigns contrary to the terms of this section but no action\\nor proceeding based on the non-primary residence of a tenant may be\\ncommenced prior to the expiration date of his lease; (d) where an\\napartment is sublet the prime tenant shall retain the right to a renewal\\nlease and the rights and status of a tenant in occupancy as they relate\\nto conversion to condominium or cooperative ownership; (e) where a\\ntenant violates the provisions of subdivision (a) of this section the\\nsubtenant shall be entitled to damages of three times the overcharge and\\nmay also be awarded attorneys fees and interest from the date of the\\novercharge at the rate of interest payable on a judgment pursuant to\\nsection five thousand four of the civil practice law and rules; (f) the\\ntenant may not sublet the unit for more than a total of two years,\\nincluding the term of the proposed sublease, out of the four-year period\\npreceding the termination date of the proposed sublease. The provisions\\nof this subdivision (f) shall only apply to subleases commencing on and\\nafter July first, nineteen hundred eighty-three; (g) for the purposes of\\nthis section only, the term of the proposed sublease may extend beyond\\nthe term of the tenant's lease. In such event, such sublease shall be\\nsubject to the tenant's right to a renewal lease. The subtenant shall\\nhave no right to a renewal lease. It shall be unreasonable for an owner\\nto refuse to consent to a sublease solely because such sublease extends\\nbeyond the tenant's lease; and (h) notwithstanding the provisions of\\nsection two hundred twenty-six-b of the real property law, a\\nnot-for-profit hospital shall have the right to sublet any housing\\naccommodation leased by it to its affiliated personnel without requiring\\nthe landlord's consent to any such sublease and without being bound by\\nthe provisions of subdivisions (b), (c) and (f) of this section.\\nCommencing with the effective date of this subdivision, whenever a\\nnot-for-profit hospital executes a renewal lease for a housing\\naccommodation, the legal regulated rent shall be increased by a sum\\nequal to fifteen percent of the previous lease rental for such housing\\naccommodation, hereinafter referred to as a vacancy surcharge, unless\\nthe landlord shall have received within the seven year period prior to\\nthe commencement date of such renewal lease any vacancy increases or\\nvacancy surcharges allocable to the said housing accommodation. In the\\nevent the landlord shall have received any such vacancy increases or\\nvacancy surcharges during such seven year period, the vacancy surcharge\\nshall be reduced by the amount received by any such vacancy increase or\\nvacancy surcharges.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "10-B",
          "title" : "Major capital improvements and individual apartment improvements in rent regulated units",
          "docType" : "SECTION",
          "docLevelId" : "10-B",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 14,
          "repealedDate" : null,
          "fromSection" : "10-B",
          "toSection" : "10-B",
          "text" : "  § 10-b. Major capital improvements and individual apartment\\nimprovements in rent regulated units. (a) Notwithstanding any other\\nprovision of law to the contrary, the division of housing and community\\nrenewal, the \"division\", shall promulgate rules and regulations\\napplicable to all rent regulated units that shall:\\n  1. establish a schedule of reasonable costs for major capital\\nimprovements, which shall set a ceiling for what can be recovered\\nthrough a temporary major capital improvement increase, based on the\\ntype of improvement and its rate of depreciation;\\n  2. establish the criteria for eligibility of a temporary major capital\\nimprovement increase including the type of improvement, which shall be\\nessential for the preservation, energy efficiency, functionality or\\ninfrastructure of the entire building, including heating, windows,\\nplumbing and roofing, but shall not be for operational costs or\\nunnecessary cosmetic improvements. Allowable improvements must\\nadditionally be depreciable pursuant to the Internal Revenue Service,\\nother than for ordinary repairs, that directly or indirectly benefit all\\ntenants; and no increase shall be approved for group work done in\\nindividual apartments that is otherwise not an improvement to an entire\\nbuilding. Only such costs that are actual, reasonable, and verifiable\\nmay be approved as a temporary major capital improvement increase;\\n  3. require that any temporary major capital improvement increase\\ngranted pursuant to these provisions be reduced by an amount equal to\\n(i) any governmental grant received by the landlord, where such grant\\ncompensates the landlord for any improvements required by a city, state\\nor federal government, an agency or any granting governmental entity to\\nbe expended for improvements and (ii) any insurance payment received by\\nthe landlord where such insurance payment compensates the landlord for\\nany part of the costs of the improvements;\\n  4. prohibit temporary major capital improvement increases for\\nbuildings with outstanding hazardous or immediately hazardous violations\\nof the Uniform Fire Prevention and Building Code (Uniform Code), New\\nYork City Fire Code, or New York City Building and Housing Maintenance\\nCodes, if applicable;\\n  5. prohibit individual apartment improvement increases for housing\\naccommodations with outstanding hazardous or immediately hazardous\\nviolations of the Uniform Fire Prevention and Building Code (Uniform\\nCode), New York City Fire Code, or New York City Building and Housing\\nMaintenance Codes, if applicable;\\n  6. prohibit temporary major capital improvement increases for\\nbuildings with thirty-five per centum or fewer rent-regulated units;\\n  7. establish that temporary major capital improvement increases shall\\nbe fixed to the unit and shall cease thirty years from the date the\\nincrease became effective. Temporary major capital improvement increases\\nshall be added to the legal regulated rent as a temporary increase and\\nshall be removed from the legal regulated rent thirty years from the\\ndate the increase became effective inclusive of any increases granted by\\nthe local rent guidelines board;\\n  8. establish that temporary major capital improvement increases shall\\nbe collectible prospectively on the first day of the first month\\nbeginning sixty days from the date of mailing notice of approval to the\\ntenant.  Such notice shall disclose the total monthly increase in rent\\nand the first month in which the tenant would be required to pay the\\ntemporary increase. An approval for a temporary major capital\\nimprovement increase shall not include retroactive payments. The\\ncollection of any increase shall not exceed two percent in any year from\\nthe effective date of the order granting the increase over the rent set\\nforth in the schedule of gross rents, with collectability of any dollar\\nexcess above said sum to be spread forward in similar increments and\\nadded to the rent as established or set in future years. Upon vacancy,\\nthe landlord may add any remaining balance of the temporary major\\ncapital improvement increase to the legal regulated rent.\\nNotwithstanding any other provision of the law, for any renewal lease\\ncommencing on or after June 14, 2019, the collection of any rent\\nincreases due to any major capital improvements approved on or after\\nJune 16, 2012 and before June 16, 2019 shall not exceed two percent in\\nany year for any tenant in occupancy on the date the major capital\\nimprovement was approved;\\n  9. ensure that the application procedure for temporary major capital\\nimprovement increases shall include an itemized list of work performed\\nand a description or explanation of the reason or purpose of such work;\\n  10. provide, that where an application for a major capital improvement\\nrent increase has been filed, a tenant shall have sixty days from the\\ndate of mailing of a notice of a proceeding in which to answer or reply;\\n  11. establish a notification and documentation procedure for\\nindividual apartment improvements that requires an itemized list of work\\nperformed and a description or explanation of the reason or purpose of\\nsuch work, inclusive of photographic evidence documenting the condition\\nprior to and after the completion of the performed work. Provide for the\\ncentralized electronic retention of such documentation and any other\\nsupporting documentation to be made available in cases pertaining to the\\nadjustment of legal regulated rents; and\\n  12. establish a form in the top six languages other than English\\nspoken in the state according to the latest available data from the U.S.\\nBureau of Census for a temporary individual apartment improvement rent\\nincrease for a tenant in occupancy which shall be used by landlords to\\nobtain written informed consent that shall include the estimated total\\ncost of the improvement and the estimated monthly rent increase. Such\\nform shall be completed and preserved in the centralized electronic\\nretention system to be operational by June 14, 2020. Nothing herein\\nshall relieve a landlord, lessor, or agent thereof of his or her duty to\\nretain proper documentation of all improvements performed or any rent\\nincreases resulting from said improvements.\\n  (b) The division shall establish an annual inspection and audit\\nprocess which shall review twenty-five percent of applications for a\\ntemporary major capital improvement increase that have been submitted\\nand approved. Such process shall include individual inspections and\\ndocument review to ensure that owners complied with all obligations and\\nresponsibilities under the law for temporary major capital improvement\\nincreases. Inspections shall include in-person confirmation that such\\nimprovements have been completed in such way as described in the\\napplication.\\n  (c) The division shall issue a notice to the landlord and all the\\ntenants sixty days prior to the end of the temporary major capital\\nimprovement increase and shall include the initial approved increase and\\nthe total amount to be removed from the legal regulated rent inclusive\\nof any increases granted by the applicable rent guidelines board.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "11",
          "title" : "Non-waiver of rights",
          "docType" : "SECTION",
          "docLevelId" : "11",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 15,
          "repealedDate" : null,
          "fromSection" : "11",
          "toSection" : "11",
          "text" : "  § 11. Non-waiver of rights. Any provision of a lease or other rental\\nagreement which purports to waive a tenant's rights under this act or\\nregulations promulgated pursuant thereto shall be void as contrary to\\npublic policy.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "12",
          "title" : "Enforcement and procedures",
          "docType" : "SECTION",
          "docLevelId" : "12",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 16,
          "repealedDate" : null,
          "fromSection" : "12",
          "toSection" : "12",
          "text" : "  § 12. Enforcement and procedures. a. (1) Subject to the conditions and\\nlimitations of this paragraph, any owner of housing accommodations in a\\ncity having a population of less than one million or a town or village\\nas to which an emergency has been declared pursuant to section three,\\nwho, upon complaint of a tenant or of the state division of housing and\\ncommunity renewal, is found by the state division of housing and\\ncommunity renewal, after a reasonable opportunity to be heard, to have\\ncollected an overcharge above the rent authorized for a housing\\naccommodation subject to this act shall be liable to the tenant for a\\npenalty equal to three times the amount of such overcharge. If the owner\\nestablishes by a preponderance of the evidence that the overcharge was\\nneither willful nor attributable to his negligence, the state division\\nof housing and community renewal shall establish the penalty as the\\namount of the overcharge plus interest at the rate of interest payable\\non a judgment pursuant to section five thousand four of the civil\\npractice law and rules. After a complaint of rent overcharge has been\\nfiled and served on an owner, the voluntary adjustment of the rent\\nand/or the voluntary tender of a refund of rent overcharges shall not be\\nconsidered by the division of housing and community renewal or a court\\nof competent jurisdiction as evidence that the overcharge was not\\nwillful. (i) Except as to complaints filed pursuant to clause (ii) of\\nthis paragraph, the legal regulated rent for purposes of determining an\\novercharge, shall be deemed to be the rent indicated in the most recent\\nreliable annual registration statement for a rent stabilized tenant\\nfiled and served upon the tenant six or more years prior to the most\\nrecent registration statement, (or, if more recently filed, the initial\\nregistration statement) plus in each case any subsequent lawful\\nincreases and adjustments. The division of housing and community renewal\\nor a court of competent jurisdiction, in investigating complaints of\\novercharge and in determining legal regulated rent, shall consider all\\navailable rent history which is reasonably necessary to make such\\ndeterminations. (ii) As to complaints filed within ninety days of the\\ninitial registration of a housing accommodation, the legal regulated\\nrent for purposes of determining an overcharge shall be deemed to be the\\nrent charged on the date six years prior to the date of the initial\\nregistration of the housing accommodation (or, if the housing\\naccommodation was subject to this act for less than six years, the\\ninitial legal regulated rent) plus in each case, any lawful increases\\nand adjustments. Where the rent charged on the date six years prior to\\nthe date of the initial registration of the accommodation cannot be\\nestablished, such rent shall be established by the division.\\n  (a) The order of the state division of housing and community renewal\\nshall apportion the owner's liability between or among two or more\\ntenants found to have been overcharged by such owner during their\\nparticular tenancy of a unit.\\n  (b) (i) Except as provided under clauses (ii) and (iii) of this\\nsubparagraph, a complaint under this subdivision may be filed with the\\nstate division of housing and community renewal or in a court of\\ncompetent jurisdiction at any time, however any recovery of overcharge\\npenalties shall be limited to the six years preceding the complaint.\\n  (ii) A penalty of three times the overcharge shall be assessed upon\\nall overcharges willfully collected by the owner starting six years\\nbefore the complaint is filed.\\n  (iii) Any complaint based upon overcharges occurring prior to the date\\nof filing of the initial rent registration as provided in subdivision b\\nof section twelve-a of this act shall be filed within ninety days of the\\nmailing of notice to the tenant of such registration.\\n  (c) Any affected tenant shall be notified of and given an opportunity\\nto join in any complaint filed by an officer or employee of the state\\ndivision of housing and community renewal.\\n  (d) An owner found to have overcharged shall, in all cases, be\\nassessed the reasonable costs and attorney's fees of the proceeding, and\\ninterest from the date of the overcharge at the rate of interest payable\\non a judgment pursuant to section five thousand four of the civil\\npractice law and rules.\\n  (e) The order of the state division of housing and community renewal\\nawarding penalties may, upon the expiration of the period in which the\\nowner may institute a proceeding pursuant to article seventy-eight of\\nthe civil practice law and rules, be filed and enforced by a tenant in\\nthe same manner as a judgment or, in the alternative, not in excess of\\ntwenty percent thereof per month may be offset against any rent\\nthereafter due the owner.\\n  (f) Unless a tenant shall have filed a complaint of overcharge with\\nthe division which complaint has not been withdrawn, nothing contained\\nin this section shall be deemed to prevent a tenant or tenants, claiming\\nto have been overcharged, from commencing an action or interposing a\\ncounterclaim in a court of competent jurisdiction for damages equal to\\nthe overcharge and the penalty provided for in this section, including\\ninterest from the date of the overcharge at the rate of interest payable\\non a judgment pursuant to section five thousand four of the civil\\npractice law and rules, plus the statutory costs and allowable\\ndisbursements in connection with the proceeding. The courts and the\\ndivision shall have concurrent jurisdiction, subject to the tenant's\\nchoice of forum.\\n  (2) In addition to issuing the specific orders provided for by other\\nprovisions of this act, the state division of housing and community\\nrenewal shall be empowered to enforce this act and its regulations by\\nissuing, upon notice and a reasonable opportunity for the affected party\\nto be heard, such other orders as it may deem appropriate.\\n  (3) If the owner is found by the commissioner:\\n  (i) to have violated an order of the division the commissioner may\\nimpose by administrative order after hearing, a civil penalty at minimum\\nin the amount of one thousand but not to exceed two thousand dollars for\\nthe first such offense, and at minimum in the amount of two thousand but\\nnot to exceed three thousand dollars for each subsequent offense; or\\n  (ii) to have harassed a tenant to obtain vacancy of his housing\\naccommodation, the commissioner may impose by administrative order after\\nhearing, a civil penalty for any such violation. Such penalty shall be\\nat minimum in the amount of two thousand but not to exceed three\\nthousand dollars for the first such offense, and at minimum in the\\namount of ten thousand but not to exceed eleven thousand dollars for\\neach subsequent offense or for a violation consisting of conduct\\ndirected at the tenants of more than one housing accommodation.\\n  Such order shall be deemed a final determination for the purposes of\\njudicial review. Such penalty may, upon the expiration of the period for\\nseeking review pursuant to article seventy-eight of the civil practice\\nlaw and rules, be docketed and enforced in the manner of a judgment of\\nthe supreme court.\\n  (4) Any proceeding pursuant to article seventy-eight of the civil\\npractice law and rules seeking review of any action pursuant to this act\\nshall be brought within sixty days of the expiration of the ninety day\\nperiod and any extension thereof provided in subdivision c of this\\nsection or the rendering of a determination, whichever is later. Any\\naction or proceeding brought by or against the commissioner under this\\nact shall be brought in the county in which the housing accommodation is\\nlocated.\\n  (5) Violations of this act or of the regulations and orders issued\\npursuant thereto may be enjoined by the supreme court upon proceedings\\ncommenced by the state division of housing and community renewal or the\\ntenant or tenants who allege they have been overcharged. The division\\nshall not be required to post bond.\\n  (6) In furtherance of its responsibility to enforce this act, the\\nstate division of housing and community renewal shall be empowered to\\nadminister oaths, issue subpoenas, conduct investigations, make\\ninspections and designate officers to hear and report. The division\\nshall safeguard the confidentiality of information furnished to it at\\nthe request of the person furnishing same, unless such information must\\nbe made public in the interest of establishing a record for the future\\nguidance of persons subject to this act.\\n  (7) In any action or proceeding before a court wherein a party relies\\nfor a ground of relief or defense or raises issue or brings into\\nquestion the construction or validity of this act or any regulation,\\norder or requirement hereunder, the court having jurisdiction of such\\naction or proceeding may at any stage certify such fact to the state\\ndivision of housing and community renewal. The state division of housing\\nand community renewal may intervene in any such action or proceeding.\\n  (8) Except where a specific provision of this law requires the\\nmaintenance of rent records for a longer period, including records of\\nthe useful life of improvements made to any housing accommodation or any\\nbuilding, any owner who has duly registered a housing accommodation\\npursuant to section twelve-a of this act shall not be required to\\nmaintain or produce any records relating to rentals of such\\naccommodation more than six years prior to the most recent registration\\nor annual statement for such accommodation. However, an owner's election\\nnot to maintain records shall not limit the authority of the division of\\nhousing and community renewal and the courts to examine the rental\\nhistory and determine legal regulated rents pursuant to this\\nsubdivision.\\n  (9) The division of housing and community renewal and the courts, in\\ninvestigating complaints of overcharge and in determining legal\\nregulated rents, shall consider all available rent history which is\\nreasonably necessary to make such determinations, including but not\\nlimited to (a) any rent registration or other records filed with the\\nstate division of housing and community renewal, or any other state,\\nmunicipal or federal agency, regardless of the date to which the\\ninformation on such registration refers; (b) any order issued by any\\nstate, municipal or federal agency; (c) any records maintained by the\\nowner or tenants; and (d) any public record kept in the regular course\\nof business by any state, municipal or federal agency. Nothing contained\\nin this paragraph shall limit the examination of rent history relevant\\nto a determination as to:\\n  (i) whether the legality of a rental amount charged or registered is\\nreliable in light of all available evidence including, but not limited\\nto, whether an unexplained increase in the registered or lease rents, or\\na fraudulent scheme to destabilize the housing accommodation, rendered\\nsuch rent or registration unreliable;\\n  (ii) whether an accommodation is subject to the emergency tenant\\nprotection act;\\n  (iii) whether an order issued by the division of housing and community\\nrenewal or a court of competent jurisdiction, including, but not limited\\nto an order issued pursuant to section seven of this act, or any\\nregulatory agreement or other contract with any governmental agency, and\\nremaining in effect within six years of the filing of a complaint\\npursuant to this section, affects or limits the amount of rent that may\\nbe charged or collected;\\n  (iv) whether an overcharge was or was not willful;\\n  (v) whether a rent adjustment that requires information regarding the\\nlength of occupancy by a present or prior tenant was lawful;\\n  (vi) the existence or terms and conditions of a preferential rent, or\\nthe propriety of a legal registered rent during a period when the\\ntenants were charged a preferential rent;\\n  (vii) the legality of a rent charged or registered immediately prior\\nto the registration of a preferential rent; or\\n  (viii) the amount of the legal regulated rent where the apartment was\\nvacant or temporarily exempt on the date six years prior to a tenant's\\ncomplaint.\\n  b. Within a city having a population of one million or more, the state\\ndivision of housing and community renewal shall have such powers to\\nenforce this act as shall be provided in the New York city rent\\nstabilization law of nineteen hundred sixty-nine, as amended, or as\\nshall otherwise be provided by law. Unless a tenant shall have filed a\\ncomplaint of overcharge with the division which complaint has not been\\nwithdrawn, nothing contained in this section shall be deemed to prevent\\na tenant or tenants, claiming to have been overcharged, from commencing\\nan action or interposing a counterclaim in a court of competent\\njurisdiction for damages equal to the overcharge and the penalty\\nprovided for in this section, including interest from the date of the\\novercharge at the rate of interest payable on a judgment pursuant to\\nsection five thousand four of the civil practice law and rules, plus the\\nstatutory costs and allowable disbursements in connection with the\\nproceeding. The courts and the division shall have concurrent\\njurisdiction, subject to the tenant's choice of forum.\\n  c. The state division of housing and community renewal may, by\\nregulation, provide for administrative review of all orders and\\ndeterminations issued by it pursuant to this act. Any such regulation\\nshall provide that if a petition for such review is not determined\\nwithin ninety days after it is filed, it shall be deemed to be denied.\\nHowever, the division may grant one extension not to exceed thirty days\\nwith the consent of the party filing such petition; any further\\nextension may only be granted with the consent of all parties to the\\npetition. No proceeding may be brought pursuant to article seventy-eight\\nof the civil practice law and rules to challange any order or\\ndetermination which is subject to such administrative review unless such\\nreview has been sought and either (1) a determination thereon has been\\nmade or (2) the ninety-day period provided for determination of the\\npetition for review (or any extension thereof) has expired.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "12-A",
          "title" : "Rent registration",
          "docType" : "SECTION",
          "docLevelId" : "12-A",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 17,
          "repealedDate" : null,
          "fromSection" : "12-A",
          "toSection" : "12-A",
          "text" : "  § 12-a. Rent registration. a. Each housing accommodation in a city\\nhaving a population of less than one million or a town or village as to\\nwhich an emergency has been declared pursuant to section three of this\\nact which is subject to this act shall be registered by the owner\\nthereof with the state division of housing and community renewal prior\\nto July first, nineteen hundred eighty-four upon forms prescribed by the\\ncommissioner of such division. The data to be provided on such forms\\nshall include the following: (1) the name and address of the building or\\ngroup of buildings or development in which such housing accommodation is\\nlocated and the owner and the tenant thereof; (2) the number of housing\\naccommodations in the building or group of buildings or development in\\nwhich such housing accommodation is located; (3) the number of housing\\naccommodations in such building or group of buildings or development\\nsubject to this act and the number of such housing accommodations\\nsubject to the emergency housing rent control law; (4) the rent charged\\non the registration date; (5) the number of rooms in such housing\\naccommodation; and (6) all services provided in the last lease or rental\\nagreement commencing at least six months prior to the local effective\\ndate of this act.\\n  b. Registration pursuant to this section shall not be subject to the\\nfreedom of information law, provided that registration information\\nrelative to a tenant, owner, lessor or subtenant shall be made available\\nto such party or his authorized representative.\\n  c. Housing accommodations which become subject to this act after the\\ninitial registration period must be registered within ninety days\\nthereafter. Registration of housing accommodations subject to the\\nemergency housing rent control law immediately prior to the date of\\nfiling the initial registration statement as provided in this section\\nshall include, in addition to the items listed above, where existing,\\nthe maximum rent immediately prior to the date that such housing\\naccommodations became subject to this act.\\n  d. Copies of the registration shall be filed with the state division\\nof housing and community renewal in such place or places as it may\\nrequire.  In addition, one copy of that portion of the registration\\nstatement which pertains to the tenant's unit must be mailed by the\\nowner to the tenant in possession at the time of initial registration or\\nto the first tenant in occupancy if the apartment is vacant at the time\\nof initial registration.\\n  e. The failure to file a proper and timely initial or annual rent\\nregistration statement shall, until such time as such registration is\\nfiled, bar an owner from applying for or collecting any rent in excess\\nof the legal regulated rent in effect on the date of the last preceding\\nregistration statement or if no such statements have been filed, the\\nlegal regulated rent in effect on the date that the housing\\naccommodation became subject to the registration requirements of this\\nsection. The filing of a late registration shall result in the\\nprospective elimination of such sanctions and provided that increases in\\nthe legal regulated rent were lawful except for the failure to file a\\ntimely registration, the owner, upon the service and filing of a late\\nregistration, shall not be found to have collected an overcharge at any\\ntime prior to the filing of the late registration. If such late\\nregistration is filed subsequent to the filing of an overcharge\\ncomplaint, the owner shall be assessed a late filing surcharge for each\\nlate registration in an amount equal to fifty percent of the timely rent\\nregistration fee.\\n  f. An annual statement shall be filed containing the current rent for\\neach unit and such other information contained in subdivision a of this\\nsection as shall be required by the division. The owner shall provide\\neach tenant then in occupancy with a copy of that portion of such annual\\nstatement as pertains to the tenant's unit.\\n  g. Within a city having a population of one million or more, each\\nhousing accommodation subject to this act shall be registered with the\\nstate division of housing and community renewal as shall be provided in\\nthe New York city rent stabilization law of nineteen hundred sixty-nine.\\n  h. Each housing accommodation for which a timely registration\\nstatement was filed between April first, nineteen hundred eighty-four\\nand June thirtieth, nineteen hundred eighty-four, pursuant to\\nsubdivision a of this section shall designate the rent charged on April\\nfirst, nineteen hundred eighty-four, as the rent charged on the\\nregistration date.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "13",
          "title" : "Cooperation with other governmental agencies",
          "docType" : "SECTION",
          "docLevelId" : "13",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 18,
          "repealedDate" : null,
          "fromSection" : "13",
          "toSection" : "13",
          "text" : "  § 13. Cooperation with other governmental agencies. The state division\\nof housing and community renewal and any rent guidelines board may\\nrequest and shall receive cooperation and assistance in effectuating the\\npurposes of this act from all departments, divisions, boards, bureaus,\\ncommissions or agencies of the state and political subdivisions thereof.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "ETP",
          "lawName" : "Emergency Tenant Protection Act 576/74",
          "locationId" : "14",
          "title" : "Application of act",
          "docType" : "SECTION",
          "docLevelId" : "14",
          "activeDate" : "2019-06-28",
          "sequenceNo" : 19,
          "repealedDate" : null,
          "fromSection" : "14",
          "toSection" : "14",
          "text" : "  § 14. Application of act. The provisions of this act shall be\\napplicable:\\n  a. in the city of New York; and\\n  b. in all counties within the state of New York outside the city of\\nNew York and shall become and remain effective only in a city, town or\\nvillage located therein as provided in section three of this act.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        } ],
        "size" : 18
      },
      "repealed" : false
    }
  }
}