{
  "success" : true,
  "message" : "The document structure for MHR law",
  "responseType" : "law-tree",
  "result" : {
    "lawVersion" : {
      "lawId" : "MHR",
      "activeDate" : "2019-01-11"
    },
    "info" : {
      "lawId" : "MHR",
      "name" : "Municipal Home Rule",
      "lawType" : "CONSOLIDATED",
      "chapter" : "36-A"
    },
    "publishedDates" : [ "2014-09-22", "2015-11-06", "2018-08-31", "2019-01-11" ],
    "documents" : {
      "lawId" : "MHR",
      "lawName" : "Municipal Home Rule",
      "locationId" : "-CH36-A",
      "title" : "Municipal Home Rule",
      "docType" : "CHAPTER",
      "docLevelId" : "36-A",
      "activeDate" : "2014-09-22",
      "sequenceNo" : 1,
      "repealedDate" : null,
      "fromSection" : "1",
      "toSection" : "59",
      "text" : "                               CHAPTER 843\\nAN ACT to provide a municipal home rule law, constituting chapter\\n  thirty-six-a of the consolidated laws\\n  Became a law April 30, 1963, with the approval of the Governor.\\nPassed, on message of necessity, pursuant to article III, section 14 of\\nthe Constitution, by a majority vote, three-fifths being present\\n  The People of the State of New York, represented in Senate and\\nAssembly, do enact as follows:\\n                         MUNICIPAL HOME RULE LAW\\nArticle 1. Short title; definitions. (§ § 1-2)\\n        2. General  powers of local governments to adopt and amend local\\n             laws; restrictions. (§ § 10-11)\\n        3. Procedure for adoption of local laws; referenda;  filing  and\\n             publication. (§ § 20-28)\\n        4. Powers of counties and cities to adopt charters. (§ § 30-38)\\n        5. Requests  of  local governments for enactment of special laws\\n             relating to their property, affairs or government. (§ 40)\\n        6. Legislative intent; construction; effective date. (§ § 50-59)\\n",
      "documents" : {
        "items" : [ {
          "lawId" : "MHR",
          "lawName" : "Municipal Home Rule",
          "locationId" : "A1",
          "title" : "Short Title; Definitions",
          "docType" : "ARTICLE",
          "docLevelId" : "1",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 2,
          "repealedDate" : null,
          "fromSection" : "1",
          "toSection" : "2",
          "text" : "                                ARTICLE 1\\n                         SHORT TITLE; DEFINITIONS\\nSection 1. Short title.\\n        2. Definitions.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "1",
              "title" : "Short title",
              "docType" : "SECTION",
              "docLevelId" : "1",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 3,
              "repealedDate" : null,
              "fromSection" : "1",
              "toSection" : "1",
              "text" : "  § 1. Short title. This chapter shall be known, cited and referred to\\nas the \"municipal home rule law.\"\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "2",
              "title" : "Definitions",
              "docType" : "SECTION",
              "docLevelId" : "2",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 4,
              "repealedDate" : null,
              "fromSection" : "2",
              "toSection" : "2",
              "text" : "  § 2. Definitions. As used in this chapter the following terms shall\\nmean or include:\\n  1. \"Charter.\" A state statute or a local law which establishes or\\ncontinues a specific county, city or village as a municipal corporation\\nor body politic and includes the fundamental provisions defining,\\nextending or limiting its corporate powers or affecting the framework of\\nits government.\\n  2. \"Charter amendment.\" A new charter or any change in an existing\\ncharter presented as such under authority of this chapter or any state\\nstatute or charter. A charter amendment may be of any extent and may\\ndeal with any number of subjects.\\n  3. \"Clerk.\" The clerk of the board of supervisors of a county, the\\nclerk of a city, town or village or, if there be no officer so\\ndesignated, an officer exercising corresponding duties.\\n  4. \"Elective chief executive officer.\" The chief executive officer of\\na county elected on a county-wide basis or if there be none the chairman\\nof the board of supervisors, the mayor of a city or village or the\\nsupervisor of a town, where such officer is vested with power to approve\\nor veto local laws or ordinances.\\n  5. \"General law.\" A state statute which in terms and in effect applies\\nalike to all counties, all counties other than those wholly included\\nwithin a city, all cities, all towns or all villages.\\n  6. \"Law.\" A state statute, charter or local law.\\n  7. \"Legislative body.\" The board of supervisors, board of aldermen,\\ncommon council, council, commission, town board, board of trustees or\\nother elective governing board or body now or hereafter vested by state\\nstatute, charter or other law with jurisdiction to initiate and adopt\\nlocal laws or ordinances, whether or not such local laws or ordinances\\nrequire the approval of the elective chief executive officer or other\\nofficial or body to become effective.\\n  8. \"Local government.\" A county, city, town or village.\\n  9. \"Local law.\" A law (a) adopted pursuant to this chapter or to other\\nauthorization of a state statute or charter by the legislative body of a\\nlocal government, or (b) proposed by a charter commission or by\\npetition, and ratified by popular vote, as provided in article four of\\nthis chapter or as provided in a state statute, charter or local law;\\nbut shall not mean or include an ordinance, resolution or other similar\\nact of the legislative body or of any other board or body.\\n  10. \"New charter.\" A charter which supersedes or repeals an existing\\ncharter in its entirety or in the manner provided in subdivision four or\\nsubdivision five of section thirty-six of this chapter.\\n  11. \"Public corporation.\" A municipal corporation, a district\\ncorporation or a public benefit corporation as defined in section three\\nof the general corporation law.\\n  12. \"Special law.\" A state statute which in terms and in effect\\napplies to one or more, but not all, counties, counties other than those\\nwholly included within a city, cities, towns or villages.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            } ],
            "size" : 2
          },
          "repealed" : false
        }, {
          "lawId" : "MHR",
          "lawName" : "Municipal Home Rule",
          "locationId" : "A2",
          "title" : "General Powers of Local Governments to Adopt and Amend Local Laws; Restrictions",
          "docType" : "ARTICLE",
          "docLevelId" : "2",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 5,
          "repealedDate" : null,
          "fromSection" : "10",
          "toSection" : "11",
          "text" : "                                ARTICLE 2\\n                  GENERAL POWERS OF LOCAL GOVERNMENTS TO\\n                ADOPT AND AMEND LOCAL LAWS; RESTRICTIONS\\nSection 10. General powers of local governments to adopt and amend local\\n              laws.\\n        11. Restrictions on the adoption of local laws.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "10",
              "title" : "General powers of local governments to adopt and amend local laws",
              "docType" : "SECTION",
              "docLevelId" : "10",
              "activeDate" : "2018-08-31",
              "sequenceNo" : 6,
              "repealedDate" : null,
              "fromSection" : "10",
              "toSection" : "10",
              "text" : "  § 10. General powers of local governments to adopt and amend local\\nlaws.  1. In addition to powers granted in the constitution, the statute\\nof local governments or in any other law,\\n  (i) every local government shall have power to adopt and amend local\\nlaws not inconsistent with the provisions of the constitution or not\\ninconsistent with any general law relating to its property, affairs or\\ngovernment and,\\n  (ii) every local government, as provided in this chapter, shall have\\npower to adopt and amend local laws not inconsistent with the provisions\\nof the constitution or not inconsistent with any general law, relating\\nto the following subjects, whether or not they relate to the property,\\naffairs or government of such local government, except to the extent\\nthat the legislature shall restrict the adoption of such a local law\\nrelating to other than the property, affairs or government of such local\\ngovernment:\\n  a. A county, city, town or village:\\n  (1) The powers, duties, qualifications, number, mode of selection and\\nremoval, terms of office, compensation, hours of work, protection,\\nwelfare and safety of its officers and employees, except that cities and\\ntowns shall not have such power with respect to members of the\\nlegislative body of the county in their capacities as county officers.\\nThis provision shall include but not be limited to the creation or\\ndiscontinuance of departments of its government and the prescription or\\nmodification of their powers and duties.\\n  (2) In the case of a city, town or village, the membership and\\ncomposition of its legislative body.\\n  (3) The transaction of its business.\\n  (4) The incurring of its obligations, except that local laws relating\\nto financing by the issuance of evidences of indebtedness by such local\\ngovernment shall be consistent with laws enacted by the legislature.\\n  (5) The presentation, ascertainment, disposition and discharge of\\nclaims against it.\\n  (6) The acquisition, care, management and use of its highways, roads,\\nstreets, avenues and property.\\n  (7) The acquisition of its transit facilities and the ownership and\\noperation thereof.\\n  (8) The levy and administration of local taxes authorized by the\\nlegislature and of assessments for local improvements, which in the case\\nof county, town or village local laws relating to local non-property\\ntaxes shall be consistent with laws enacted by the legislature.\\n  (9) The collection of local taxes authorized by the legislature and of\\nassessments for local improvements, which in the case of county, town or\\nvillage local laws shall be consistent with laws enacted by the\\nlegislature.\\n  (9-a) The fixing, levy, collection and administration of local\\ngovernment rentals, charges, rates or fees, penalties and rates of\\ninterest thereon, liens on local property in connection therewith and\\ncharges thereon.\\n  (10) The wages or salaries, the hours of work or labor, and the\\nprotection, welfare and safety of persons employed by any contractor or\\nsubcontractor performing work, labor or services for it.\\n  (11) The protection and enhancement of its physical and visual\\nenvironment.\\n  (12) The government, protection, order, conduct, safety, health and\\nwell-being of persons or property therein. This provision shall include\\nbut not be limited to the power to adopt local laws providing for the\\nregulation or licensing of occupations or businesses provided, however,\\nthat:\\n  (a) The exercise of such power by a town shall relate only to the area\\nthereof outside the village or villages therein.\\n  (b) Except in a case where and to the extent that a county is\\nspecifically authorized to regulate or license an occupation or\\nbusiness, the exercise of such power by a county shall not relate to the\\narea thereof in any city, village or area of any town outside the\\nvillage or villages therein during such time as such city, village or\\ntown is regulating or licensing the occupation or business in question.\\n  (13) The apportionment of its legislative body and, only in connection\\nwith such action taken pursuant to this subparagraph, the composition\\nand membership of such body, the terms of office of members thereof, the\\nunits of local government or other areas from which representatives are\\nto be chosen and the voting powers of individual members of such\\nlegislative body. Except for the equal apportionment requirements in\\nsubclause (i.) of clause (a.) and clause (c.) of this subparagraph,\\nwhich shall apply generally to any local government, the power granted\\nby this subparagraph shall be in addition to and not in substitution for\\nany other power and the provisions of this subparagraph shall apply only\\nto local governments which adopt a plan of apportionment thereunder.\\n  (a.) A plan of apportionment adopted under this subparagraph shall\\ncomply with the following standards, which shall have priority in the\\norder herein set forth, to the extent applicable:\\n  (i.) The plan shall provide substantially equal weight for the\\npopulation of that local government in the allocation of representation\\nin the local legislative body.\\n  (ii.) In such plan adopted by a county, no town except a town having\\nmore than one hundred and ten per cent of a full ratio for each\\nrepresentative, shall be divided in the formation of representation\\nareas. Adjacent representation areas in the same town or city shall not\\ncontain a greater excess in population than five per cent of a full\\nratio for each representative.\\n  (iii.) The plan shall provide substantially fair and effective\\nrepresentation for the people of the local government as organized in\\npolitical parties.\\n  (iv.) Representation areas shall be of convenient and contiguous\\nterritory in as compact form as practicable.\\n  (b.) A plan of apportionment adopted by a county under this\\nsubparagraph may provide that mayors of cities or villages, supervisors\\nof towns or members of the legislative bodies of cities, towns, or\\nvillages, who reside in the county shall be eligible to be elected as\\nmembers of the county legislative body.\\n  (c.) As used in this subparagraph the term \"population\" shall mean\\nresidents, citizens, or registered voters. For such purposes, no person\\nshall be deemed to have gained or lost a residence, or to have become a\\nresident of a local government, as defined in subdivision eight of\\nsection two of this chapter, by reason of being subject to the\\njurisdiction of the department of corrections and community supervision\\nand present in a state correctional facility pursuant to such\\njurisdiction. A population base for such a plan of apportionment shall\\nutilize the latest statistical information obtainable from an official\\nenumeration done at the same time for all the residents, citizens, or\\nregistered voters of the local government. Such a plan may allocate, by\\nextrapolation or any other rational method, such latest statistical\\ninformation to representation areas or units of local government,\\nprovided that any plan containing such an allocation shall have annexed\\nthereto as an appendix, a detailed explanation of the allocation.\\n  (d.) Where a public hearing on a local law proposed to be adopted\\nunder this subparagraph is required, by subdivision five of section\\ntwenty of this chapter, to be held only before an elective chief\\nexecutive officer, the legislative body shall not adopt such proposed\\nlocal law until after a public hearing shall have been held thereon\\nbefore it, on notice as provided in such subdivision five, in which\\nevent no public hearing thereon before such chief executive officer\\nshall be required.\\n  (e) A local law proposed to be adopted under this subparagraph shall\\nbe subject to referendum only in the manner provided by paragraph j of\\nsubdivision two of section twenty-four of this chapter, except that such\\nlocal law shall be subject to a mandatory referendum in any county in\\nwhich a provision of law requires a mandatory referendum if a local law\\nproposes a change in the form or composition of the elective governing\\nbody of the county. The local law may be so structured as to permit\\nseparate submission of the principle elements (such as, multiple office\\nholding as in clause (b) above, the use of multiple member or floterial\\ndistricts in portions of the local government, and so forth) of the plan\\nand also may provide alternatives in the event one or more of these\\nseparate submissions is rejected by the electorate.\\n  (f.) Notwithstanding any inconsistent provisions of any general or\\nspecial law, or any local law, ordinance, resolution or city or county\\ncharter heretofore or hereafter adopted, no local government may\\nrestructure its local legislative body (pursuant to provision of this\\nchapter or any other provision of law) more than once in each decade\\ncommencing with the year nineteen hundred seventy; provided, however,\\nthat this prohibition shall not prevent the periodic adjustment of the\\nweight of the votes of representatives on the basis of current census,\\nvoter, or other valid information where an existing plan distributes the\\nvotes of representatives on such a basis.\\n  (14) The powers granted to it in the statute of local governments.\\n  b. A county:\\n  (1) The adoption, amendment or repeal of a county charter pursuant to\\narticle four of this chapter in addition to its powers under this\\narticle.\\n  (2) The establishment of a county tax department headed by a director\\nappointed by and serving at the pleasure of the board of supervisors,\\nwhich director shall, subject to authorization of such board (a) employ\\nnecessary employees, (b) advise with and assist all assessors,\\ncollectors and receivers of taxes of the various tax districts within\\nthe county in the discharge of their duties, (c) assist in the\\npreparation of equalization rates with the various tax districts within\\nthe county, (d) assist in the disposition and sale of real property\\nacquired by the county as the result of enforcement of unpaid taxes, and\\n(e) perform such other duties as shall be prescribed by such board.\\n  (3) The assignment to and the performance by the chairman of the board\\nof supervisors of specified administrative functions, powers and duties\\non behalf of such board, with provision for periodic reports to such\\nboard, and with further provision that such local law shall not divest\\nsuch board of such functions, powers and duties.\\n  (4) The creation of an office of administrative assistant to the\\nchairman of the board of supervisors and assignment to and performance\\nby such an assistant, under the general supervision of such chairman, of\\nspecified administrative functions, powers and duties on behalf of such\\nboard, with provision for periodic reports to such board, and with\\nfurther provision that such local law shall not divest such board of\\nsuch functions, powers and duties.\\n  (5) The compensation to be paid from county funds to public officers\\nor employees who are not officers or employees of the county other than\\nmembers of the judiciary.\\n  (6) The method for the correction of assessment rolls and tax rolls as\\nauthorized by title three of article five of the real property tax law,\\nsubject to review by the courts as provided by law.\\n  (7) The protection or preservation of game, game birds, fish or shell\\nfish on county-owned lands.\\n  (8) The control of floods or the conservation of soil.\\n  (9) The reforestation of lands owned by the county.\\n  (10) The eradication or prevention of bovine tuberculosis or other\\ninfectious or communicable diseases affecting animals or fowls.\\n  (11) The regulation or prohibition of the dumping of garbage, rubbish,\\nashes or other waste material in or adjacent to creeks or streams in\\nwatershed areas improved under any flood control or soil erosion\\nprogram.\\n  c. A city:\\n  (1) The revision of its charter or the adoption of a new charter by\\nlocal law adopted by its legislative body pursuant to the provisions of\\nthis chapter and subject to the procedure prescribed by this chapter or\\nby local law adopted pursuant to article four of this chapter.\\n  (2) The preparation, making, confirmation and correction of\\nassessments of real property and the review of such assessments subject\\nto further review by the courts as provided by law.\\n  (3) The authorization, making, confirmation and correction of benefit\\nassessments for local improvements.\\n  d. A town:\\n  (1) The preparation, making, confirmation and correction of\\nassessments of real property and the review of such assessments subject\\nto further review by the courts as provided by law, consistent with laws\\nenacted by the legislature.\\n  (2) The authorization, making, confirmation and correction of benefit\\nassessments for local improvements, consistent with laws enacted by the\\nlegislature.\\n  (3) The amendment or supersession in its application to it, of any\\nprovision of the town law relating to the property, affairs or\\ngovernment of the town or to other matters in relation to which and to\\nthe extent to which it is authorized to adopt local laws by this\\nsection, notwithstanding that such provision is a general law, unless\\nthe legislature expressly shall have prohibited the adoption of such a\\nlocal law. Unless authorized by other state statute this subparagraph\\nshall not be deemed to authorize supersession of a state statute\\nrelating to (1) a special or improvement district or an improvement\\narea, (2) creation or alteration of areas of taxation, (3) authorization\\nor abolition of mandatory and permissive referendum or (4) town finances\\nas provided in article eight of the town law; provided, however that\\nnothing set forth herein shall preclude the transfer or assignment of\\nfunctions, powers and duties from one town officer or employee to\\nanother town officer or employee, and provided, however, further that\\nthe powers of local legislation and appropriation shall be exercised by\\nthe local legislative body.\\n  e. A village:\\n  (1) The preparation, making, confirmation and correction of\\nassessments of real property and the review of such assessments subject\\nto further review by the courts as provided by law, consistent with laws\\nenacted by the legislature.\\n  (2) The authorization, making, confirmation and correction of benefit\\nassessments for local improvements.\\n  (3) The amendment or supersession in its application to it, of any\\nprovision of the village law relating to the property, affairs or\\ngovernment of the village or to other matters in relation to which and\\nto the extent to which it is authorized to adopt local laws by this\\nsection, notwithstanding that such provision is a general law, unless\\nthe legislature expressly shall have prohibited the adoption of such a\\nlocal law.\\n  2. Every local government also shall have power to adopt and amend\\nlocal laws where and to the extent that its legislative body has power\\nto act by ordinance, resolution, rule or regulation.\\n  3. a. A grant of a specific power by this section to one or more local\\ngovernments shall not operate to restrict the meaning of a general grant\\nof power by this section to the same or any other local government or to\\nexclude other powers comprehended in such general grant.\\n  b. The enumeration of powers in this section is not intended to imply\\nthat any of such powers is not included within the power of a local\\ngovernment to adopt and amend local laws in relation to its property,\\naffairs and government.\\n  4. In the exercise of its powers to adopt and amend local laws, the\\nlegislative body of a local government shall have power:\\n  (a) To delegate to any officer or agency of such local government the\\npower to adopt resolutions or to promulgate rules and regulations for\\ncarrying into effect or fully administering the provisions of any local\\nlaw and to authorize issuance of an appearance ticket by a public\\nservant who, by virtue of office, title or position is authorized or\\nrequired to enforce any statute, local law, ordinance, rule or\\nregulation relating to parking, licensing of occupations or businesses,\\nfire prevention and safety, health and sanitation, and building, zoning\\nand planning; provided however, that a peace officer may be authorized\\nto issue an appearance ticket relating to enforcement of any statue,\\nlocal law, ordinance, rule or regulation affecting the public health,\\nsafety and welfare.\\n  (b) To provide for the enforcement of local laws by legal or equitable\\nproceedings which are or may be provided or authorized by law, to\\nprescribe that violations thereof shall constitute misdemeanors,\\noffenses or infractions and to provide for the punishment of violations\\nthereof by civil penalty, fine, forfeiture, community service, where the\\ndefendant has consented to the amount and conditions of such service,\\nprovided however, that the performance of any such services shall not\\nresult in the displacement of employed workers or in the impairment of\\nexisting services, nor shall the performance of any such services be\\nrequired or permitted in any establishment involved in any labor strike\\nor lockout, or imprisonment, or by two or more of such punishments,\\nprovided, however, that a local law adopted pursuant to subdivision two\\nof this section shall provide only for such enforcement or punishment as\\ncould be prescribed if the action of the legislative body were taken by\\nordinance, resolution, rule or regulation, as the case may be.\\n  (c) To enact as local law the provisions of any existing charter,\\ngeneral law or special law, theretofore enacted, conferring a right,\\npower or authority, or imposing a duty or obligation, on such local\\ngovernment, whether or not the same relate to its property, affairs or\\ngovernment. Any such provision of law so re-enacted shall thereafter be\\nsubject to be superseded by local law only to the same extent and in the\\nsame manner as if the same had not been so re-enacted.\\n  (d) In establishing the office of the head of a department of its\\ngovernment, to provide that such an office shall be in the unclassified\\nservice of the civil service and, in establishing the offices of one or\\nmore deputies to the head of a department of its government with power\\nto act generally for and in place of their principals, to provide that\\nthe positions of such deputies shall be in the exempt class of the civil\\nservice.\\n  5. Except in the case of a transfer of functions pursuant to the\\nconstitution or under an alternative form of county government, a local\\ngovernment shall not have power to adopt local laws which impair the\\npowers of any other public corporation.\\n  6. Whenever the constitutionality of any local law, ordinance, rule or\\nregulation is brought into issue upon a trial or hearing of any civil\\ncause of action or proceeding in any court, and the local government\\nwhich enacted such local law, ordinance, rule, or regulation is not a\\nparty to such action or proceeding, notice shall be served upon such\\nlocal government in accordance with section one thousand twelve of the\\ncivil practice law and rules.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "11",
              "title" : "Restrictions on the adoption of local laws",
              "docType" : "SECTION",
              "docLevelId" : "11",
              "activeDate" : "2019-01-11",
              "sequenceNo" : 7,
              "repealedDate" : null,
              "fromSection" : "11",
              "toSection" : "11",
              "text" : "  § 11. Restrictions on the adoption of local laws. 1. Notwithstanding\\nany provision of this chapter, the legislative body shall not be deemed\\nauthorized by this chapter to adopt a local law which supersedes a state\\nstatute, if such local law:\\n  a. Removes or raises any limitation of law on the amount in which the\\nlocal government may become indebted, or on the amount which may be\\nraised in any one fiscal year by tax for any or all purposes of such\\nlocal government provided, however, that if the total bonded\\nindebtedness of any city operating under the provisions of the second\\nclass cities law is evidenced only by serial bonds payable in annual\\ninstallments, any such city may adopt a local law which shall provide\\nthat the provisions of section seventy-two of the second class cities\\nlaw shall not be operative or applicable as to such city.\\n  b. Removes a restriction of law relating to the issuance of bonds or\\nother evidences of indebtedness.\\n  c. Applies to or affects the maintenance, support or administration of\\nthe educational system in such local government, or a teachers' pension\\nor retirement system therein.\\n  d. Except in the case of an alternative form of county government,\\nchanges the number or term of office of the members of the county board\\nof supervisors chosen as such in a city or town.\\n  e. Applies to or affects the courts as required or provided by article\\nsix of the constitution.\\n  f. Applies to or affects any provision of paragraph (c) of subdivision\\none of section 8-100 of the election law, the labor law, sections two,\\nthree and four of chapter one thousand eleven of the laws of nineteen\\nhundred sixty-eight, entitled \"An act in relation to the maximum hours\\nof labor of certain municipal and fire district firefighters and the\\nholidays of firefighters and police officers, repealing certain sections\\nof the labor law relating thereto, and to amend the municipal home rule\\nlaw, in relation thereto,\" as amended, the volunteer firefighters'\\nbenefit law, or the workers' compensation law or changes any provision\\nof the multiple residence law or the multiple dwelling law, except that\\nin a city of one million persons or more, the provisions of local law\\nfor the enforcement of the housing code which is not less restrictive\\nthan the multiple dwelling law may be applied in the enforcement of the\\nmultiple dwelling law.\\n  g. Applies to or affects powers of the state comptroller in relation\\nto auditing or examining municipal accounts or prescribing forms of\\nmunicipal accounting or in relation to approval or disapproval of\\nestablishment or extension of fire districts or special districts.\\n  h. Applies to or affects any provision of law providing for regulation\\nor elimination of railroad crossings at grade or terminal facilities\\nwithin the local government.\\n  i. Relates to the judicial review of dismissals from the civil service\\nor, in the case of a county, changes a provision of law relating to the\\nmembership of its civil service commission or to the terms of office of\\nthe members of such commission or of the personnel officer administering\\nthe provisions of the civil service law.\\n  j. In the case of a city, transfers to abutting property owners its\\nliability for failure to maintain its sidewalks and gutters in a\\nreasonably safe condition.\\n  2. Notwithstanding any provision of this chapter, the legislative body\\nof a county, city or village shall not be authorized by this chapter to\\nadopt any local law which:\\n  a. Amends the charter of the county, city or village, as the case may\\nbe, contrary to any provisions of such charter regulating its own\\namendment. This provision shall not abridge the right of the people of a\\ncounty, city or village to amend their charter or approve a proposed new\\ncharter, where such amendment or proposed new charter is subject to a\\nmandatory referendum.\\n  b. The legislative body is by provision of the charter prohibited to\\nadopt.\\n  3. Notwithstanding any provision of this chapter, any local law\\nadopted by a town board shall be effective and operative only in that\\nportion of such town outside of any village or villages therein except\\nin a case where the power of such town board extends to and includes the\\narea of the town within any such village or villages.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            } ],
            "size" : 2
          },
          "repealed" : false
        }, {
          "lawId" : "MHR",
          "lawName" : "Municipal Home Rule",
          "locationId" : "A3",
          "title" : "Procedure For Adoption of Local Laws; Referenda; Filing and Publication",
          "docType" : "ARTICLE",
          "docLevelId" : "3",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 8,
          "repealedDate" : null,
          "fromSection" : "20",
          "toSection" : "28",
          "text" : "                                ARTICLE 3\\n             PROCEDURE FOR ADOPTION OF LOCAL LAWS; REFERENDA;\\n                         FILING AND PUBLICATION\\nSection 20. Procedure for adoption of local laws by legislative body.\\n        21. Approval of local laws by elective chief executive officer.\\n        22. Effect  of  local laws on acts of legislature or prior local\\n              laws or ordinances.\\n        23. Local laws subject to mandatory referendum.\\n        24. Local laws subject to referendum on petition.\\n        25. Propositions for the submission of local laws.\\n        26. Reconsideration  of   local   law   before   submission   to\\n              referendum.\\n        27. Filing and publication of local laws.\\n        28. Law  applicable  to  conduct  of  elections  at which ballot\\n              questions are submitted to all the voters of a city.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "20",
              "title" : "Procedure for adoption of local laws by legislative body",
              "docType" : "SECTION",
              "docLevelId" : "20",
              "activeDate" : "2015-11-06",
              "sequenceNo" : 9,
              "repealedDate" : null,
              "fromSection" : "20",
              "toSection" : "20",
              "text" : "  § 20. Procedure for adoption of local laws by legislative body.  1. No\\nlocal law shall be passed except by at least the majority affirmative\\nvote of the total voting power of the legislative body.  On the final\\npassage of a local law the question shall be taken by ayes and noes, and\\nthe names of the members present and their votes shall be entered in the\\nrecord, journal or minutes of proceedings.\\n  2. The style of local law shall be \"Be it enacted by the (naming the\\nlegislative body) of the (name of local government) as follows:\"\\n  3. Every such local law shall embrace only one subject. The title\\nshall briefly refer to the subject matter. For purposes of this chapter,\\na local law relating to codification or recodification of ordinances or\\nlocal laws into a municipal code shall be deemed to embrace only one\\nsubject. As used herein codification or recodification shall include\\namendments, deletions, repeals, alterations or new provisions in the\\nmunicipal code; provided, however, that the notice of public hearing\\nrequired by this section shall briefly describe the codification or\\nrecodification.\\n  4. A proposed local law may be introduced only by a member of the\\nlegislative body at a meeting of such body or as may be otherwise\\nprescribed by the rules of procedure adopted by the legislative body. No\\nsuch local law shall be passed until it shall have been in its final\\nform and either (a) upon the desks or tables of the members at least\\nseven calendar days, exclusive of Sunday, prior to its final passage, or\\n(b) mailed to each of them in postpaid properly addressed and securely\\nclosed envelopes or wrappers in a post box or post office of the United\\nStates post office department within the local government at least ten\\ncalendar days, exclusive of Sunday, prior to its final passage, or (c)\\ne-mailed to the e-mail in-box of each of them in the Portable Document\\nFormat (PDF) at least ten calendar days, exclusive of Sunday, prior to\\nits final passage, provided that (i) the local government has documented\\nthat each member of the legislative body has an e-mail address, (ii) the\\nlocal government has published such e-mail address on the bulletin board\\nof the local government clerk, and (iii) the legislative body has\\nunanimously adopted a resolution authorizing such electronic delivery;\\nunless the elective or appointive chief executive officer, if there be\\none, or otherwise the chairman of the board of supervisors, in the case\\nof a county, the mayor in the case of a city or village or the\\nsupervisor in the case of a town shall have certified as to the\\nnecessity for its immediate passage and such local law be passed by the\\naffirmative vote of two-thirds of the total voting power of the\\nlegislative body.\\n  For purposes of this subdivision, a proposed local law shall be deemed\\nto be upon the desks or tables of the members if: it is set forth in a\\nlegible electronic format by electronic means, and it is available for\\nreview in such format at the desks of the members. For purposes of this\\nsubdivision \"electronic means\" means any method of transmission of\\ninformation between computers or other machines designed for the purpose\\nof sending and receiving such transmissions and which: allows the\\nrecipient to reproduce the information transmitted in a tangible medium\\nof expression; and does not permit additions, deletions or other changes\\nto be made without leaving an adequate record thereof.\\n  5. In the case of a local government which does not have an elective\\nchief executive officer as defined by subdivision four of section two of\\nthis chapter, no local law shall be passed by the legislative body until\\na public hearing thereon has been had before such body and in every\\nother local government no such local law shall be approved by the\\nelective chief executive officer until a public hearing thereon has been\\nhad before him. Such a public hearing held before the legislative body\\nor before the chief executive officer, as the case may be, pursuant to\\nthis subdivision shall be on such public notice of at least three days\\nas has been or hereafter may be prescribed by a local law on which a\\nhearing shall have been held as prescribed by this section upon five\\ndays' notice or, in the event such a local law prescribing the length of\\nnotice is not adopted, upon five days' notice. Where the public hearing\\nis before such officer, such notice shall be given by him within ten\\ndays after the local law shall have been presented to him and the\\nhearing shall be held within twenty days after such presentation.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "21",
              "title" : "Approval of local laws by elective chief executive officer",
              "docType" : "SECTION",
              "docLevelId" : "21",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 10,
              "repealedDate" : null,
              "fromSection" : "21",
              "toSection" : "21",
              "text" : "  § 21. Approval of local laws by elective chief executive officer.\\nEvery local law shall be certified by the clerk after its passage by\\nsuch body and shall be presented to the elective chief executive\\nofficer, if any, for approval by him. If such officer approves it, he\\nshall sign it and return it to such clerk; it shall then be deemed to\\nhave been adopted. If he disapproves it, he shall return it to the clerk\\nwith his objections stated in writing and the clerk shall present the\\nsame with such objections to the legislative body at its next regular\\nmeeting and such objections shall be entered in its record, journal or\\nminutes of proceedings. The legislative body within thirty days\\nthereafter may reconsider the same. Such an elective chief executive\\nofficer who is a member of the legislative body shall not be entitled to\\nvote on such reconsideration. If after such reconsideration such local\\nlaw is repassed by a vote of at least two-thirds of the total voting\\npower of the legislative body, exclusive of such officer, it shall be\\ndeemed adopted, notwithstanding the objections of such officer. Only one\\nvote shall be had upon such reconsideration. The vote shall be taken by\\nayes and noes, and the names of the members present and their votes\\nshall be entered in the record, journal or minutes of proceedings. If\\nwithin thirty days after a local law shall have been presented to him\\nsuch officer shall neither approve it nor return it to the clerk with\\nhis objections, it shall be deemed to be adopted in like manner as if he\\nhad signed it. At any time prior to such adoption or to the return of a\\nlocal law by such officer, as the case may be, the legislative body may\\nrecall the same and reconsider its action thereon.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "22",
              "title" : "Effect of local laws on acts of legislature or prior local laws or ordinances",
              "docType" : "SECTION",
              "docLevelId" : "22",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 11,
              "repealedDate" : null,
              "fromSection" : "22",
              "toSection" : "22",
              "text" : "  § 22. Effect of local laws on acts of legislature or prior local laws\\nor ordinances. 1. In adopting a local law changing or superseding any\\nprovision of a state statute or of a prior local law or ordinance, the\\nlegislative body shall specify the chapter or local law or ordinance,\\nnumber and year of enactment, section, subsection or subdivision, which\\nit is intended to change or supersede, but the failure so to specify\\nshall not affect the validity of such local law. Such a superseding\\nlocal law may contain the text of such statute, local law or ordinance,\\nsection, subsection or subdivision and may indicate the changes to be\\neffected in its text or application to such local government by\\nenclosing in brackets, or running a line through, the matter to be\\neliminated therefrom and italicizing or underscoring new matter to be\\nincluded therein.\\n  2. No local law shall supersede any provision of a state statute\\nexcept as authorized by the constitution, this chapter or any other\\nstate statute.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "23",
              "title" : "Local laws subject to mandatory referendum",
              "docType" : "SECTION",
              "docLevelId" : "23",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 12,
              "repealedDate" : null,
              "fromSection" : "23",
              "toSection" : "23",
              "text" : "  § 23. Local laws subject to mandatory referendum. 1. A local law\\nsubject to mandatory referendum as provided in this section or in any\\nother state statute, shall be submitted for the approval of the electors\\nat a general election of state or local government officers in such\\nlocal government held not less than sixty days after the adoption\\nthereof unless such local law provides for its submission for approval\\nof the electors at a special election or unless, within thirty days\\nafter the adoption of such local law, a petition signed, authenticated\\nand subject to certification by the clerk as provided for other\\npetitions in section twenty-four of this chapter is filed with such\\nclerk requesting its submission at a special election. If the local law\\nso provides or if a valid petition is so filed requesting the submission\\nof the local law at a special election, it shall be submitted at such a\\nspecial election held in such local government not less than sixty days\\nafter the adoption of the local law, the date for which special election\\nshall be fixed by the legislative body. In either case such local law\\nshall become operative as prescribed therein only if approved at such\\nelection by the affirmative vote of a majority of the qualified electors\\nof such local government voting upon the proposition.\\n  2. Except as otherwise provided by or under authority of a state\\nstatute, a local law shall be subject to mandatory referendum if it:\\n  a. In the case of a city, provides a new charter for such city.\\n  b. In the case of a city, town or village, changes the membership or\\ncomposition of the legislative body or increases or decreases the number\\nof votes which any member is entitled to cast.\\n  c. Changes the veto power of the elective chief executive officer.\\n  d. Changes the law of succession to the office of the chief executive\\nofficer of a county elected on a county-wide basis or if there be none\\nthe chairman of the board of supervisors, the mayor of a city or village\\nor the supervisor of a town.\\n  e. Abolishes an elective office, or changes the method of nominating,\\nelecting or removing an elective officer, or changes the term of an\\nelective office, or reduces the salary of an elective officer during his\\nterm of office.\\n  f. Abolishes, transfers or curtails any power of an elective officer.\\n  g. Creates a new elective office.\\n  h. In the case of a city, changes the boundaries of wards, or other\\ndistricts, from which members of the county board of supervisors, chosen\\nas such in such city to represent the city, are elected.\\n  i. Changes a provision of law relating to public utility franchises.\\n  j. In the case of a city, reduces the salary or compensation of a city\\nofficer or employee, increases his hours of employment or changes his\\nworking conditions if such salary, compensation, hours or conditions\\nhave been fixed by a state statute and approved by the vote of the\\nqualified electors of the city. No provision effecting such reductions,\\nincreases or changes contained in any local law or proposed new charter\\nshall become effective unless the definite question with respect to such\\nreductions, increases or changes shall be submitted separately from any\\nprovisions not relating to such reductions, increases or changes and\\napproved by the affirmative vote of a majority of the qualified electors\\nvoting thereon.\\n  k. In the case of a city, changes a provision of law relating to the\\nmembership or terms of office of the civil service commission of the\\ncity.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "24",
              "title" : "Local laws subject to referendum on petition",
              "docType" : "SECTION",
              "docLevelId" : "24",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 13,
              "repealedDate" : null,
              "fromSection" : "24",
              "toSection" : "24",
              "text" : "  § 24. Local laws subject to referendum on petition. 1. a. A local law\\nadopted by a county, city or town and subject to referendum on petition\\nas provided in this section or in any other state statute, if not also\\nsubject to mandatory referendum, shall not take effect until at least\\nforty-five days after its adoption; nor until approved by the\\naffirmative vote of a majority of the qualified electors of the local\\ngovernment voting on a proposition for its approval if within forty-five\\ndays after its adoption there be filed with the clerk a petition\\nprotesting against such local law, signed and authenticated as herein\\nrequired by qualified electors of such local government, registered to\\nvote therein at the last preceding general election, in number equal to\\nat least ten per centum of the total number of votes cast for governor\\nat the last gubernatorial election in such local government. If such\\npetition be so filed, a proposition for the approval of such local law\\nshall be submitted at the next general election of state or local\\ngovernment officers held in such local government not less than sixty\\ndays after the filing of such petition, unless the petition request and\\nthe legislative body adopt a local law submitting such proposition at a\\nspecial election held not less than sixty days after the adoption of the\\nlocal law providing for such special election. The petition may be made\\nupon separate sheets, and the signatures to each sheet shall be signed\\nand authenticated in the manner provided by the election law for the\\nsigning and authentication of nominating petitions so far as applicable.\\nThe several sheets so signed and authenticated, when fastened together\\nand offered for filing, shall be deemed to constitute one petition. The\\nclerk shall examine each such petition so filed with him and not later\\nthan thirty days after the date of its filing, or forty-five days before\\nthe day of the election at which such referendum would appear on the\\nballot, whichever is earlier, shall transmit to the legislative body a\\ncertificate that he has examined it and has found that it complies or\\ndoes not comply, as the case may be, with all the requirements of law.\\nIf within five days after the last day to file such certificate a\\nwritten objection to the determination of the clerk be filed with the\\nsupreme court, or any justice thereof, of a judicial district in which\\nsuch local government or any part thereof is located, such court or\\njustice shall determine any question arising thereunder and make such\\norder as justice may require. Such proceeding shall be heard and\\ndetermined in the manner prescribed by section 16-116 of the election\\nlaw.\\n  b. A local law adopted by a village and subject to a referendum on\\npetition as provided in this section or in any other state statute, if\\nnot also subject to a mandatory referendum shall be conducted as a\\npermissive referendum as provided in article nine of the village law and\\ncompliance with that article shall be deemed to be compliance with this\\nchapter for all purposes.\\n  2. Except as otherwise provided by or under authority of a state\\nstatute, a local law shall be subject to referendum on petition if it:\\n  a. Dispenses with a provision of law requiring a public notice or\\nhearing as a condition precedent to official action.\\n  b. Changes a provision of law relating to public bidding, purchases or\\ncontracts.\\n  c. Changes a provision of law relating to assessments of real property\\nor benefit assessments for local improvements.\\n  d. Changes a provision of law relating to the exercise of the power of\\ncondemnation.\\n  e. Changes a provision of law relating to the authorization or\\nissuance of bonds or other obligations, except as provided in section\\n34.00 of the local finance law in the case of a city.\\n  f. Changes a provision of law relating to the auditing of the accounts\\nof the local government.\\n  g. Changes a provision of law relating to the alienation or leasing of\\nreal property of the local government.\\n  h. In the case of a city, town or village increases the salary of an\\nelective officer during his term of office or, in the case of a county,\\nincreases the salary of an elective officer or of an officer appointed\\nfor a fixed term, during his term of office, except where any such\\nincrease by a county is made in accordance with a schedule providing\\nhigher rates of compensation through additional increments of salary\\nbased on time service, which schedule or applicable amendment thereof\\nwas in existence prior to the commencement of such term of office.\\n  i. In the case of a county, establishes a county general hospital\\npursuant to the provisions of the general municipal law.\\n  j. Is a local law relating to apportionment adopted pursuant to\\nsubparagraph thirteen of paragraph a of subdivision one of section ten\\nof this chapter. Notwithstanding the provisions of subdivision one of\\nthis section:\\n  (1) A petition signed and authenticated in number equal to at least\\nfive per centum of qualified voters as provided in subdivision one of\\nthis section, or to fifteen thousand, whichever is less, shall be\\nsufficient to require the submission of a proposition or propositions\\nfor the approval of such a local law or the principle elements\\ndesignated therein for separate submission, at a referendum in\\naccordance with such subdivision.\\n  (2) The legislative body of the local government on its own motion may\\nadopt a resolution requiring that a proposition or propositions for the\\napproval of such a local law and the principle elements therein as shall\\nhave been designated for separate submission, be submitted at a\\nreferendum, in accordance with such subdivision, at the next general\\nelection, or at a special election, held not less than sixty days after\\nthe adoption of such resolution.\\n  k. In the case of a village, creates or abolishes the office of\\nmanager.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "25",
              "title" : "Propositions for the submission of local laws",
              "docType" : "SECTION",
              "docLevelId" : "25",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 14,
              "repealedDate" : null,
              "fromSection" : "25",
              "toSection" : "25",
              "text" : "  § 25. Propositions for the submission of local laws. A proposition for\\nthe submission of a local law to the approval of the electors pursuant\\nto this chapter shall contain the title of such local law. The clerk,\\nwith the advice of the corporation counsel, municipal attorney or other\\nprincipal law officer shall prepare an abstract of such local law\\nconcisely stating the title, purpose and effect thereof, and forthwith\\nshall transmit such proposition and such abstract to the election\\nofficers charged with the duty of publishing the notice of and\\nfurnishing the supplies for such election. A sufficient number of copies\\nof such abstract shall be printed and made available at the time of\\nregistration or otherwise in advance of the election to such electors as\\ndesire them, and shall also be delivered with the other election\\nsupplies and distributed to the electors at the election. If there be\\nmore than one such proposition to be voted upon at such election, such\\npropositions shall be separately and consecutively numbered.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "26",
              "title" : "Reconsideration of local law before submission to referendum",
              "docType" : "SECTION",
              "docLevelId" : "26",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 15,
              "repealedDate" : null,
              "fromSection" : "26",
              "toSection" : "26",
              "text" : "  § 26. Reconsideration of local law before submission to referendum. At\\nany time prior to the election at which a local law adopted by a\\nlegislative body is to be submitted to the electors for approval because\\nit is subject to mandatory or permissive referendum, the legislative\\nbody, not later than fifteen days prior to the election, may reconsider\\nits action thereon and repeal such local law, whereupon the proposition\\nfor its approval shall not be submitted at such election or, if\\nsubmitted, the vote of the electors thereon shall be without effect.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "27",
              "title" : "Filing and publication of local laws",
              "docType" : "SECTION",
              "docLevelId" : "27",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 16,
              "repealedDate" : null,
              "fromSection" : "27",
              "toSection" : "27",
              "text" : "  § 27. Filing and publication of local laws. 1. Within twenty days\\nafter a local law shall finally have been adopted, the clerk, or other\\nofficer designated by the legislative body, shall file one certified\\ncopy thereof in the office of such clerk except that in the case of a\\ncounty it shall also be filed in the office of the county clerk and one\\ncertified copy in the office of the secretary of state. In the case of a\\nlocal law subject to a referendum, however, such local law shall be\\nfiled within twenty days after its approval by the electors, or where\\nthe local law was subject to a permissive referendum and no petition was\\nfiled requesting the referendum, the local law shall be filed within\\ntwenty days after the time for filing of such petition shall have\\nexpired.\\n  2. Each such certified copy shall contain the text only of the local\\nlaw without the brackets and without the matter within the brackets, the\\nmatter with a line run through it, or the italicizing or underscoring,\\nif any, to indicate the changes made by it, except that each such\\ncertified copy of a local law enacted by a city with a population of one\\nmillion or more shall be printed in the same form as the official copy\\nof the proposed local law which became the local law provided that line\\nnumbers, the printed number of the bill and explanatory matter shall be\\nomitted.\\n  3. Notwithstanding the effective date of any local law, a local law\\nshall not become effective before it is filed in the office of the\\nsecretary of state.\\n  4. Subject to the provisions of subdivision three hereof, every local\\nlaw shall take effect on the twentieth day after it shall finally have\\nbeen adopted unless a different time shall be prescribed therein or\\nrequired by this chapter or other provision of law.\\n  5. The secretary of state shall publish annually local laws on the\\ndepartment of state website and in a separate volume as a supplement to\\nthe session laws, and shall publish at least annually on the department\\nof state website a complete codification of all local laws in effect\\nthat have been adopted by the legislative body of each county. The\\nclerk, or other officer designated by the legislative body of each\\ncounty, shall provide local laws to the secretary of state in a manner\\nspecified by the secretary of state to facilitate the publication\\nrequirements of this subdivision.\\n  6. The clerk shall record all local laws filed in his office in a\\nseparate book or books, which shall be indexed by him.\\n  7. The secretary of state shall have the authority to provide for the\\nreceipt and filing of local laws by electronic transmission.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "28",
              "title" : "Law applicable to conduct of elections at which ballot questions are submitted to all the voters of a city",
              "docType" : "SECTION",
              "docLevelId" : "28",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 17,
              "repealedDate" : null,
              "fromSection" : "28",
              "toSection" : "28",
              "text" : "  § 28. Law applicable to conduct of elections at which ballot questions\\nare submitted to all the voters of a city. The provisions of the\\nelection law or any other law relating to the submission of questions at\\ngeneral elections, so far as the same are applicable and not\\ninconsistent with this article, shall apply to the conduct of all\\nelections at which questions are submitted to all the voters of a city.\\nWhere a specific provision of law exists in any other law which is\\ninconsistent with the provisions of the election law, such provision\\nshall apply unless a provision of the election law specifies that such\\nprovision of the election law shall apply notwithstanding any other\\nprovision of law.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            } ],
            "size" : 9
          },
          "repealed" : false
        }, {
          "lawId" : "MHR",
          "lawName" : "Municipal Home Rule",
          "locationId" : "A4",
          "title" : "Powers of Counties and Cities to Adopt Charters",
          "docType" : "ARTICLE",
          "docLevelId" : "4",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 18,
          "repealedDate" : null,
          "fromSection" : "30",
          "toSection" : "38",
          "text" : "                                ARTICLE 4\\n                       POWERS OF COUNTIES AND CITIES\\n                            TO ADOPT CHARTERS\\n  Part 1. The county charter law.\\n  Part 2. City charter revision.\\n  Part 3. State Assistance--County--City.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "A4P1",
              "title" : "The County Charter Law",
              "docType" : "PART",
              "docLevelId" : "1",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 19,
              "repealedDate" : null,
              "fromSection" : "30",
              "toSection" : "35",
              "text" : "                                 PART 1\\n                          THE COUNTY CHARTER LAW\\nSection 30.   Short title.\\n        31.   Application.\\n        32.   Definitions.\\n        33.   Power to adopt, amend and repeal county charters.\\n        33-a. Transfer  of  functions or duties of local governments and\\n                districts.\\n        34.   Limitations and restrictions.\\n        35.   Legislative intent; construction.\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MHR",
                  "lawName" : "Municipal Home Rule",
                  "locationId" : "30",
                  "title" : "Short title",
                  "docType" : "SECTION",
                  "docLevelId" : "30",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 20,
                  "repealedDate" : null,
                  "fromSection" : "30",
                  "toSection" : "30",
                  "text" : "  § 30. Short title. This part shall be known and may be cited and\\nreferred to as the \"county charter law.\"\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MHR",
                  "lawName" : "Municipal Home Rule",
                  "locationId" : "31",
                  "title" : "Application",
                  "docType" : "SECTION",
                  "docLevelId" : "31",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 21,
                  "repealedDate" : null,
                  "fromSection" : "31",
                  "toSection" : "31",
                  "text" : "  § 31. Application. This part shall apply to each county of the state\\nexcept a county in the city of New York.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MHR",
                  "lawName" : "Municipal Home Rule",
                  "locationId" : "32",
                  "title" : "Definitions",
                  "docType" : "SECTION",
                  "docLevelId" : "32",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 22,
                  "repealedDate" : null,
                  "fromSection" : "32",
                  "toSection" : "32",
                  "text" : "  § 32. Definitions. For the purposes of this part, the following terms\\nshall mean and include:\\n  1. \"Board of supervisors.\" The board of supervisors or other elective\\ngoverning body of a county.\\n  2. \"Charter law.\" A local law providing, amending or repealing a\\ncounty charter, or transferring a function or a duty pursuant to section\\nthirty-three-a of this chapter.\\n  3. \"County.\" A county of the state except a county in the city of New\\nYork.\\n  4. \"County charter.\" An alternative form of county government provided\\nin accordance with the constitution by act of the legislature or local\\nlaw.\\n  5. \"Local law.\" A local law adopted by the board of supervisors of a\\ncounty pursuant to this chapter or other statute generally empowering\\nthe county to adopt local laws.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MHR",
                  "lawName" : "Municipal Home Rule",
                  "locationId" : "33",
                  "title" : "Power to adopt, amend and repeal county charters",
                  "docType" : "SECTION",
                  "docLevelId" : "33",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 23,
                  "repealedDate" : null,
                  "fromSection" : "33",
                  "toSection" : "33",
                  "text" : "  § 33. Power to adopt, amend and repeal county charters. 1. Subject to\\nrestrictions in the constitution, in this article or in any other\\napplicable law, the board of supervisors of any county as defined in\\nsection thirty-two of this article and including but not limited to a\\ncounty which has heretofore adopted a charter enacted by the legislature\\nshall have power to prepare, adopt, amend or repeal a county charter.\\n  2. A county charter shall set forth the structure of the county\\ngovernment and the manner in which it is to function. Such charter may\\nprovide for the appointment of any county officers or their selection by\\nany method of nomination and election, provided that there shall be an\\nelective board of supervisors, the members of which shall be deemed\\ncounty officers, which shall determine county policies and exercise such\\nother functions as may be assigned to it.\\n  3. Such a county charter shall provide for:\\n  a. The exercise by the board of supervisors of the powers of local\\nlegislation and appropriation of the county.\\n  b. The agencies or officers responsible for the performance of the\\nfunctions, powers and duties of the county and of any agencies or\\nofficers thereof and the manner of election or appointment, terms of\\noffice, if any, and removal of such officers.\\n  c. The equalization of real property taxes consistent with standards\\nprescribed by the legislature.\\n  4. Such a county charter may:\\n  a. Assign executive or administrative functions, powers and duties to\\nelective or appointive officers.\\n  b. Empower an executive officer elected on a county-wide basis to veto\\nactions of the board of supervisors, with provision for overriding of\\nsuch vetoes by a specified percentage or percentages of votes of such\\nboard.\\n  c. In accordance with subdivision (h) of section one of article nine\\nof the constitution, provide for the transfer of one or more functions\\nor duties of the county or of the cities, towns, villages, districts or\\nother units of government wholly contained in such county to each other\\nor when authorized by the legislature to the state, or for the abolition\\nof one or more offices, departments or agencies of such units of\\ngovernment when all of their functions or duties are so transferred.\\n  d. Provide for an administrative code which shall set forth the\\ndetails of administration of the county government in harmony with the\\nprovisions of the county charter and may contain revisions,\\nsimplifications, consolidations, codifications and restatements of\\nspecial laws, local laws, ordinances, resolutions, rules and regulations\\nconsistent with the county charter.\\n  e. Provide for the termination of the terms of office of existing\\nofficers.\\n  5. The board of supervisors by resolution may provide that a draft of\\na proposed county charter, or of an amendment or repeal thereof, shall\\nbe prepared under its supervision, the supervision of an officer or\\ncommittee of the board, or by a charter commission appointed by or\\npursuant to such resolution. The county attorney or other legal advisor\\nshall provide such assistance and cooperation as shall be required of\\nhim and for such purpose shall have power to employ or retain special\\ncounsel and technical advisors and assistants within appropriations made\\navailable therefor.\\n  6. Where a petition is filed with the clerk of the board of\\nsupervisors signed by electors of the county equal in number to at least\\nten per centum of the whole number of votes cast in the county for\\ngovernor at the last gubernatorial election, asking that a charter\\ncommission be created by the board of supervisors and be composed and\\nappointed as provided by the board of supervisors, and where the board\\nof supervisors does not on its own motion create and appoint or provide\\nfor the appointment of such a charter commission within three months\\nafter such filing, the board of supervisors shall cause a proposition to\\nbe submitted to the electors of the county at the next general election\\noccurring not less than five months after such filing, on the question\\nof whether such a charter commission should be so established and\\nappointed. The provisions of subdivision eight of this section shall\\napply to the preparation of the form of such proposition and its\\nsubmission at such general election. If such proposition receives a\\nmajority of the votes cast thereon in the county at such general\\nelection, the board of supervisors within two months after such general\\nelection shall provide for the creation of such commission and its\\nmembers shall be appointed within such two-month period. The provisions\\nof subdivision five hereof, so far as applicable, shall apply to such\\ncharter commission.\\n  7. A charter law\\n  (a) providing a county charter, or\\n  (b) proposing an amendment or repeal of one or more provisions thereof\\nwhich would have the effect of transferring a function or duty of the\\ncounty, or of a city, town, village, district or other unit of local\\ngovernment wholly contained in the county, shall conform to and be\\nsubject to consideration by the board of supervisors in accordance with\\nthe provisions of this chapter generally applicable to the form of and\\naction on proposed local laws by the board of supervisors. If a county\\ncharter, or a charter law as described in this subdivision, is adopted\\nby the board of supervisors, it shall not become operative unless and\\nuntil it is approved at a general election or at a special election,\\nheld in the county by receiving a majority of the total votes cast\\nthereon (a) in the area of the county outside of cities and (b) in the\\narea of the cities of the county, if any, considered as one unit, and if\\nit provides for the transfer of any function or duty to or from any\\nvillage or for the abolition of any office, department, agency or unit\\nof government of a village wholly contained in the county, it shall not\\ntake effect unless it shall also receive a majority of all the votes\\ncast thereon in all the villages so affected considered as one unit.\\nSuch a county charter or charter law shall provide for its submission to\\nthe electors of the county at the next general election or at a special\\nelection, occurring not less than sixty days after the adoption thereof\\nby the board of supervisors. Such a county charter or charter law may\\nprovide for the separate submission to the electors at such election of\\none or more variations of the provisions of such county charter. Any\\nsuch variation may include, but shall not be limited to, proposed\\ntransfers of functions of local government to other units of local\\ngovernment or a class or classes thereof.\\n  8. The form of each proposition submitted to the electors of a county\\npursuant hereto shall be prepared by the clerk of the board of\\nsupervisors with the advice of the county attorney or other principal\\nlegal advisor. They also shall prepare a brief abstract of the county\\ncharter or charter law so submitted. The form and abstract shall be\\ntransmitted to the board of elections of the county. The board of\\nelections, at least twenty days before the election, shall send two or\\nmore copies thereof to the clerk of each city, town and village in the\\ncounty to be made a public record in his office and shall cause a\\nsufficient number of copies to be printed and made available to the\\nelectors at the time of registration or otherwise. In addition, such\\nboard of elections shall cause a sufficient number of copies to be\\ndelivered with the other election supplies and distributed to the\\nelectors at the election. The board of elections shall cause each such\\nproposition to be submitted to the electors of the county in the manner\\nprovided in the election law and, so far as applicable, in subdivision\\ntwo of section one hundred two of the county law. Expenses incurred in\\nconnection with the submission of any proposition under this article\\nshall be a charge against the county.\\n  9. If two or more propositions having conflicting provisions receive\\nthe majorities required for adoption under this section at the same\\nelection, the proposition involved in each such conflict which receives\\nthe largest affirmative vote shall prevail to the extent of such\\nconflict; but in all other respects such proposition shall be deemed\\nadopted. Where a proposition submitted to the electors of a county under\\nthe provisions of this article receives the majority or majorities\\nrequired for adoption, it shall become operative as prescribed therein,\\nsubject to any conditions prescribed therein.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MHR",
                  "lawName" : "Municipal Home Rule",
                  "locationId" : "33-A",
                  "title" : "Transfer of functions or duties of local governments and districts",
                  "docType" : "SECTION",
                  "docLevelId" : "33-A",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 24,
                  "repealedDate" : null,
                  "fromSection" : "33-A",
                  "toSection" : "33-A",
                  "text" : "  § 33-a. Transfer of functions or duties of local governments and\\ndistricts. 1. Subject to restrictions in the constitution, in this\\narticle or in any other applicable law, the board of supervisors of any\\ncounty may, by local law, transfer functions or duties of the county or\\nof the cities, towns, villages, districts or other units of government\\nwholly contained in such county to each other, or for the abolition of\\none or more units of government, including but not limited to offices,\\ndepartments or agencies thereof, when the level and quality of ongoing\\nservices of all their functions or duties are transferred.\\n  2. Any such local law, or an amendment or repeal of one or more\\nprovisions thereof which would have the effect of transferring or\\nabolishing a function or duty of the county or of the cities, towns,\\nvillages, districts or other units of government wholly contained in the\\ncounty, shall not become operative unless and until it is approved at a\\ngeneral election or at a special election, held in the county by\\nreceiving a majority of the total votes cast thereon: (a) in the area of\\nthe county outside of cities and (b) in the area of cities of the\\ncounty, if any, considered as one unit, and if it provides for the\\ntransfer of any function or duty to or from any village or for the\\nabolition of any office, department, agency or unit of government of a\\nvillage wholly contained in the county, it shall not take effect unless\\nit shall also receive a majority of all the votes cast thereon in all\\nthe villages so affected considered as one unit. Such a local law,\\namendment or repeal thereof, shall provide for its submission to the\\nelectors of the county at the next general election or at a special\\nelection, occurring not less than sixty days after the adoption thereof\\nby the board of supervisors.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MHR",
                  "lawName" : "Municipal Home Rule",
                  "locationId" : "34",
                  "title" : "Limitations and restrictions",
                  "docType" : "SECTION",
                  "docLevelId" : "34",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 25,
                  "repealedDate" : null,
                  "fromSection" : "34",
                  "toSection" : "34",
                  "text" : "  § 34. Limitations and restrictions. 1. The legislature hereby imposes\\nthe following limitations on the powers of counties to prepare, adopt\\nand amend county charters and charter laws.\\n  2. Except in accordance with or consistent with laws enacted by the\\nlegislature, a county charter or charter law shall not contain\\nprovisions relating to:\\n  a. Taxation of the property of the state or of any of its agencies;\\n  b. Exemptions from taxation;\\n  c. Assistance by the state to any unit of local government;\\n  d. The division of the county into two or more counties or the\\ncreation, enlargement, diminution or abolition of any city, town,\\nvillage or school district;\\n  e. The compensation of members of the judiciary fixed by the\\nlegislature;\\n  f. The composition, functions, powers, duties or jurisdiction of a\\ncourt or of the officers thereof, except that functions, powers or\\nduties assigned to units of local government or agencies or officers\\nthereof outside the judicial system may be transferred to other units of\\nlocal government, agencies or officers as authorized by this article.\\n  3. Except in accordance with provisions of this chapter or with other\\nlaws enacted by the legislature, a county charter or charter law shall\\nnot supersede any general or special law enacted by the legislature:\\n  a. Which relates to the imposition, judicial review or distribution of\\nthe proceeds of taxes or benefit assessments;\\n  b. Insofar as it relates to the educational system in the county or to\\nschool districts therein, except that functions, powers or duties\\nassigned to units of local government or to agencies or officers thereof\\noutside the educational system may be transferred to other units of\\nlocal government, agencies or officers as authorized by this article;\\n  c. Which requires that specified functions of government be performed\\nby or financed by units of local government, except that any of such\\nfunctions may be transferred to other units of local government,\\nagencies or officers as authorized by this article;\\n  d. Insofar as it relates to a function, power or duty of the state or\\nof any officer or agency thereof which is financed directly by the\\nstate;\\n  e. Insofar as it relates to the commencement or prosecution of actions\\nor proceedings against the county;\\n  f. Insofar as it relates to a public benefit corporation;\\n  g. In this chapter or in the civil service law, eminent domain\\nprocedure law, environmental conservation law, election law, executive\\nlaw, judiciary law, labor law, local finance law, multiple dwelling law,\\nmultiple residence law, public authorities law, public housing law,\\npublic service law, railroad law, retirement and social security law,\\nstate finance law, volunteer firefighters' benefit law, volunteer\\nambulance workers' benefit law, or workers' compensation law.\\n  4. After the adoption of a county charter by a county, no law enacted\\nby the legislature pursuant to paragraph two of subdivision (h) of\\nsection one of article nine of the constitution which does not apply\\nalike to all counties outside the city of New York, and no charter law\\nor local law, which in its application to such county abolishes or\\ncreates an elective county office, changes the voting or veto power of\\nor the method of removing an elective county officer during his term of\\noffice, abolishes, curtails or transfers to another county officer or\\nagency any power of an elective county officer, or changes the form or\\ncomposition of the board of supervisors of such county, shall become\\neffective in such county until at least sixty days after its final\\nenactment. If (a) the legislature in enacting such a law shall provide\\nthat it shall be submitted to the qualified electors of the county for\\ntheir approval, or (b) the board of supervisors on its own motion, in\\nthe manner provided by subdivision four of section one hundred one of\\nthe county law, shall provide that such a charter law or local law\\nadopted by it shall be submitted to the qualified electors of the county\\nfor their approval, or (c) within such sixty days electors of the\\ncounty, duly registered to vote therein either for the last preceding or\\nthe next following general election, in number equal to at least five\\nper centum of the total number of votes cast in the county for governor\\nat the last gubernatorial election, shall file a petition with the\\ncounty clerk or corresponding officer of the county protesting against\\nsuch law, charter law or local law, it shall become effective in such\\ncounty only if approved by the electors thereof at the next ensuing\\ngeneral election held at least sixty days thereafter, subject to the\\nconditions provided in subdivision seven of section thirty-three of this\\nchapter for the adoption of a county charter when voted on by the\\nelectors of a county.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MHR",
                  "lawName" : "Municipal Home Rule",
                  "locationId" : "35",
                  "title" : "Legislative intent; construction",
                  "docType" : "SECTION",
                  "docLevelId" : "35",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 26,
                  "repealedDate" : null,
                  "fromSection" : "35",
                  "toSection" : "35",
                  "text" : "  § 35. Legislative intent; construction. 1. It is the intention of the\\nlegislature by this county charter law to provide for carrying into\\neffect the provisions of paragraph (h) of subdivision one of article\\nnine of the constitution and, pursuant to the direction contained\\ntherein, to empower counties to prepare, adopt and amend county charters\\nby local legislative action, subject to limitations imposed herein.\\n  2. It is not the intention of the legislature hereby to (a) abolish or\\ncurtail any powers or rights heretofore conferred upon or delegated to a\\ncounty or counties or to any of the units of government therein or to\\nany board, commission, body or officer thereof, or (b) adversely to\\naffect the power of a county to adopt, amend or repeal county charters,\\ncounty laws or local laws pursuant to any other authorization of the\\nlegislature, unless a contrary intention is clearly manifested from the\\nexpress provisions of this county charter law or by necessary intendment\\ntherefrom.\\n  3. This county charter law shall be construed liberally. The powers\\nherein granted shall be in addition to any other powers granted to\\ncounties by any other provisions of general or special laws, including\\nbut not limited to charters, administrative codes, special acts or local\\nlaws. A permissive procedure authorized hereby shall not be deemed to be\\nexclusive or to prohibit the use of any other procedure authorized by\\nany general or special act of the legislature, charter, administrative\\ncode or local law lawfully adopted and still in effect.\\n  4. All existing state, county, local and other laws or enactments,\\nincluding charters, administrative codes and special acts having the\\nforce of law shall continue in force until lawfully amended, modified,\\nsuperseded or repealed.\\n  5. If any provision of the county charter law is not clear or requires\\nelaboration in its application to the county, the board of supervisors\\nmay interpret such provision in a local law not inconsistent with the\\nprovisions hereof. Where any question arises concerning the transition\\nto a charter law which is not provided for herein, the board of\\nsupervisors may provide for such transition by a local law not\\ninconsistent with the provisions hereof.\\n  6. If any provision of this county charter law shall be adjudged by\\nany court of competent jurisdiction to be invalid, such judgment shall\\nnot affect, impair or invalidate the remainder thereof but shall be\\nconfined in its operation to the particular provision directly involved\\nin the controversy in which such judgment is rendered.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 7
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "A4P2",
              "title" : "City Charter Revision",
              "docType" : "PART",
              "docLevelId" : "2",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 27,
              "repealedDate" : null,
              "fromSection" : "36",
              "toSection" : "37",
              "text" : "                                 PART 2\\n                           CITY CHARTER REVISION\\nSection 36. Provisions  for  adoption  of  new  or  revised city charter\\n              proposed by a charter commission.\\n        37. Provisions for adoption of city charter  amendments  or  new\\n              city charters initiated by petition.\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MHR",
                  "lawName" : "Municipal Home Rule",
                  "locationId" : "36",
                  "title" : "Provisions for adoption of new or revised city charter proposed by a charter commission",
                  "docType" : "SECTION",
                  "docLevelId" : "36",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 28,
                  "repealedDate" : null,
                  "fromSection" : "36",
                  "toSection" : "36",
                  "text" : "  § 36. Provisions for adoption of new or revised city charter proposed\\nby a charter commission. 1. A local law providing a new or revised city\\ncharter also may be adopted in any city pursuant to the provisions of\\nthis section.\\n  2. The legislative body may adopt a local law providing for (a) the\\nestablishment of a commission to draft a new or revised city charter, or\\n(b) the submission to the electors of such city at a general or special\\nelection of the question: \"Shall there be a commission to draft a new or\\nrevised city charter as proposed by local law number . . . . . .  for\\nthe year . . . . . ?\" Such question may also specify the composition of\\nsuch commission as provided in such local law. Such election shall be\\nheld not less than sixty days after the adoption of such local law. Such\\nlocal law shall fix or provide the method of determining the number of\\nmembers of such commission and determine whether the members shall be\\nelected or appointed, or partly elected and partly appointed. It shall\\nalso prescribe the manner of appointment of appointive members, the\\nmanner of election of elective members and whether elective members\\nshall be elected by the city at large or by districts described in such\\nlocal law. In a case where a question is so submitted, the elective\\nmembers of the commission, if any, shall be elected at the election at\\nwhich the question is submitted. If the question be answered in the\\naffirmative by a majority vote of the qualified electors of such city\\nvoting thereon, the members of the charter commission, appointed or\\nelected thereto, shall be a charter commission of such city, except that\\nif at the same election more than one proposal for establishing a\\ncharter commission receives such approval only the proposal receiving\\nthe largest number of affirmative votes shall be deemed adopted.\\n  3. A local law for the creation of a commission to draft a new or\\nrevised city charter also may be adopted in the following manner:\\nQualified electors of a city, registered to vote therein at the last\\npreceding general election, in number equal to at least fifteen per\\ncentum of the total number of votes cast for governor at the last\\ngubernatorial election in such city, or forty-five thousand, whichever\\nis less, may file in the office of the city clerk a petition for the\\nsubmission to the electors of such city of a proposed local law for the\\ncreation of a commission to draft a new or revised city charter for such\\ncity and if such petition is found to meet all the requirements of law,\\nthe legislative body of the city shall submit such local law to the\\nelectors of such city at the next general election therein held not less\\nthan sixty days after the filing of such petition. Such proposed local\\nlaw shall fix or provide the method of determining the number of members\\nof such commission and shall provide for its composition. It may name\\nall or any of such members and may provide for the election or\\nappointment of all or any of them. It shall prescribe the manner of\\nappointment of appointive members and the time and manner of election of\\nelective members. It shall also determine whether elective members shall\\nbe elected from the city at large or by districts described in such\\nlocal law. Such petition shall conform to the provisions of section\\ntwenty-four in relation to petitions. It shall be examined and reported\\non by the city clerk as prescribed in such section, and objections\\nthereto shall be disposed of by the supreme court as prescribed by such\\nsection. The city clerk shall transmit such proposed local law in the\\nform in which it is to be submitted, which shall include the proposed\\ncomposition of such commission, to the election officers charged with\\nthe duty of publishing the notice of such election. If two or more such\\npetitions are filed providing for the submission of different proposed\\nlocal laws, the city clerk shall designate each such proposed local law\\nnumerically in the order of the time of the filing of the petitions. If\\nsuch a proposed local law receives the affirmative vote of a majority of\\nthe qualified electors of such city voting thereon, the members of the\\ncharter commission named in such local law, or elected or appointed as\\nprescribed therein, shall be the charter commission of such city, except\\nthat if at the same election more than one local law for establishing a\\ncharter commission receives the affirmative vote of a majority of the\\nqualified electors of such city voting thereon, only the one receiving\\nthe largest number of affirmative votes shall be deemed adopted and the\\nmembers of the charter commission named in such local law or elected or\\nappointed as prescribed therein, shall be the charter commission of such\\ncity.\\n  4. A charter commission to draft a new or revised city charter may\\nalso be created by the mayor of any city. Such commission shall consist\\nof not less than nine nor more than fifteen members, all of whom shall\\nbe residents of the city. Original appointments to such a commission\\nshall be made by the mayor by a certificate of appointment which shall\\nspecify the number of, and names of, the members to constitute the\\ncommission, which certificate shall be filed forthwith with the city\\nclerk. The chairman, vice-chairman and secretary shall be appointed by\\nthe mayor from among the members of the commission. Any vacancy in the\\nmembership of such a commission or of its officers shall be filled by\\nthe mayor.\\n  5. (a) The charter commission of a city created pursuant to this\\nsection shall review the entire charter of such city and prepare a draft\\nof a proposed new or revised charter of such city. If the commission\\nshall decide to leave a part of the existing charter unchanged, it may\\npropose in one or more amendments a revision of the remaining parts. In\\nsuch case it shall make a report to the public, accompanying its\\nproposals, in which it shall refer specifically to such unchanged part\\nand explain its decision to leave such part unchanged. The proposed\\ncharter or such amendments may contain such provisions or effect such\\nresults as may be made or effected by local law under the provisions of\\nthis chapter, and, subject to the provisions of paragraph (c) of\\nsubdivision four of section ten of this chapter, may contain any\\nprovisions of the existing charter of such city deemed necessary to make\\na complete charter of such city or appropriate amendments to the\\nexisting charter, with such changes in the headings and in the numbering\\nof the titles, articles, chapters, sections and subdivisions wherein\\nsuch provisions are found in the existing charter as may be deemed\\nappropriate to correlate and coordinate them with the other provisions\\nin the proposed new or revised charter and with such changes in the text\\nof such provisions as may be deemed desirable to clarify the meaning of\\nsuch provisions, and to vest in any of the officers of the city provided\\nfor in the proposed new or revised charter any power or authority\\ncontained in such provisions.\\n  (b) Such new charter or amendments shall be completed and filed in the\\noffice of the city clerk in time for submission to the electors not\\nlater than the second general election after the charter commission is\\ncreated and organized. The local law or certificate establishing the\\ncommission or, in the absence of such provision therein, the charter\\ncommission shall provide for such publication or other publicity in\\nrespect to the provisions of the proposed charter or amendments as it\\nmay deem proper, and for submission thereof to the electors of the city\\nat a general or special election held not earlier than sixty days after\\nthe filing thereof in the office of the city clerk and not later than\\nthe next general election which does not occur within the said sixty\\ndays, provided, however, that if such general election occurs within\\nninety days after the said filing, the proposed charter or amendments\\nshall be submitted at such general election. At such election, if a\\nproposed new charter is submitted as a single proposal, there shall be\\nsubmitted to the qualified electors of the city the question: \"Shall the\\nnew city charter proposed by the city charter commission be adopted ?\"\\nThe charter commission may, however, require that its proposed charter\\nbe submitted in two or more parts so arranged that corresponding parts\\nof the existing charter shall remain in effect if one or more of such\\nparts are not adopted, or may in lieu of a new charter submit a revision\\nof the existing charter in one or more amendments and may also submit\\nalternative charters or amendments or alternative provisions to\\nsupersede designated portions of a proposed charter or amendment if\\nadopted. In such case the charter commission shall prescribe the form of\\nthe questions to be submitted, which shall be such as clearly to\\nindicate the effect of their approval.\\n  (c) No provision for the election of any elective officers by any\\nsystem of proportional representation shall become effective under the\\nprovisions of this section unless a definite question with respect to\\nthe adoption of such system for the election of such officers shall have\\nbeen submitted as a separate question and separately approved at the\\nsame election by the affirmative vote of a majority of the qualified\\nelectors voting thereon.\\n  (d) If any question submitted by the charter commission receives the\\naffirmative vote of a majority of the qualified electors of the city\\nvoting thereon, the proposal submitted thereby shall take effect as\\nspecified therein and the new charter or the amendment or amendments to\\nthe existing charter as so proposed shall become operative as prescribed\\ntherein; except that if there be a conflict between the provisions of\\ntwo or more proposals approved by the electors at the same election, the\\nproposal receiving the largest number of affirmative votes shall prevail\\nto the extent of such conflict.\\n  (e) At any election at which any question or questions shall be\\nsubmitted to the qualified electors of the city by a charter commission\\npursuant to this section or within sixty days thereafter, no other\\nquestion or questions shall be submitted to or voted upon by such\\nelectors pursuant to any local law, ordinance, resolution or petition if\\nsuch commission was created pursuant to subdivision four of this\\nsection, and no such other question or questions shall be submitted\\nexcept by another charter commission if such commission was created\\notherwise, if such other question or questions involve or relate\\ndirectly or indirectly to the adoption of a new city charter, the\\namendment of a city charter, charter revision, the establishment of a\\ncommission to draft a new or revised city charter, or the functions,\\npowers or duties of any elective officer of the city, except as provided\\nin paragraph (g) of this subdivision.\\n  (f) While a charter commission is in existence under the provisions of\\nthis section, the local legislative body shall not submit to the\\nelectors any of the questions specified in subdivision (e) except at a\\ngeneral election.\\n  (g) If a proposed local law submitted pursuant to section thirty-seven\\nof this chapter would under the provisions of such section be submitted\\nat a general election at which a question or questions submitted by a\\ncharter commission are to be voted on, such local law shall not be\\nsubmitted at such election but shall be submitted at the general\\nelection in the year following regardless of other questions which may\\nbe voted on at the latter election and notwithstanding any inconsistent\\nprovision of this title.\\n  6. Any charter commission created under this section shall also be\\nsubject to the following provisions:\\n  (a) Members of the commission shall receive no compensation for their\\nservices, but shall be reimbursed for the actual and necessary expenses\\nincurred by them in the performance of their duties.\\n  (b) The commission shall appoint and may at pleasure remove such\\nemployees and consultants as it shall require and fix their compensation\\nand may accept any services, facilities or funds and use or expend the\\nsame for its purposes. On request of the commission, the mayor or, in a\\ncity having a city manager, the city manager may direct any board, body,\\nofficer or employee of the city to cooperate with, assist, advise,\\nprovide facilities, materials or data and render services to the\\ncommission.\\n  (c) In addition to action under any other power to make appropriations\\nfor the support of a charter commission, the appropriate officials of\\nthe city shall have power, on request of the commission, to appropriate\\nto such commission such sum or sums as shall be necessary to defray its\\nexpenses and, in the event the appropriating body or bodies do not take\\naffirmative action to provide such sum or sums within forty-five days of\\nthe commission's request, the mayor of the city shall have power to\\nauthorize, by certificate filed with the fiscal officer or officers of\\nthe city, the commission to incur liabilities and expenses as specified\\nby him, but within the sum or sums so requested, which shall be a charge\\nagainst the city and which shall be audited and paid by the appropriate\\nofficials of the city.\\n  (d) No person shall be disqualified to serve as a member, employee or\\nconsultant of the commission by reason of holding any other public\\noffice or employment, nor shall he forfeit any such office or employment\\nby reason of his appointment hereunder, notwithstanding the provisions\\nof any general, special or local law, ordinance or city charter.\\n  (e) The terms of office of the members of the commission shall expire\\non the day of the election at which the proposed new charter or charter\\namendments prepared by the commission are submitted to the qualified\\nelectors of the city, or on the day of the second general election\\nfollowing the organization of the commission if no such questions have\\nbeen submitted by that time.\\n  (f) The commission shall conduct public hearings. It shall conduct\\nsuch public hearings at such times and at such places within the city as\\nit shall deem necessary. The commission shall also have power to conduct\\nprivate hearings, take testimony, subpoena witnesses and require the\\nproduction of books, papers and records.\\n  (g) The provisions of the election law or any other law relating to\\nthe submission of questions at general elections, so far as the same are\\napplicable and not inconsistent herewith, shall apply to a question\\nsubmitted pursuant to the provisions of this section.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MHR",
                  "lawName" : "Municipal Home Rule",
                  "locationId" : "37",
                  "title" : "Provisions for adoption of city charter amendments or new city charters initiated by petition",
                  "docType" : "SECTION",
                  "docLevelId" : "37",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 29,
                  "repealedDate" : null,
                  "fromSection" : "37",
                  "toSection" : "37",
                  "text" : "  § 37. Provisions for adoption of city charter amendments or new city\\ncharters initiated by petition. 1. A local law amending a city charter\\n(however extensively) or providing a new city charter, also may be\\nadopted in accordance with the provisions of this section.\\n  2. Qualified electors of a city, in number equal to at least ten per\\ncentum of the total number of valid votes cast for governor in such city\\nat the last gubernatorial election, or to thirty thousand, whichever is\\nless, may file in the office of the city clerk a petition for the\\nsubmission to the electors of the city of such a proposed local law to\\nbe set forth in full in the petition. Qualified electors shall be deemed\\nfor this purpose to be voters of the city who were registered and\\nqualified to vote in such city at the last general election preceding\\nthe filing of the petition.\\n  3. Such local law shall set forth the new matter to be added to the\\ncharter either in italics or underlined and the matter to be deleted\\ntherefrom either in brackets or with lines drawn through it, and after\\nadoption the matter so set forth in italics or underlined may be set\\nforth in the charter in ordinary type, and the matter in brackets or\\nwith lines through it may be omitted; but failure so to set forth any\\nprovision of the charter which is in fact superseded shall not\\ninvalidate the amendment or new charter or any portion thereof.\\n  4. Such a local law may amend, repeal or supersede any local law\\ninconsistent with the charter amendment or new charter proposed thereby\\nor any inconsistent provision of a state statute which may be amended by\\nlocal law, in which event it shall specify the chapter number and year\\nof enactment, sections, subsections or other parts of each statute or\\nlocal law so affected. Such a local law also may contain provisions as\\ndescribed in paragraph (a) of subdivision four of section thirty-six of\\nthis chapter.\\n  5. Such petition shall conform to the provisions of section\\ntwenty-four of this chapter in relation to petitions. It shall be\\nexamined and reported on by the city clerk as prescribed therein, and\\nobjections thereto shall be disposed of by the supreme court as\\nprescribed by such section. In addition, the city clerk, at the same\\ntime that he transmits to the legislative body his certificate that the\\npetition complies or does not comply with all the requirements of law,\\nshall transmit a copy of such certificate to the person by whom the\\npetition was filed and, if he certifies that the petition does not\\ncomply with all the requirements, shall state in such certificate\\nspecifically in what respects it fails to comply. If he shall certify\\nthat there is an insufficient number of valid signatures, he shall make\\navailable to the legislative body a statement as to the number of\\nsignatures found to be invalid and the reasons for such invalidity, and\\nshall make the same information available to the person by whom the\\npetition was filed and make it, together with the petition and his\\nnotations of rulings thereon or relative thereto, a matter of public\\nrecord in his office. A finding by the city clerk that a petition does\\nnot comply with all the requirements of law may be contested in a\\nproceeding in the supreme court.\\n  6. Whether or not he finds the petition sufficient, the city clerk\\nshall transmit such proposed local law forthwith to the legislative\\nbody. If the proposed local law is such that a mandatory referendum is\\nnot required for its adoption under the provisions of this chapter or of\\nthe city charter, such legislative body may adopt it as its own act\\npursuant to article three of this chapter. If a mandatory referendum is\\nrequired, the legislative body may submit it to the electors of the city\\nat the next general election occurring at least sixty days after the\\nlegislative body votes to submit it.\\n  7. If, however, such a petition meets all the requirements of law and\\nduring a period of two months immediately following the filing thereof\\nsuch legislative body shall fail so to adopt such local law without\\nchange or to submit it without change to the electors of the city as\\naforesaid, an additional petition filed with the city clerk at least two\\nmonths and not more than four months after the filing of the original\\npetition and signed at any time prior to its filing by qualified\\nelectors who did not sign the original petition, equal in number to at\\nleast five per centum of the total number of votes cast for governor in\\nsuch city at the last gubernatorial election, or to fifteen thousand,\\nwhichever is less, may require the submission of the local law at the\\nnext general election held not less than sixty days after the filing of\\nsuch additional petition.\\n  8. Such an additional petition shall conform to the requirements of\\nsubdivision five for an original petition and shall be dealt with by the\\ncity clerk and by the supreme court in the same manner as an original\\npetition except that the city clerk shall submit his certificate as to\\nits sufficiency within twenty days after it is filed with him.\\n  9. When so required by the filing of such an additional petition\\ncomplying with all the requirements of law, the city clerk shall\\ntransmit such proposed local law in the form in which it is to be\\nsubmitted to the election officers charged with the duty of publishing\\nthe notice of such election, and the legislative body shall provide for\\nsuitable publication thereof and publicity thereon for the information\\nof interested voters. If there be more than one such proposed local law\\nto be voted upon at such election, each such proposed local law shall be\\nseparately and consecutively numbered.\\n  10. Any political committee organized for the purpose of supporting or\\nopposing any charter amendment or new charter submitted to the voters\\nunder the provisions of this section shall have the same rights as a\\npolitical party to name watchers and challengers to serve at the\\nelection at which the question is submitted.\\n  11. No such petition for a proposed local law requiring the\\nexpenditure of money shall be certified as sufficient by the city clerk\\nor become effective for the purposes of this section unless there shall\\nbe submitted, as a part of such proposed local law, a plan to provide\\nmoneys and revenues sufficient to meet such proposed expenditures.  This\\nrestriction shall not prevent the submission of a local law to adopt a\\nnew charter or to reorganize the functions of city government, or a part\\nthereof, relying partly or solely on normal budgetary procedures to\\nprovide the necessary moneys to meet the expenses of city government\\nunder such reorganization, whether or not such reorganization includes\\nthe creation of new offices, provided only that such reorganization\\nshall not require specific salaries or the expenditure of specific sums\\nof money not theretofore required.\\n  12. No charter amendment or new charter submitted under the provisions\\nof this section which requires the expenditure of money shall become\\neffective with respect to such expenditure before the beginning of the\\nfirst fiscal year for which a city budget is prepared and adopted after\\nthe adoption of the amendment or new charter.\\n  13. If any such proposed local law receives the affirmative vote of a\\nmajority of the qualified electors of such city voting thereon, it shall\\nbecome operative as prescribed therein, except that in case of conflict\\nbetween provisions of two or more local laws adopted at the same\\nelection the local law receiving the largest number of affirmative votes\\nshall prevail to the extent of such conflict.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 2
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "A4P3",
              "title" : "State Assistance--county--city",
              "docType" : "PART",
              "docLevelId" : "3",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 30,
              "repealedDate" : null,
              "fromSection" : "38",
              "toSection" : "38",
              "text" : "                                 PART 3\\n                     STATE ASSISTANCE--COUNTY--CITY\\nSection 38. Provisions  for obtaining state reimbursement for county and\\n              city charter creation and revision.\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MHR",
                  "lawName" : "Municipal Home Rule",
                  "locationId" : "38",
                  "title" : "Provisions for obtaining state reimbursement for county and city charter creation and revision",
                  "docType" : "SECTION",
                  "docLevelId" : "38",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 31,
                  "repealedDate" : null,
                  "fromSection" : "38",
                  "toSection" : "38",
                  "text" : "  § 38. Provisions for obtaining state reimbursement for county and city\\ncharter creation and revision.\\n  1. Legislative Findings and Purpose. The Legislature finds that\\ndevelopment of modernized county and city government is necessary and\\ndesirable to effectuate state purposes in as much as said governments\\nare called upon to implement state programs to provide for the health\\nand welfare of the citizens of the state, and in many cases are the\\nrecipients of substantial state assistance. In order to encourage and\\npromote the development and revision of charter government at both the\\ncounty and city level as is provided under this article so that county\\nand city government will be more efficient, more effective and more\\nresponsive to the needs of the people, state financial aid shall be\\ngranted to counties and cities, to particularly reimburse authorized\\ncharter expenditures in the manner and subject to the conditions\\nprescribed in this section.\\n  2. Granting authority. The office for local government, by and through\\nits commissioner or his duly authorized officers and employees, shall\\nadminister, carry out and approve grants of state funds, within\\nappropriation therefore, for reimbursement of authorized charter\\nexpenditures as defined herein, that are conducted by counties or\\ncities. The office for local government shall adopt, amend and rescind\\nsuch rules, regulations and guidelines as may be necessary to the\\nperformance of its functions, powers and duties under this section. The\\noffice for local government shall allocate grants under this article\\namong the municipalities that have submitted applications in such a\\nmanner as will most nearly provide an equitable distribution of the\\ngrants among municipalities, taking into consideration such factors as\\nthe size of the population, the urgency of the charter studies, the need\\nfor funds to carry out the purposes of this article, and the potential\\nof the municipalities concerned to use the funds most effectively.\\n  3. Authorized charter expenditures. For the purpose of this section\\n\"authorized charter expenditures\" shall mean those expenditures paid in\\nthe first instance by a county or city in the preparation of a proposed\\ncharter law or a proposed local law providing for new or revised city\\ncharter which has been adopted by the governing body of a county or\\ncity, as the case may be, for submission to the electorate at a general\\nor special election as is provided in Section thirty-three and Section\\nthirty-six of this article, and which costs are further deemed necessary\\nand appropriate under regulations promulgated by the office for local\\ngovernment for the creation and development of the proposed charter law.\\nNo expenditure which has not been specifically designated by the local\\ngoverning body for charter study and approved by the office for local\\ngovernment shall be considered an \"authorized charter expenditure.\"\\n  4. Reimbursement limitations. State reimbursement shall be granted\\nunder this section for authorized charter expenditures as follows:\\n  (a) Up to forty per centum of the cost of authorized charter\\nexpenditures up to a limit of twenty-five thousand dollars in any one\\nstate fiscal year for any county or city.\\n  (b) No county or city shall be eligible for reimbursement of an\\nauthorized charter expenditure for a period of ten years following\\nreceipt of a reimbursement under this section.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 1
              },
              "repealed" : false
            } ],
            "size" : 3
          },
          "repealed" : false
        }, {
          "lawId" : "MHR",
          "lawName" : "Municipal Home Rule",
          "locationId" : "A5",
          "title" : "Requests of Local Governments For Enactment of Special Laws Relating to Their Property, Affairs or Government",
          "docType" : "ARTICLE",
          "docLevelId" : "5",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 32,
          "repealedDate" : null,
          "fromSection" : "40",
          "toSection" : "40",
          "text" : "                                ARTICLE 5\\n          REQUESTS OF LOCAL GOVERNMENTS FOR ENACTMENT OF SPECIAL\\n         LAWS RELATING TO THEIR PROPERTY, AFFAIRS OR GOVERNMENT\\nSection 40. Requests  of local governments for enactment of special laws\\n              relating to their property, affairs or government.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "40",
              "title" : "Requests of local governments for enactment of special laws relating to their property, affairs or government",
              "docType" : "SECTION",
              "docLevelId" : "40",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 33,
              "repealedDate" : null,
              "fromSection" : "40",
              "toSection" : "40",
              "text" : "  § 40. Requests of local governments for enactment of special laws\\nrelating to their property, affairs or government. The elective or\\nappointive chief executive officer, if there be one, or otherwise the\\nchairman of the board of supervisors, in the case of a county, the mayor\\nin the case of a city or village or the supervisor in the case of a town\\nwith the concurrence of the legislative body of such local government,\\nor the legislative body by a vote of two-thirds of its total voting\\npower without the approval of such officer, may request the legislature\\nto pass a specific bill relating to the property, affairs or government\\nof such local government which does not in terms and in effect apply\\nalike to all counties, all counties other than those wholly included\\nwithin a city, all cities, all towns or all villages, as the case may\\nbe. Such a request may be made separately by two or more local\\ngovernments affected by the same bill. Every such request shall declare\\nthat a necessity exists for the passage of such bill by the legislature\\nand shall recite the facts establishing such necessity. The form of\\nrequest and the manner of its communication to the legislature shall\\nconform to rules promulgated by concurrent resolution of the senate and\\nassembly pursuant to article three-A of the legislative law. In adopting\\nsuch a request the legislative body shall be governed by the provisions\\nof subdivision one of section twenty of this chapter with regard to the\\nadoption of a local law. The validity of an act passed by the\\nlegislature in accordance with such a request shall not be subject to\\nreview by the courts on the ground that the necessity alleged in the\\nrequest did not exist or was not properly established by the facts\\nrecited.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            } ],
            "size" : 1
          },
          "repealed" : false
        }, {
          "lawId" : "MHR",
          "lawName" : "Municipal Home Rule",
          "locationId" : "A6",
          "title" : "Legislative Intent; Construction; Effective Date",
          "docType" : "ARTICLE",
          "docLevelId" : "6",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 34,
          "repealedDate" : null,
          "fromSection" : "50",
          "toSection" : "59",
          "text" : "                                ARTICLE 6\\n             LEGISLATIVE INTENT; CONSTRUCTION; EFFECTIVE DATE\\nSection 50. Legislative intent.\\n        51. Liberal construction.\\n        52. Judicial notice.\\n        53. No repeal by implication.\\n        54. Grants of specific powers not restrictive.\\n        55. Effect of unconstitutionality in part.\\n        56. Existing charters and other laws continued.\\n        57. Effectiveness of certain acts of the legislature.\\n        58. Laws repealed.\\n        59. Time of taking effect.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "50",
              "title" : "Legislative intent",
              "docType" : "SECTION",
              "docLevelId" : "50",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 35,
              "repealedDate" : null,
              "fromSection" : "50",
              "toSection" : "50",
              "text" : "  § 50. Legislative intent. 1. It is the intention of the legislature by\\nthis chapter to provide for carrying into effect provisions of article\\nnine of the constitution and the statute of local governments and to\\nenable local governments to adopt and amend local laws for the purpose\\nof fully and completely exercising the powers granted to them under the\\nterms and spirit of such article.\\n  2. There is hereby reserved to the board of supervisors of every\\ncounty not wholly included in a city, the board of aldermen, common\\ncouncil, council, commission or other board or body of every city, the\\ntown board of every town and the board of trustees of every village all\\nthe rights, privileges, powers and jurisdiction now conferred on it by\\nlaw until such rights, privileges, powers or jurisdiction shall be\\nabolished, transferred or changed by law.\\n  3. It is not the intention of the legislature hereby to abolish or\\ncurtail any rights, privileges, powers or jurisdiction heretofore\\nconferred upon or delegated to any local government or to any board,\\nbody or officer thereof, unless a contrary intention is clearly manifest\\nfrom the express provisions of this chapter or by necessary intendment\\ntherefrom, or to restrict the powers of the legislature to pass laws\\nregulating matters other than the property, affairs or government of\\nlocal governments as distinguished from matters relating to their\\nproperty, affairs or government.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "51",
              "title" : "Liberal construction",
              "docType" : "SECTION",
              "docLevelId" : "51",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 36,
              "repealedDate" : null,
              "fromSection" : "51",
              "toSection" : "51",
              "text" : "  § 51. Liberal construction. This chapter shall be liberally construed.\\nThe powers herein granted shall be in addition to all other powers\\ngranted to local governments by other provisions of law. A permissive\\nprocedure authorized by this chapter shall not be deemed to be exclusive\\nor to prohibit the use of any other procedure authorized by any state\\nstatute, charter or local law lawfully adopted, but shall be deemed an\\nalternative thereto.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "52",
              "title" : "Judicial notice",
              "docType" : "SECTION",
              "docLevelId" : "52",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 37,
              "repealedDate" : null,
              "fromSection" : "52",
              "toSection" : "52",
              "text" : "  § 52. Judicial notice. Courts shall take judicial notice of all local\\nlaws and of rules and regulations adopted pursuant thereto.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "53",
              "title" : "No repeal by implication",
              "docType" : "SECTION",
              "docLevelId" : "53",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 38,
              "repealedDate" : null,
              "fromSection" : "53",
              "toSection" : "53",
              "text" : "  § 53. No repeal by implication. It is not intended by this chapter to\\nrepeal by implication any existing provision of law and no law shall be\\ndeemed repealed thereby unless expressly provided for therein.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "54",
              "title" : "Grants of specific powers not restrictive",
              "docType" : "SECTION",
              "docLevelId" : "54",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 39,
              "repealedDate" : null,
              "fromSection" : "54",
              "toSection" : "54",
              "text" : "  § 54. Grants of specific powers not restrictive. A grant of a specific\\npower by this chapter to one or more local governments shall not operate\\nto restrict the meaning of a general grant of power by this chapter to\\nthe same or any other local government or to exclude other powers\\ncomprehended in such general grant.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "55",
              "title" : "Effect of unconstitutionality in part",
              "docType" : "SECTION",
              "docLevelId" : "55",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 40,
              "repealedDate" : null,
              "fromSection" : "55",
              "toSection" : "55",
              "text" : "  § 55. Effect of unconstitutionality in part. If any clause, sentence,\\nparagraph, section or part of this chapter shall be adjudged by any\\ncourt of competent jurisdiction to be invalid, such judgment shall not\\naffect, impair or invalidate the remainder thereof, but shall be\\nconfined in its operation to the clause, sentence, paragraph, section,\\nor part thereof directly involved in the controversy in which such\\njudgment shall have been rendered.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "56",
              "title" : "Existing charters and other laws continued",
              "docType" : "SECTION",
              "docLevelId" : "56",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 41,
              "repealedDate" : null,
              "fromSection" : "56",
              "toSection" : "56",
              "text" : "  § 56. Existing charters and other laws continued. 1. All existing\\nvalid provisions of laws, charters and local laws not specifically\\nrepealed by this chapter shall continue in force until lawfully\\nrepealed, amended, modified or superseded.\\n  2. A reference in any law, ordinance, resolution, rule, regulation or\\ndocument to any provision of the city home rule law, village home rule\\nlaw, article six or article six-a of the county law, or sections\\nfifty-one-a through fifty-one-f of the town law, repealed by this\\nchapter, in force at the time this chapter takes effect, shall be deemed\\nand construed to refer to the corresponding provision or provisions of\\nthe municipal home rule law as continued, modified or amended by this\\nchapter.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "57",
              "title" : "Effectiveness of certain acts of the legislature",
              "docType" : "SECTION",
              "docLevelId" : "57",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 42,
              "repealedDate" : null,
              "fromSection" : "57",
              "toSection" : "57",
              "text" : "  § 57. Effectiveness of certain acts of the legislature. 1. A state\\nstatute of the year nineteen hundred sixty-three which, in form, amends\\nor repeals or purports to amend or repeal any provision or provisions of\\nthe city home rule law, village home rule law, article six or article\\nsix-a of the county law or sections fifty-one-a through fifty-one-f of\\nthe town law, as in force immediately prior to January first, nineteen\\nhundred sixty-four, shall be deemed and construed as an amendment or\\nrepeal, in whole or in part, as the case may be, of the corresponding\\nprovision or provisions of such law, article or sections, as contained\\nin this chapter.\\n  2. A state statute of the year nineteen hundred sixty-three which\\nadds, or purports to add a new section, subdivision or other provision\\nof law to the city home rule law, village home rule law, article six or\\narticle six-a of the county law or sections fifty-one-a through\\nfifty-one-f of the town law, as in force immediately prior to January\\nfirst, nineteen hundred sixty-four, shall be deemed and construed as\\nhaving been added to this chapter and shall be given full effect\\naccording to its context as if the same had been added expressly and in\\nterms to this chapter and shall be deemed and construed to have been\\ninserted in this chapter in the appropriate position in regard to and as\\nmodifying the effect of the corresponding provision or provisions of\\nthis chapter.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "58",
              "title" : "Laws repealed",
              "docType" : "SECTION",
              "docLevelId" : "58",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 43,
              "repealedDate" : null,
              "fromSection" : "58",
              "toSection" : "58",
              "text" : "  § 58. Laws repealed. Of the laws enumerated in the schedule hereto\\nannexed, that portion specified in the last column is hereby repealed.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MHR",
              "lawName" : "Municipal Home Rule",
              "locationId" : "59",
              "title" : "Time of taking effect",
              "docType" : "SECTION",
              "docLevelId" : "59",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 44,
              "repealedDate" : null,
              "fromSection" : "59",
              "toSection" : "59",
              "text" : "  § 59. Time of taking effect. This chapter shall take effect January\\nfirst, nineteen hundred sixty-four, in the event that the amendment of\\nthe constitution of the state of New York proposing a new article nine,\\nin relation to a bill of rights and home rule powers for local\\ngovernments, shall have been approved and ratified by the people at the\\ngeneral election to be held in the year nineteen hundred sixty-three.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            } ],
            "size" : 10
          },
          "repealed" : false
        } ],
        "size" : 6
      },
      "repealed" : false
    }
  }
}