{
  "success" : true,
  "message" : "The document structure for MRE law",
  "responseType" : "law-tree",
  "result" : {
    "lawVersion" : {
      "lawId" : "MRE",
      "activeDate" : "2019-11-08"
    },
    "info" : {
      "lawId" : "MRE",
      "name" : "Multiple Residence",
      "lawType" : "CONSOLIDATED",
      "chapter" : "61-B"
    },
    "publishedDates" : [ "2014-09-22", "2019-01-11", "2019-11-08" ],
    "documents" : {
      "lawId" : "MRE",
      "lawName" : "Multiple Residence",
      "locationId" : "-CH61-B",
      "title" : "Multiple Residence",
      "docType" : "CHAPTER",
      "docLevelId" : "61-B",
      "activeDate" : "2014-09-22",
      "sequenceNo" : 1,
      "repealedDate" : null,
      "fromSection" : "1",
      "toSection" : "330",
      "text" : "                               CHAPTER 801\\nAN ACT to amend the multiple residence law, generally; and to repeal\\n       section two hundred five of the general business law, relating to\\n       fire-escape ropes in hotel rooms\\n       Became a law April 17, 1952, with the approval of the Governor.\\n       Passed, by a majority vote, three-fifths being present\\n  The People of the State of New York, represented in Senate and\\nAssembly, do enact as follows:\\n  Section 1. The multiple residence law is hereby amended to read as\\nfollows:\\n              CHAPTER SIXTY-ONE-B OF THE CONSOLIDATED LAWS\\n                         MULTIPLE RESIDENCE LAW\\nArticle 1. Introductory provisions; definitions (Secs. 1--4).\\n        2. Miscellaneous application provisions (Secs. 8--15).\\n        3. Old multiple dwellings (Secs. 25--43).\\n        4. Hotels and similar dwellings (Secs. 50--72).\\n        5. New multiple dwellings-general provisions (Secs.  100--174).\\n        6. Fireproof new multiple dwellings (Secs. 200--215).\\n        7. Non-fireproof new multiple dwellings (Secs. 250--280).\\n        8. Requirements and remedies (Secs. 300--307).\\n        9. Review; rules; saving clauses; effective date (Secs.\\n             325--330).\\n",
      "documents" : {
        "items" : [ {
          "lawId" : "MRE",
          "lawName" : "Multiple Residence",
          "locationId" : "A1",
          "title" : "Introductory Provisions; Definitions",
          "docType" : "ARTICLE",
          "docLevelId" : "1",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 2,
          "repealedDate" : null,
          "fromSection" : "1",
          "toSection" : "4",
          "text" : "                                ARTICLE 1\\n                  INTRODUCTORY PROVISIONS; DEFINITIONS\\nSection 1. Short title.\\n        2. Legislative finding.\\n        3. Application to certain municipalities.\\n        4. Definitions.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "1",
              "title" : "Short title",
              "docType" : "SECTION",
              "docLevelId" : "1",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 3,
              "repealedDate" : null,
              "fromSection" : "1",
              "toSection" : "1",
              "text" : "  Section 1. Short title. This chapter shall be known as the \"multiple\\nresidence law.\"\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "2",
              "title" : "Legislative finding",
              "docType" : "SECTION",
              "docLevelId" : "2",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 4,
              "repealedDate" : null,
              "fromSection" : "2",
              "toSection" : "2",
              "text" : "  § 2. Legislative finding.  It is hereby declared that intensive\\noccupation of multiple dwellings having three or more families,\\ninadequate provision for light and air, insufficient protection against\\nand defective provisions for escape from fire, as well as the amount of\\nimproper sanitation existing in multiple dwellings throughout this state\\nare a menace to the health, safety, morals, welfare, and reasonable\\ncomfort of its citizens; and that the establishment and maintenance of\\nproper housing standards requiring sufficient light, air, sanitation and\\nprotection from fire hazards are essential to the public welfare.\\nTherefore the provisions hereinafter prescribed to provide more adequate\\nprotection in the event of fire, and sufficient light, ventilation and\\nsanitation for certain multiple residence buildings are enacted and\\ntheir necessity in the public interest is hereby declared as a matter of\\nlegislative determination.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "3",
              "title" : "Application to certain municipalities",
              "docType" : "SECTION",
              "docLevelId" : "3",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 5,
              "repealedDate" : null,
              "fromSection" : "3",
              "toSection" : "3",
              "text" : "  § 3. Application to certain municipalities. 1. This chapter shall\\napply to all cities of less than three hundred twenty-five thousand\\npopulation and to all towns and villages.\\n  2. Whenever the word \"municipality\" occurs in this chapter, it shall\\nmean a city, town or village to which the chapter is applicable.  The\\nwords \"charter,\" \"ordinance,\" \"resolution,\" \"regulation,\" \"building\\ncode,\" \"department of health,\" \"department of water supply,\" \"fire\\ndepartment,\" \"department,\" \"board,\" \"municipal engineer,\" \"building\\nofficial,\" \"corporation counsel,\" \"municipal treasury,\" or \"fire\\nlimits,\" shall be construed as if followed by the words \"or\\ncorresponding authority of any municipality in which the dwelling or\\nlocation referred to is situated.\"\\n  3. Wherever in this chapter the installation or maintenance of a fire\\nalarm system, fire detecting system, watchman's clock system, sprinkler\\nsystem, fire-escape system or part thereof is required or permitted,\\nsuch system or part thereof shall be constructed, installed, arranged\\nand maintained in a manner satisfactory to the department in accordance\\nwith rules and regulations adopted by the commission pursuant to section\\nthree hundred twenty-six of this chapter.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "4",
              "title" : "Definitions",
              "docType" : "SECTION",
              "docLevelId" : "4",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 6,
              "repealedDate" : null,
              "fromSection" : "4",
              "toSection" : "4",
              "text" : "  § 4. Definitions. Words and terms used in this chapter shall have the\\nfollowing meanings:\\n  1. \"Alteration.\" Any change in the structural parts or existing\\nfacilities of any building or the moving of any building from one\\nlocation or position to another.\\n  2. \"Apartment,\" or \"suite.\" That portion of a dwelling consisting of\\none or more living rooms, and occupied by the members of a family, which\\ngroup of rooms is separated from all other groups within a dwelling.\\n  3. \"Basement.\" A story partly below the curb level but having at least\\none-half of its height above the curb level. A basement shall be counted\\nas a story in determining height, except as otherwise provided in this\\nchapter.\\n  4. \"Boarding house,\" \"furnished room house,\" \"rooming house,\" or\\n\"tourist house.\" A multiple dwelling, in which there are less than\\nthirty sleeping rooms occupied primarily by transients who are lodged\\nwith or without meals, and in which there are provided such services as\\nare incidental to its use as a temporary residence. Also a dwelling two\\nor more stories in height, occupied by one or two families and with five\\nor more transient boarders, roomers or lodgers residing with any one\\nfamily.\\n  5. \"Cellar.\" An enclosed space in a dwelling having more than one-half\\nof its height below the curb level. However, where a dwelling is set\\nback from the curb level in such a manner that the enclosed space in the\\ndwelling is above the curb level but at least one-half of its height is\\nbelow the land immediately adjacent to the dwelling, such space shall be\\ndeemed a cellar. A cellar shall not be counted as a story.\\n  5-a. \"Child caring institutions.\" Institutions for the residential\\ncare of children operated by authorized agencies as defined by the\\nsocial welfare law.\\n  6. \"Commission.\" The state building code commission in the executive\\ndepartment of the state of New York.\\n  7. \"Converted or conversion.\" A change from non-dwelling or private\\ndwelling use to multiple dwelling occupancy after July first, nineteen\\nhundred fifty-two.\\n  8. \"Court.\" A space, other than a yard, on the same lot as a dwelling\\nand open to the sky. \"Inner court.\" A court not extending to a street or\\nyard. \"Outer court.\" A court extending to a street or yard.\\n  9. \"Curb level.\" The level of the curb at the center of the front of\\nthe building, for the purpose of measuring the height of any portion of\\na building; except that where a building faces on more than one street,\\nthe curb level is the average of the levels of the curbs at the center\\nof each front. Where no curb elevation has been established the mean\\nlevel of the land immediately adjacent to the dwelling shall be\\nconsidered the curb level, unless the municipal engineer shall establish\\nsuch curb level or its equivalent.\\n  10. \"Department.\" The department, bureau, division, agency or person\\ncharged with the enforcement of this chapter.\\n  11. \"Dining bay,\" \"dining recess\" or \"dinette.\" A recess used for\\ndining purposes off a living room, foyer or kitchen.\\n  12. \"Dormitory.\" Any room occupied for sleeping purposes by five or\\nmore persons. A \"cubicle\" is a small, partially enclosed sleeping space\\nwithin a dormitory, with or without a window.\\n  13. \"Dwelling.\" A building or structure which is occupied in whole or\\nin part as the home, residence or sleeping place of one or more persons.\\n  14. \"Family.\" One or more persons with whom there may be not more than\\nfour boarders, roomers or lodgers all living together in a common\\nhousehold. A boarder, roomer or lodger residing within the family\\nhousehold is a person who pays a consideration therefor and such\\nresidence is not an incident of employment therein.\\n  15. \"Fire alarm system.\" An approved system of sounding a fire alarm\\nor alarms installed in such a manner that it can be operated manually\\nfrom any story.\\n  \"Fire-detecting system.\" An approved system which automatically\\ndetects a fire or an abnormal rise in temperature and actuates a fire\\nalarm.\\n  16. \"Fire-escape.\" A combination of outside balconies and stairs of\\nincombustible materials, providing an unobstructed means of egress from\\na building.\\n  17. \"Fireproof.\" Made of incombustible materials with standard\\nfire-resistive ratings not less than those required for a fireproof\\nmultiple dwelling.\\n  18. \"Fireproof multiple dwelling.\" One in which the walls and other\\nstructural members are of incombustible materials or assemblies meeting\\nall of the requirements of the local building code for fireproof\\nconstruction, if any, and if there be none, then of the state building\\nconstruction code for fireproof construction applicable to multiple\\ndwellings.\\n  19. \"Fire-retarded.\" Covered with metal lath plastered with two or\\nmore coats of cement or gypsum plaster or otherwise protected against\\nfire with materials of standard fire-resistive ratings of at least one\\nhour. Fireproof or fire-resistive material shall always be accepted as\\nmeeting any requirement for fire-retarding.\\n  20. \"Fire-resistive.\" Covered or protected with incombustible\\nmaterials of standard fire-resistive ratings of at least one hour.\\nFireproofing or fire-retarding shall always be accepted as meeting any\\nrequirement for \"fire-resistive\" materials.\\n  21. \"Fire-stair.\" A fireproof stair, enclosed in fireproof walls,\\nwithin the body of the building which it serves, to which access may be\\nhad only through self-closing fireproof doors.\\n  22. \"Fire-stopping.\" The closing of concealed draft openings with\\nbrick or other incombustible materials to form an effectual fire barrier\\nbetween stories, and between the ceiling of the upper story and the\\nspace under the roof.\\n  23. \"Foyer.\" A space within an apartment or suite used as an entrance\\nhall directly from a public hall.\\n  24. \"Frame dwellings.\" A non-fireproof dwelling of which any\\nstructural member of its exterior walls is of wood. A structural member\\nshall not be deemed to include the veneer or facing of any such wall.\\n  25. \"Height.\" The vertical distance of a dwelling from the curb level\\nto the level of the highest point of the roof beams, except that in the\\ncase of pitched roofs, it is the vertical distance from the curb level\\nto the mean height level of the gable or roof above the vertical street\\nwall. An attic not used or arranged to be used for human occupancy shall\\nnot be considered in measuring the height of a dwelling.\\n  26. \"Hotel.\" A dwelling in which there are thirty or more sleeping\\nrooms in one building or structure occupied primarily by transients who\\nare lodged with or without meals; and there are provided such services\\nas are incidental to the use thereof as a temporary residence.\\n  27. \"Kitchen.\" A space, fifty-nine square feet or more in floor area,\\nused for cooking or warming of food.\\n  28. \"Kitchenette.\" A space, less than fifty-nine square feet in floor\\narea, used for cooking or warming of food.\\n  29. \"Living room.\" Any room in a multiple dwelling except:\\n  a. A public hall, public vestibule, public room or other public part\\nof a dwelling;\\n  b. A hall, corridor or passageway entirely within an apartment or\\nsuite;\\n  c. A foyer, the floor area of which does not exceed ten percentum of\\nthe total floor area of the apartment or suite;\\n  d. A kitchenette;\\n  e. A dining bay, dining recess or dinette fifty-five square feet or\\nless in area;\\n  f. A bathroom or water-closet compartment.\\n  30. \"Local building code.\" The building code, if any, adopted or\\nenacted by a city, town or village and which is in force in such city,\\ntown or village, or in such town or portion thereof outside the limits\\nof any village or city, respectively, or the state building construction\\ncode where applicable with respect thereto.\\n  31. \"Lodging house.\" A dwelling, other than a hotel, in which persons\\nare housed in a dormitory or dormitories, whether or not the space for\\nsleeping accommodations therein is divided into cubicles, for a single\\nnight or for less than a week at one time.\\n  32. \"Lot.\" A parcel or plot of ground which is or may be occupied\\nwholly or in part by a dwelling, including the spaces occupied by\\naccessory or other structures and any open or unoccupied spaces thereon,\\nbut not including any part of an abutting public street or thoroughfare.\\n  a. \"Corner lot.\" A lot of which at least two adjacent sides abut for\\ntheir full length upon streets or public places not less than forty feet\\nin width. Any other lot is an \"interior lot.\" That portion of a corner\\nlot in excess of one hundred feet from the widest street on which the\\nlot abuts shall be considered an interior lot.\\n  b. \"Front of a lot.\" That boundary line which abuts on the street, or,\\nif there be more than one street abutting, on the street designated by\\nthe owner. \"Rear of a lot\" is the side opposite the front.\\n  c. \"Depth of a lot.\" The distance from the front of the lot to the\\nextreme rear line of the lot. The depth of an irregular-shaped lot is\\nits mean depth.\\n  d. \"Lot running through from street to street.\" A lot where the front\\nand rear lines abut for their entire lengths upon streets or open public\\nplaces. When either of such lines exceeds the other in length by more\\nthan twenty per centum, that part of the lot contiguous to the excess\\nlength of the longer line shall be deemed an interior lot.\\n  e. \"Back to back lots.\" Lots or portions of lots which are on opposite\\nsides of the same part of a rear line common to both and the opposite\\nstreet lines on which the lots front are parallel with each other or\\nmake an angle with each other of not more than forty-five degrees.\\n  33. \"Multiple dwelling.\" A dwelling which is either rented, leased,\\nlet or hired out, to be occupied, or is occupied as the temporary or\\npermanent residence or home of three or more families living\\nindependently of each other, including but not limited to the following:\\na tenament, flat house, maisonette apartment, apartment house, apartment\\nhotel, tourist house, bachelor apartment, studio apartment, duplex\\napartment, kitchenette apartment, hotel, lodging house, rooming house,\\nboarding house, boarding and nursery school, furnished room house, club,\\nsorority house, fraternity house, college and school dormitory,\\nconvalescent, old age or nursing homes or residences. It shall also\\ninclude a dwelling, two or more stories in height, and with five or more\\nboarders, roomers or lodgers residing with any one family.\\n  34. \"Non-fireproof dwelling.\" A dwelling which does not meet the\\nrequirements for a fireproof dwelling.\\n  35. \"Occupied\" or \"used.\" Such terms shall be construed as if followed\\nby the words \"or arranged, designed, or intended to be occupied or\\nused.\"\\n  36. \"Owner.\" Owner or owners of the freehold of the premises or lesser\\nestate therein, a mortgagee or vendee in possession, assignee of rents,\\nreceiver, executor, trustee, lessee, agent, or any other person, firm or\\ncorporation, directly or indirectly in control of a dwelling.\\n  37. \"Premises.\" Land, improvements and appurtenances or any part\\nthereof.\\n  38. \"Private dwelling.\" A dwelling occupied exclusively for residence\\npurposes by one or two families and having not more than four boarders,\\nroomers or lodgers residing with any one family.\\n  39. \"Public hall.\" A hall, corridor or passageway not within any\\napartment or suite of private rooms. \"Public vestibule.\" A hall not\\nwithin any apartment or suite or private rooms providing access to a\\nstair or elevator and not wider than seven feet nor longer than twice\\nthe width of the stair or elevator shaft opening upon such hall.\\n  40. \"Public part\" or \"public room.\" A space available for common usage\\nor used exclusively for storage purposes or for mechanical equipment of\\nthe dwelling.\\n  41. \"Section.\" A part of a multiple dwelling other than an apartment\\nor suite, separated as a unit from the rest of such dwelling by\\nfireproof construction.\\n  42. \"Shaft.\" A space extending through one or more stories of a\\ndwelling connecting a series of openings therein or any story or stories\\nand the roof, and includes exterior and interior shafts whether for air,\\nlight, elevator, dumbwaiter or any other purpose.\\n  43. \"Shall.\" The word \"shall\" is always mandatory.\\n  44. \"Single-room occupancy.\" The occupancy by one or two persons of a\\nsingle room, or two or more rooms which are joined together separated\\nfrom all other rooms within an apartment in a multiple dwelling so that\\nthe occupant or occupants thereof reside separately and independently of\\nthe other occupant or occupants of the same apartment.\\n  45. \"Sprinkler system.\" A system of piping connected to one or more\\nsprinkler heads with fusible struts which will be constructed to fuse at\\na specified temperature so as to discharge an effective spray to cover\\nthe area to be sprinkled. Such system may be either an automatic wet\\npipe type in which all pipes and sprinkler heads are at all times filled\\nwith water when the building is occupied, or a dry pipe system in which\\nthe pipes and sprinkler heads are filled with air, either compressed or\\nat atmospheric pressure, and the water supply is controlled by a\\ndry-pipe valve.\\n  46. \"Stair.\" A flight or flights of steps including any landings and\\nparts of public halls through which it is necessary to pass in going\\nfrom one level to another.\\n  47. \"Stair hall.\" A part of a public hall through which it is\\nnecessary to pass in going from the end of one flight of steps to the\\nbeginning of another but shall not include an area that is also used to\\nprovide direct ingress to and egress from an apartment or suite.\\n  48. \"Story.\" A space between the level of one finished floor and the\\nlevel of the next higher finished floor, or, if the top story, of the\\nspace between the level of the highest finished floor and the top of the\\nhighest roof beams, or, if the first story, of the space between the\\nlevel of the finished floor and the finished ceiling immediately above.\\nFor the purpose of measuring height by stories of dwellings erected on\\nor after July first, nineteen hundred fifty-two, one additional story\\nshall be added for each twelve feet or fraction thereof that the first\\nstory exceeds fifteen feet in height, and for each twelve feet or\\nfraction thereof that any story above the first story exceeds twelve\\nfeet in height.\\n  49. \"Street wall.\" A wall of a building, at any level, nearest to a\\nstreet line abutting the property.\\n  50. \"Suite.\" That portion of a dwelling consisting of one or more\\nliving rooms and occupied by the members of a family, which group of\\nrooms is separated from all other groups within a dwelling.\\n  51. \"Window dimensions.\" The measurements between the stop-beads or,\\nif there are no stop-beads, between the sides and the head and sill of\\nthe sash opening.\\n  52. \"Yard.\" An open space on the same lot with a dwelling between the\\nextreme rear line of the lot and the extreme rear wall of the dwelling.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            } ],
            "size" : 4
          },
          "repealed" : false
        }, {
          "lawId" : "MRE",
          "lawName" : "Multiple Residence",
          "locationId" : "A2",
          "title" : "Miscellaneous Application Provisions",
          "docType" : "ARTICLE",
          "docLevelId" : "2",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 7,
          "repealedDate" : null,
          "fromSection" : "8",
          "toSection" : "15",
          "text" : "                                ARTICLE 2\\n                  MISCELLANEOUS APPLICATION PROVISIONS\\nSection 8.  General application to all dwellings.\\n        9.  Buildings converted or altered.\\n        10. Dwellings damaged.\\n        11. Old dwellings.\\n        12. Uncompleted dwellings.\\n        13. Prohibited uses.\\n        15. Smoke detecting devices.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "8",
              "title" : "General application to all dwellings",
              "docType" : "SECTION",
              "docLevelId" : "8",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 8,
              "repealedDate" : null,
              "fromSection" : "8",
              "toSection" : "8",
              "text" : "  § 8. General application to all dwellings. Except as otherwise\\nspecifically provided in this chapter, every multiple dwelling shall be\\nconstructed and maintained in accordance with all applicable\\nrequirements of this chapter and other applicable laws.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "9",
              "title" : "Buildings converted or altered",
              "docType" : "SECTION",
              "docLevelId" : "9",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 9,
              "repealedDate" : null,
              "fromSection" : "9",
              "toSection" : "9",
              "text" : "  § 9. Buildings converted or altered. 1. On or after July first,\\nnineteen hundred fifty-two, no multiple dwelling shall be enlarged or\\nits lot diminished so that the yard or other unoccupied areas shall be\\ndiminished in size or area below the minimum requirements of this\\nchapter.\\n  2. A building not a dwelling, if converted on or after July first,\\nnineteen hundred fifty-two, to a multiple dwelling, shall thereupon\\nbecome subject to all the provisions of this chapter applicable to new\\nmultiple dwellings of like class and kind. \"Class\" shall mean the use of\\na multiple dwelling for either permanent or transient occupancy or both.\\n\"Kind\" shall mean the type of construction of a building, either\\nfireproof or non-fireproof.\\n  3. No dwelling shall be altered or converted so as to be in violation\\nof any provision of this chapter relating to dwellings of like class and\\nkind, and, except as provided in subdivision four, a dwelling, altered\\nor converted to be occupied primarily for permanent-residence use, shall\\ncomply with article three; and a dwelling converted or altered to be\\noccupied primarily for transient use shall comply with article four.\\n  4. If any multiple dwelling three or more stories in height is altered\\nafter July first, nineteen hundred fifty-three so as to increase its\\nheight or bulk for living purposes or so as to increase the number of\\nliving rooms by more than twenty per centum, such dwelling shall be made\\nto conform to the requirements of this chapter with respect to new\\ndwellings of like class and kind erected after such date.\\n  5. It shall be unlawful to convert a frame dwelling to a multiple\\nresidence, except that a frame dwelling not more than two stories and\\nattic in height and erected before July first, nineteen hundred\\nfifty-two, as a one-family or two-family residence may be converted to a\\nmultiple dwelling for permanent occupancy by complying with article\\nthree; and if such residence is converted to be occupied, as a rule, for\\ntransient use, it shall comply with article four.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "10",
              "title" : "Dwellings damaged",
              "docType" : "SECTION",
              "docLevelId" : "10",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 10,
              "repealedDate" : null,
              "fromSection" : "10",
              "toSection" : "10",
              "text" : "  § 10. Dwellings damaged. If an old or other existing multiple dwelling\\nbe damaged by fire or other cause to the extent of two-thirds or more of\\nits value at the time of such damage exclusive of the value of the\\nfoundation, such dwelling shall not be repaired or rebuilt except in\\nconformity with the provisions of this chapter relative to new multiple\\ndwellings.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "11",
              "title" : "Old dwellings",
              "docType" : "SECTION",
              "docLevelId" : "11",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 11,
              "repealedDate" : null,
              "fromSection" : "11",
              "toSection" : "11",
              "text" : "  § 11. Old dwellings. Except as required in section nine and articles\\nthree and four, nothing in this chapter shall be construed to require\\nany change in the construction, use, or occupancy of any old or other\\nexisting multiple dwelling occupied as such on July first, nineteen\\nhundred fifty-two, which on such date is in compliance with the\\nprovisions of all statutes, local laws, ordinances, rules and\\nregulations applicable thereto.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "12",
              "title" : "Uncompleted dwellings",
              "docType" : "SECTION",
              "docLevelId" : "12",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 12,
              "repealedDate" : null,
              "fromSection" : "12",
              "toSection" : "12",
              "text" : "  § 12. Uncompleted dwellings. 1. The provisions of this chapter\\nrelating to new multiple dwellings shall not apply to any multiple\\ndwelling for which plans were on file with the department or a permit to\\ncommence building was issued by the department before July first,\\nnineteen hundred fifty-two, or to any dwelling the plans for conversion\\nof which to multiple dwelling occupancy, were on file with the\\ndepartment or a permit authorizing the commencement of the work of such\\nconversion was issued by the department before such date, provided,\\nhowever, a certificate of occupancy as required by the provisions of\\nsection three hundred two shall be obtained therefor prior to July\\nfirst, nineteen hundred fifty-seven.\\n  2. No provisions of any part of this section shall be deemed to\\nprohibit the amendment of any plans filed and approved before July\\nfirst, nineteen hundred fifty-two, if such amendment would have been\\nlawful before such date, or if such amendment complies with the\\nrequirements of this chapter for alterations to buildings of like kind\\nexisting before such date.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "13",
              "title" : "Prohibited uses: The storage or keeping of any combustible gaseous material within any multiple dwelling shall be unlawful unless a writt...",
              "docType" : "SECTION",
              "docLevelId" : "13",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 13,
              "repealedDate" : null,
              "fromSection" : "13",
              "toSection" : "13",
              "text" : "  § 13. Prohibited uses: The storage or keeping of any combustible\\ngaseous material within any multiple dwelling shall be unlawful unless a\\nwritten permit therefor is issued by the department and any and all\\nlocal laws or regulations applicable thereto are complied with. The\\nprovisions of this section shall not prevent the keeping of such\\ngasoline, oil or other fuel as may be contained in a tank or receptacle\\nof a motor vehicle stored in a space provided for automobiles in a\\nmultiple dwelling, nor shall this section apply to gaseous material used\\nfor the cleaning or washing of a motor vehicle so stored. Such permit\\nshall not be required for the keeping or storage of oil or kerosene in\\nquantities not exceeding five gallons at any one time for domestic\\nheating or cooking purposes, provided such oil or kerosene is in a\\ncontainer directly connected to the heating or cooking appliances in\\nwhich it is to be used and is kept or stored in accordance with\\nstandards of safety prescribed by the department.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "15",
              "title" : "Smoke detecting devices",
              "docType" : "SECTION",
              "docLevelId" : "15",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 14,
              "repealedDate" : null,
              "fromSection" : "15",
              "toSection" : "15",
              "text" : "  § 15. Smoke detecting devices. 1. This section shall apply to all\\nmultiple dwellings, whenever constructed, provided however, that for the\\npurposes of this section the term \"multiple dwelling\" shall also include\\nany dwelling accommodation used as a temporary or permanent residence\\nlocated in any building owned as a condominium or cooperative.\\n  2. (a) The owner of every multiple dwelling to which the provisions of\\nthis section apply shall equip each apartment or other separate living\\nunit in such multiple dwelling with approved and operational smoke\\ndetecting devices in conformity with the state fire prevention and\\nbuilding code; provided, however, that any multiple dwelling not subject\\nto the provisions of such code may, in the alternative, be equipped with\\nbattery-operated smoke detecting devices of a type accepted by the\\ndivision of housing and community renewal.\\n  (b) In hotels, tourist houses, lodging houses, rooming houses,\\nboarding houses, boarding and nursery schools, furnished room houses,\\nclub houses, sorority and fraternity houses, college and school\\ndormitories, convalescent, old age and nursing homes, any dwelling which\\nis two or more stories in height, with five or more boarders, roomers or\\nlodgers residing with any one family, and any multiple dwelling used for\\nsingle room occupancy, at least one smoke detecting device shall be\\nlocated within each room used for sleeping purposes. In any other\\nmultiple dwelling or portion thereof, there shall be at least one smoke\\ndetecting device located within each apartment or separate living unit,\\nin an area so that it is clearly audible in each bedroom or other room\\nused for sleeping purposes, with intervening doors closed; provided,\\nhowever, that no smoke detecting device be located more than ten feet\\nfrom the entrance to any bedroom or other room used for sleeping\\npurposes.\\n  (c) Each smoke detecting device shall include a test device to permit\\nthe occupant to readily determine if it is operational.\\n  (d) In addition to complying with the provisions of this section, the\\ntype, location, number, and manner of installation of smoke detecting\\ndevices shall be in accordance with standards prescribed by the state\\nfire prevention and building code council.\\n  3. (a) With respect to multiple dwellings which are occupied for\\npermanent residential purposes only, other than any portion of any such\\ndwelling used for single room occupancy, and notwithstanding the\\nprovisions of sections forty and one hundred seventy-four or any other\\nprovision of this chapter, or of any other law or requirement, state or\\nlocal, the duties of the owner and tenant with respect to smoke\\ndetecting devices installed pursuant to this section shall be as\\nprovided in subdivisions four and five of this section.\\n  (b) With respect to multiple dwelling units as specified in paragraph\\n(b) of subdivision two of this section, or any portion of any multiple\\ndwelling used for single room occupancy, the provisions of subdivision\\nfive of this section shall not apply, and smoke detecting devices\\ninstalled as required by this section shall be subject to the provisions\\nof section forty or one hundred seventy-four of this chapter.\\n  (c) The owner of every multiple dwelling shall keep such records as\\nthe state fire prevention and building code council shall prescribe\\nrelating to the installation and maintenance of smoke detecting devices\\nin the building and make such records available to any local code\\nenforcement official on request.\\n  4. In addition to initially providing and installing the smoke\\ndetecting devices, the owner shall:\\n  (a) replace within thirty days after the receipt of written notice any\\nsuch device which becomes inoperable within one year of the installation\\nof such device due to a defect in the manufacture of such device and\\nthrough no fault of the occupant of the apartment or other unit;\\n  (b) upon the occurrence of a vacancy, replace or properly equip any\\nsuch device which has been removed or rendered inoperable, so as to\\nprovide operational smoke detecting devices for any new tenant; and\\n  (c) notify tenants in writing, individually or through posting of a\\nnotice in a common area of the building, of the respective duties of\\nowners and tenants under this section.\\n  5. Except as provided in paragraph (b) of subdivision three of this\\nsection, the tenant shall keep and maintain any smoke detecting device\\ninstalled pursuant to this section in good repair and replace any such\\ndevice which becomes inoperable during his occupancy.\\n  6. An owner need not furnish or install a smoke detecting device where\\none has already been installed, provided that (a) the type of such\\ndevice and the manner of its installation comply with the provisions of\\nthis section and the standards prescribed by the state fire prevention\\nand building code council, (b) the existing device is tested and found\\nto be operational, and (c) the existence of such device in lieu of an\\nowner-furnished device is noted on the records kept by the owner\\npursuant to paragraph (c) of subdivision three of this section.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            } ],
            "size" : 7
          },
          "repealed" : false
        }, {
          "lawId" : "MRE",
          "lawName" : "Multiple Residence",
          "locationId" : "A3",
          "title" : "Old Multiple Dwellings",
          "docType" : "ARTICLE",
          "docLevelId" : "3",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 15,
          "repealedDate" : null,
          "fromSection" : "25",
          "toSection" : "43",
          "text" : "                                ARTICLE 3\\n                         OLD MULTIPLE DWELLINGS\\nSection 25. Application of article three.\\n                                 TITLE 1\\n                             FIRE PROTECTION\\nSection 26. Egress from dwellings.\\n        27. Fire-escapes.\\n        28. Stairs and entrance halls.\\n        29. Dumbwaiter shafts.\\n        30. Cellar ceilings.\\n        31. Inside cellar stairs.\\n        32. Artificial lighting.\\n                                 TITLE 2\\n                               SANITATION\\nSection 40. Repairs and cleanliness.\\n        41. Water supply.\\n        42. Water closet and bath accommodations.\\n        43. Plumbing and drainage.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "25",
              "title" : "Application of article three",
              "docType" : "SECTION",
              "docLevelId" : "25",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 16,
              "repealedDate" : null,
              "fromSection" : "25",
              "toSection" : "25",
              "text" : "  § 25. Application of article three. The provisions of this article\\nshall apply to all multiple dwellings existing on July first, nineteen\\nhundred fifty-two, and shall also apply to dwellings converted to\\nmultiple dwelling occupancy on or after July first, nineteen hundred\\nfifty-two, provided, however, that this article shall not apply to\\nhotels and similar dwellings in any city, town or village with respect\\nto which the provisions of article four are applicable. The provisions\\nof this article shall apply in addition to and not in substitution for\\nthe provisions of article two.  Provisions of this article shall be\\ncomplied with on or before July first, nineteen hundred fifty-four.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "A3T1",
              "title" : "Fire Protection",
              "docType" : "TITLE",
              "docLevelId" : "1",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 17,
              "repealedDate" : null,
              "fromSection" : "26",
              "toSection" : "32",
              "text" : "                                 TITLE 1\\n                             FIRE PROTECTION\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "26",
                  "title" : "Egress from dwellings",
                  "docType" : "SECTION",
                  "docLevelId" : "26",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 18,
                  "repealedDate" : null,
                  "fromSection" : "26",
                  "toSection" : "26",
                  "text" : "  § 26. Egress from dwellings.  In every such dwelling three stories or\\nmore in height there shall be from each story at least two independent\\nmeans of egress accessible to each apartment or suite. The first means\\nshall open into a public hall connected with a stair affording safe\\naccess to a street, or to a yard, court or passageway affording\\ncontinuous, safe and unobstructed access to a street. The second means\\nshall be directly to a fire-escape or to an enclosed stair without\\npassing through the first means, except that where the first means\\nincludes an interior stair which is closed off at each floor level by\\nfire-retarded construction with a fireproof self-closing door therein,\\nthe second means may be another such interior stair or a fire-escape\\ndirectly accessible on the same story from a public hall therein whether\\nor not such public hall is also a part of the first means provided such\\nfire-escape is not a wire, chain, cable, vertical ladder or rope\\nfire-escape. In lieu of a second means of egress a sprinkler system may\\nbe installed in the public halls and stairs.\\n  Except as required by the provisions of article four of this chapter,\\nthe second means of egress shall not be required in a multiple dwelling\\nof fireproof construction, six stories or less in height, erected before\\nJuly first, nineteen hundred fifty-two, if the egress arrangements\\nthereof complied with requirements of law applicable at the time the\\ndwelling was erected.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "27",
                  "title" : "Fire-escapes",
                  "docType" : "SECTION",
                  "docLevelId" : "27",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 19,
                  "repealedDate" : null,
                  "fromSection" : "27",
                  "toSection" : "27",
                  "text" : "  § 27. Fire-escapes.  Wire, chain, cable, combustible, vertical ladder\\nor rope fire-escapes shall not be accepted as a required or alternative\\nmeans of egress and, unless such fire-escapes are supplemental to the\\nmeans of egress required by section twenty-six, they shall be removed\\nand replaced by a system of fire-escapes constructed and arranged as\\nprovided in section one hundred thirty-three. All fire-escapes erected\\non or after July first, nineteen hundred fifty-three, to serve as a\\nsecond means of egress shall be in conformity with the provisions of\\nsection one hundred thirty-three. It shall be unlawful to remove any\\nfire-escape without permission from the department. Such system shall be\\ninstalled, arranged and maintained in a manner satisfactory to the\\ndepartment and in accordance with rules adopted by the commission.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "28",
                  "title" : "Stairs and entrance halls",
                  "docType" : "SECTION",
                  "docLevelId" : "28",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 20,
                  "repealedDate" : null,
                  "fromSection" : "28",
                  "toSection" : "28",
                  "text" : "  § 28. Stairs and entrance halls. In every such dwelling three stories\\nor more in height the wood wainscoting and other combustible materials\\non the wall and ceiling surfaces in all halls shall be removed and\\nreplaced with incombustible or other fire-resistive materials. In lieu\\nof such removal, a sprinkler system may be installed in such halls or\\nsuch wainscoting and the combustible surfaces may be treated or covered\\nin a manner satisfactory to the department with a surface fire-retardant\\napproved by the department. In such a dwelling, however, any entrance\\ndoor and every door opening into any entrance hall, stair hall, or other\\npublic hall connected therewith, shall be self-closing. Every interior\\nsash, or opening other than a door, in the walls or partitions of such\\nhalls and every window therein not opening to the outer air shall be\\nsealed with fire-resistive materials.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "29",
                  "title" : "Dumbwaiter shafts",
                  "docType" : "SECTION",
                  "docLevelId" : "29",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 21,
                  "repealedDate" : null,
                  "fromSection" : "29",
                  "toSection" : "29",
                  "text" : "  § 29. Dumbwaiter shafts. In every such dwelling three stories or more\\nin height the doors of all dumbwaiter shafts shall be made self-closing\\nand be covered on the shaft side with fire-resistive material.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "30",
                  "title" : "Cellar ceilings",
                  "docType" : "SECTION",
                  "docLevelId" : "30",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 22,
                  "repealedDate" : null,
                  "fromSection" : "30",
                  "toSection" : "30",
                  "text" : "  § 30. Cellar ceilings. In every such dwelling three stories or more in\\nheight the ceiling of the cellar, or of the lowest story if there be no\\ncellar, shall be fire-retarded, or be equipped with a sprinkler system,\\nunless such ceiling has already been plastered to the satisfaction of\\nthe department.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "31",
                  "title" : "Inside cellar stairs",
                  "docType" : "SECTION",
                  "docLevelId" : "31",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 23,
                  "repealedDate" : null,
                  "fromSection" : "31",
                  "toSection" : "31",
                  "text" : "  § 31. Inside cellar stairs. Every stair leading from a cellar to the\\nfloor above in all old multiple dwellings shall be enclosed with\\nfire-retarded partitions and shall be equipped with a fire-retarded\\nself-closing door located as the department may approve.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "32",
                  "title" : "Artificial lighting",
                  "docType" : "SECTION",
                  "docLevelId" : "32",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 24,
                  "repealedDate" : null,
                  "fromSection" : "32",
                  "toSection" : "32",
                  "text" : "  § 32. Artificial lighting. The owner shall provide a light or lights\\nin every public hall, stair and fire-stair on every floor so that every\\nsuch space shall be lighted adequately.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 7
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "A3T2",
              "title" : "Sanitation",
              "docType" : "TITLE",
              "docLevelId" : "2",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 25,
              "repealedDate" : null,
              "fromSection" : "40",
              "toSection" : "43",
              "text" : "                                 TITLE 2\\n                               SANITATION\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "40",
                  "title" : "Repairs and cleanliness",
                  "docType" : "SECTION",
                  "docLevelId" : "40",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 26,
                  "repealedDate" : null,
                  "fromSection" : "40",
                  "toSection" : "40",
                  "text" : "  § 40. Repairs and cleanliness. All old multiple dwellings shall be\\nmaintained in conformity with the provisions of section one hundred\\nseventy-four.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "41",
                  "title" : "Water supply",
                  "docType" : "SECTION",
                  "docLevelId" : "41",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 27,
                  "repealedDate" : null,
                  "fromSection" : "41",
                  "toSection" : "41",
                  "text" : "  § 41. Water supply. Every such dwelling shall be provided with an\\nadequate supply of water obtained from the public water system or from a\\nsource approved by the public health officer having jurisdiction.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "42",
                  "title" : "Water closet and bath accommodations",
                  "docType" : "SECTION",
                  "docLevelId" : "42",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 28,
                  "repealedDate" : null,
                  "fromSection" : "42",
                  "toSection" : "42",
                  "text" : "  § 42. Water closet and bath accommodations. Every water closet or\\nbathroom installed in such dwellings on or after July first, nineteen\\nhundred fifty-two, and in dwellings converted on or after such date,\\nshall be in conformity with the provisions of section one hundred\\nseventy-one.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "43",
                  "title" : "Plumbing and drainage",
                  "docType" : "SECTION",
                  "docLevelId" : "43",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 29,
                  "repealedDate" : null,
                  "fromSection" : "43",
                  "toSection" : "43",
                  "text" : "  § 43. Plumbing and drainage. Every such dwelling shall be provided\\nwith facilities for the disposal of sewage, waterborne waste, and\\nexcreta, and such facilities shall be connected with the public sewers,\\nif available and practicable; otherwise, such waste matter shall be\\ndisposed of in a manner approved by the public health officer having\\njurisdiction.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 4
              },
              "repealed" : false
            } ],
            "size" : 3
          },
          "repealed" : false
        }, {
          "lawId" : "MRE",
          "lawName" : "Multiple Residence",
          "locationId" : "A4",
          "title" : "Hotels and Similar Dwellings",
          "docType" : "ARTICLE",
          "docLevelId" : "4",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 30,
          "repealedDate" : null,
          "fromSection" : "50",
          "toSection" : "72",
          "text" : "                                ARTICLE 4\\n                      HOTELS AND SIMILAR DWELLINGS\\nSection 50.   Application of article four.\\n                                 TITLE 1\\n                             FIRE PROTECTION\\nSection 52.   Public halls and stairs.\\n        53.   Storage compartments.\\n        54.   Kitchens and pantries.\\n        55.   Egress.\\n        56.   Exit and directional signs.\\n        56-a. Posting of means of egress in hotels and motels.\\n        57.   Vertical and horizontal openings.\\n        58.   Cellar ceiling.\\n        59.   Ventilation for shafts.\\n        60.   Bulkheads and scuttles.\\n        61.   Fire alarm system; watchman.\\n        62.   Miscellaneous provisions.\\n        63.   Two story transient dwellings.\\n        64.   One story transient dwellings.\\n        65.   Artificial lighting.\\n                                 TITLE 2\\n                               SANITATION\\nSection 70.   Repairs and cleanliness.\\n        71.   Water closet and bath accommodations.\\n        72.   Water supply; plumbing and drainage.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "50",
              "title" : "Application of article four",
              "docType" : "SECTION",
              "docLevelId" : "50",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 31,
              "repealedDate" : null,
              "fromSection" : "50",
              "toSection" : "50",
              "text" : "  § 50. Application of article four. 1. As used in this article, the\\nterm \"transient dwellings\" shall mean and include hotels, lodging\\nhouses, boarding and nursery schools, sorority houses, fraternity\\nhouses, college and school dormitories, convalescent, old age and\\nnursing homes, and dwellings used for single room occupancy. The term\\n\"transient occupancy\" shall mean the occupancy of a room for sleeping\\npurposes by the same person or persons for a period of ninety days or\\nless.\\n  2. Except as provided in sections sixty-three and sixty-four with\\nrespect to one and two story transient dwellings only, this article\\nshall apply to all transient dwellings three or more stories in height\\nand in existence on July first, nineteen hundred fifty-two, provided,\\nhowever, that the provisions of article two and sections fifty-three,\\nfifty-six and sixty-one of this article shall apply to new transient\\ndwellings.\\n  3. As to such existing transient dwellings, the provisions of sections\\nfifty-six, sixty-one and sixty-two of this article shall be complied\\nwith on or before July first, nineteen hundred fifty-four, and all other\\nsections of this article shall be complied with on or before July first,\\nnineteen hundred fifty-five.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "A4T1",
              "title" : "Fire Protection",
              "docType" : "TITLE",
              "docLevelId" : "1",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 32,
              "repealedDate" : null,
              "fromSection" : "52",
              "toSection" : "65",
              "text" : "                                 TITLE 1\\n                             FIRE PROTECTION\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "52",
                  "title" : "Public halls and stairs",
                  "docType" : "SECTION",
                  "docLevelId" : "52",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 33,
                  "repealedDate" : null,
                  "fromSection" : "52",
                  "toSection" : "52",
                  "text" : "  § 52. Public halls and stairs. The walls and ceiling of every entrance\\nhall, stair hall or other public hall, every hall or passage not within\\nan apartment or suite of rooms, every dumbwaiter, elevator, and, every\\nother shaft, including stairs, connecting more than two successive\\nstories, shall be sealed off from every other portion of the dwelling\\nwith fire-retarded materials, or, in lieu thereof, except in the case of\\nelevator shafts, shall be equipped with an automatic sprinkler system.\\nExcept as provided in subdivision five of section fifty-five, nothing\\ncontained in this article shall be deemed to exempt an interior required\\nmeans of egress from the enclosure requirements or the equipment\\nprovided for in this section. A fire-detecting system shall not be\\nacceptable for any of the requirements of this section.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "53",
                  "title" : "Storage compartments",
                  "docType" : "SECTION",
                  "docLevelId" : "53",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 34,
                  "repealedDate" : null,
                  "fromSection" : "53",
                  "toSection" : "53",
                  "text" : "  § 53. Storage compartments. There shall be one or more completely\\nenclosed compartments for the storage of mattresses, furniture, paints,\\nfloor wax, linens, brooms, mops and other such inflammable or\\ncombustible paraphernalia incidental to the occupancy and maintenance of\\nthe dwelling, and such paraphernalia shall be stored in no other portion\\nof such dwelling. Such compartments shall be completely protected by an\\nautomatic sprinkler system or a fire-detecting system. Closets which do\\nnot exceed one hundred square feet in floor area may be used for the\\ntemporary storage of such paraphernalia, except mattresses, furniture,\\npaints and insecticides containing inflammable materials and are\\nexcluded from the requirements of this section. Where such storage\\ncompartments are located at least thirty feet distant from such\\ndwelling, no sprinklers or fire-detecting system shall be required.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "54",
                  "title" : "Kitchens and pantries",
                  "docType" : "SECTION",
                  "docLevelId" : "54",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 35,
                  "repealedDate" : null,
                  "fromSection" : "54",
                  "toSection" : "54",
                  "text" : "  § 54. Kitchens and pantries. All kitchens and pantries serving\\nrestaurants or dining rooms in a non-fireproof transient dwelling shall\\nbe equipped with an automatic sprinkler system or a fire-detecting\\nsystem. Where such kitchens and pantries are located at least thirty\\nfeet distant from such dwelling, no sprinkler or fire-detecting system\\nshall be required.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "55",
                  "title" : "Egress",
                  "docType" : "SECTION",
                  "docLevelId" : "55",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 36,
                  "repealedDate" : null,
                  "fromSection" : "55",
                  "toSection" : "55",
                  "text" : "  § 55. Egress. 1. In every transient dwelling to which this article is\\napplicable there shall be from each story at least two independent means\\nof egress accessible to each room, apartment or suite, except as\\notherwise provided in section sixty-three with respect to two story\\ntransient dwellings.\\n  2. The first means of egress shall be an enclosed stair extending\\ndirectly to a street, or to a yard, court or passageway affording\\ncontinuous, safe and unobstructed access to a street, or by an enclosed\\nstair leading to the entrance story, which story shall have direct\\naccess to a street. That area of the dwelling immediately above the\\nstreet level and commonly known as the main floor, where the occupants\\nare registered and the usual business of the dwelling is conducted,\\nshall be considered a part of the entrance story; and a required stair\\nterminating at such main floor or its mezzanine shall be deemed to\\nterminate at the entrance story. An elevator or an unenclosed escalator\\nshall not be acceptable as a required means of egress.\\n  3. The second means of egress shall be by an additional enclosed\\nstair, conforming to the provisions of subdivision two of this section,\\na fire-stair or an outside fire-escape. In a non-fireproof dwelling when\\nit is necessary to pass through a stair enclosure which may or may not\\nbe a required means of egress to reach a required means of egress, such\\nstair enclosure and that part of the public hall or corridor leading\\nthereto from a room, apartment or suite, shall be fire-retarded as\\nprovided in section fifty-two or protected by a sprinkler system; in a\\nfireproof dwelling only that part of the hall or corridor leading to\\nsuch stair enclosure need be so protected.\\n  4. Where it is impractical in such existing transient dwellings to\\nprovide a second means of egress, the department may order, in lieu of\\nthe second means of egress, additional alteration to the first means of\\negress and to shafts, stairs and other vertical openings as the\\ndepartment may deem necessary to safeguard the occupants of the\\ndwelling, may require the public halls providing access to the first\\nmeans of egress to be equipped on each story with an automatic sprinkler\\nsystem, and, in non-fireproof dwellings, may also require automatic\\nsprinkler heads in the stair which serves as the only means of egress.\\n  5. Nothing in this section shall be deemed to require the enclosure of\\na stair which is ornamental provided such stair does not connect more\\nthan two stories.\\n  6. A stair, fire-stair or fire-escape supplementary to the egress\\nrequirements of subdivisions two, three and four of this section need\\nnot lead to the entrance story or to a street, or to a yard or a court\\nwhich leads to a street, provided the means of egress therefrom is\\napproved by the department.\\n  7. A fire-detecting system shall not be acceptable for any of the\\nrequirements of this section.\\n  8. In lieu of enclosing stairways as required by subdivisions two and\\nthree of this section, an automatic sprinkler system may be provided on\\nsuch stairs.\\n  9. All fire-escapes erected on or after July first, nineteen hundred\\nfifty-three, in compliance with this section, shall be arranged,\\nconstructed and maintained in accordance with the provisions of section\\none hundred thirty-three. Such system shall be installed, arranged and\\nmaintained in a manner satisfactory to the department and in accordance\\nwith rules adopted by the commission. It shall be unlawful to remove any\\nfire-escape without permission from the department.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "56",
                  "title" : "Exit and directional signs",
                  "docType" : "SECTION",
                  "docLevelId" : "56",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 37,
                  "repealedDate" : null,
                  "fromSection" : "56",
                  "toSection" : "56",
                  "text" : "  § 56. Exit and directional signs. Every means of egress shall be\\nindicated by a sign reading \"EXIT\" in red letters at least eight inches\\nhigh on a white background, or vice versa, illuminated at all times\\nduring the day and night by a red light of at least twenty-five watts or\\nequivalent illumination.  Such light shall be maintained in a keyless\\nsocket. On all stories where doors, openings or passageways giving\\naccess to any means of egress are not visible from all portions of such\\nstories, directional signs shall be maintained in conspicuous locations,\\nindicating in red on a white background, or vice versa, the direction of\\ntravel to the nearest means of egress. At least one sign shall be\\nvisible from the doorway of each room or suite of rooms. Existing signs\\nand illumination may be accepted if, in the opinion of the department,\\nsuch existing signs and illumination serve the intent and purpose of\\nthis section.  Supplementary stairs, fire-stairs or fire-escapes which\\ndo not lead to the entrance story or to a street or to a yard or court,\\nleading to a street, shall be clearly marked \"NOT AN EXIT\" in black\\nletters at least four inches high on a yellow background, and at the\\ntermination of each such stair, fire-stair or fire-escape, there shall\\nbe a directional sign indicating the nearest means of egress leading to\\na street. All signs shall be constructed, located and illuminated in a\\nmanner satisfactory to the department.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "56-A",
                  "title" : "Posting of means of egress in hotels and motels",
                  "docType" : "SECTION",
                  "docLevelId" : "56-A",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 38,
                  "repealedDate" : null,
                  "fromSection" : "56-A",
                  "toSection" : "56-A",
                  "text" : "  § 56-a. Posting of means of egress in hotels and motels. On each floor\\nof every hotel or motel having two or more stories where the rooms or\\nsuites are connected by an interior hallway there shall be posted by\\neach stairway, elevator or other means of egress a printed scale floor\\nplan of the particular story, which shall show all means of egress,\\nclearly labeling those to be used in case of fire. Such signs shall be\\nposted in other conspicuous areas throughout the building. Said floor\\nplan shall be no smaller than eight inches by ten inches and shall be\\nposted in such a manner that it cannot be readily removed.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "57",
                  "title" : "Vertical and horizontal openings",
                  "docType" : "SECTION",
                  "docLevelId" : "57",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 39,
                  "repealedDate" : null,
                  "fromSection" : "57",
                  "toSection" : "57",
                  "text" : "  § 57. Vertical and horizontal openings. In order to prevent the\\nvertical and horizontal spread of fire, smoke and gases, it shall, in\\naddition to other applicable provisions of this article, be necessary to\\ncomply with the requirements of this section.\\n  1. All doors opening from shafts, stair halls or stairs and the door\\nassemblies shall be fire-retarded with the doors self-closing and\\nwithout transoms or any other opening. Except in the case of elevator\\nshafts, such shafts, stair halls or stairs may be protected by an\\nautomatic sprinkler system in lieu of fire retarding.\\n  2. All other doors opening upon entrance halls or other public halls\\nor corridors in every part of the dwelling shall be self-closing, except\\nwhere such dwelling is equipped throughout with an approved type\\nautomatic sprinkler or fire-detecting system. It shall be unlawful to\\nattach to or maintain on or about any door required to be self-closing\\nany device which prevents the self-closing of such door.\\n  3. Every existing interior glazed sash, window or opening, other than\\na door, or a fireproof sash, window or opening glazed with wire glass,\\nin any partition forming required enclosures around stairs or shafts\\nshall be removed and the openings closed up and fire-retarded.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "58",
                  "title" : "Cellar ceiling",
                  "docType" : "SECTION",
                  "docLevelId" : "58",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 40,
                  "repealedDate" : null,
                  "fromSection" : "58",
                  "toSection" : "58",
                  "text" : "  § 58. Cellar ceiling. The ceiling of the cellar shall be fire-retarded\\nor be equipped with a sprinkler system, or the entire cellar shall be\\nequipped with a fire-detecting system. Any room within the dwelling in\\nwhich a boiler or furnace is used for generating heat or hot water to\\nservice the dwelling shall be enclosed with fire-retarded partitions and\\nevery door opening therefrom and its assembly shall be fireproof with\\nthe door self-closing. The ceiling of such room shall also be\\nfire-retarded or be equipped with a sprinkler system, or the room shall\\nbe equipped with a fire-detecting system.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "59",
                  "title" : "Ventilation for shafts",
                  "docType" : "SECTION",
                  "docLevelId" : "59",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 41,
                  "repealedDate" : null,
                  "fromSection" : "59",
                  "toSection" : "59",
                  "text" : "  § 59. Ventilation for shafts. 1. There shall be provided in the roof\\ndirectly over each stair, fire-stair, dumbwaiter, elevator or similar\\nshaft which extends to or within one story of a roof, a ventilating\\nmetal skylight of the cross-sectional area of such shaft. Such skylight\\nneed not, however, exceed twenty square feet in area. Where an existing\\nskylight is smaller than the dimensions or area prescribed in this\\nsubdivision, no structural change shall be required, but a ventilating\\nmetal skylight fitting the existing opening in the roof shall be\\nsufficient.  Every skylight shall be glazed with plain glass in the roof\\nof such skylight and shall be equipped with metal screens over and under\\nthe skylight. In lieu of a skylight a window of the same area at the top\\nstory shall be accepted.\\n  2. Whenever there is a flooring of solid construction at the top of\\nany enclosed stair, fire-stair, elevator or similar shaft, openings\\nshall be left near the top of such shaft for ventilation. Such openings\\nshall provide at least two hundred eighty-eight square inches of\\nunobstructed ventilation and shall communicate directly with the outer\\nair, or be otherwise ventilated in accordance with the provisions of the\\nlocal building code.\\n  3. It shall be unlawful to discharge into any such shaft any\\ninflammable or volatile gases, liquids or other thing or matter which\\nwould endanger life.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "60",
                  "title" : "Bulkheads and scuttles",
                  "docType" : "SECTION",
                  "docLevelId" : "60",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 42,
                  "repealedDate" : null,
                  "fromSection" : "60",
                  "toSection" : "60",
                  "text" : "  § 60. Bulkheads and scuttles. 1. There shall be a fire-resistive\\nbulkhead in the roof over, or connecting directly by means of a public\\nhall with the highest portion of every stair extending to the highest\\nstory below the main roof.  Stairs leading to such bulkheads shall be\\nfire-retarded as required for other public stairs and shall have at the\\ntop fireproof doors and assemblies with the doors self-closing. All\\nstairs to required bulkheads shall be provided with a guide or handrail.\\nA scuttle so constructed as to be readily opened may be substituted for\\na bulkhead in dwellings not exceeding three stories and a basement in\\nheight. Such scuttle shall be at least twenty-one inches in width and\\ntwenty-eight inches in length, covered on the outside with metal and\\nprovided with a stationary iron or steel ladder leading thereto.\\n  2. When a dwelling has a pitched or sloping roof with a pitch or slope\\nof more than fifteen degrees, no bulkhead or scuttle, or stair or ladder\\nleading thereto shall be required.\\n  3. A bulkhead door or scuttle shall never be locked with a key, but\\nmay be fastened on the inside with movable rustproof bolts or hooks.\\nAll key locks shall be removed.\\n  4. Bulkheads and stairs leading thereto existing on July first,\\nnineteen hundred fifty-two, shall be permitted provided the stairs have\\nsuch angle of ascent and treads of such dimensions as may be approved by\\nthe department.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "61",
                  "title" : "Fire alarm system; watchman",
                  "docType" : "SECTION",
                  "docLevelId" : "61",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 43,
                  "repealedDate" : null,
                  "fromSection" : "61",
                  "toSection" : "61",
                  "text" : "  § 61. Fire alarm system; watchman. 1. Except as provided in\\nsubdivision three, in every transient dwelling containing thirty or more\\nsleeping rooms for transient occupancy, there shall be an interior fire\\nalarm system.\\n  2. Except as provided in subdivision three, in every fireproof\\ntransient dwelling containing fifty or more sleeping rooms for transient\\noccupants, and in every non-fireproof transient dwelling containing\\nthirty or more such rooms, when thirty-five per centum or more of such\\nrooms are occupied, there shall be, in addition to the interior fire\\nalarm system, one or more watchmen or clerks, employed by the owner,\\nwhose duty it shall be to visit every portion of the dwelling at\\nfrequent regular intervals between the hours of eleven p.m. and seven\\na.m. for the purpose of detecting fire or other sources of danger and\\ngiving immediate and timely warning thereof to all the occupants. There\\nshall be provided a watchman's clock system or other device to record\\nthe movement of such watchman.\\n  3. Where throughout such dwelling a fire-detecting system, or an\\napproved type automatic sprinkler system is provided which actuates a\\nfire alarm by the flow of water through such system so as to give\\nwarning to all the occupants of the dwelling, and is installed in a\\nmanner satisfactory to the department in conformity with rules and\\nregulations adopted by the commission, the provisions of subdivisions\\none and two shall not be applicable.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "62",
                  "title" : "Miscellaneous provisions",
                  "docType" : "SECTION",
                  "docLevelId" : "62",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 44,
                  "repealedDate" : null,
                  "fromSection" : "62",
                  "toSection" : "62",
                  "text" : "  § 62. Miscellaneous provisions. 1. An existing sprinkler installation,\\nfire alarm, watchman's clock or fire-detecting system which has been\\napproved or accepted by the department having jurisdiction and installed\\nbefore July first, nineteen hundred fifty-two, in conformity with rules\\nand regulations adopted by the commission, shall, after inspection by\\nthe said department, be deemed to be in compliance with the requirements\\nof this chapter.\\n  2. Where a sprinkler system is required by this article, such system\\nshall be constructed to fuse at a temperature not higher than one\\nhundred sixty-five degrees Fahrenheit, spaced so as to protect the area\\nwhich is required to be sprinklered.\\n  3. In furnace, boiler, laundry rooms and other parts of the dwelling\\nwhere high temperature usually prevails, sprinkler heads may fuse at a\\nhigher temperature. Where such rooms are located at least thirty feet\\ndistant from such dwelling, no sprinklers shall be required.\\n  4. Except as otherwise provided in sections fifty-two and fifty-five,\\nan approved fire-detecting system shall be accepted as meeting any\\nrequirement for a sprinkler system under this article.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "63",
                  "title" : "Two story transient dwellings",
                  "docType" : "SECTION",
                  "docLevelId" : "63",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 45,
                  "repealedDate" : null,
                  "fromSection" : "63",
                  "toSection" : "63",
                  "text" : "  § 63. Two story transient dwellings. 1. All nursing and convalescent\\nhomes, homes for the aged, and boarding and nursery schools, two stories\\nin height, shall conform with all of the provisions of article four.\\n  2. Except as provided in subdivision one of this section, the only\\nprovisions of article four which shall apply to two story transient\\ndwellings in existence on July first, nineteen hundred fifty-two, shall\\nbe sections sixty, sixty-one, sixty-five, title two and the following:\\n  a. Every such transient dwelling shall have at least two means of\\negress. The first means of egress shall be by an interior stair closed\\noff at the top or bottom. The second means of egress shall be by an\\nadditional interior stair closed off at the top or bottom or a fire\\nstair or fire escape. A second means of egress shall not be required in\\na dwelling containing less than thirty sleeping rooms if the sill of the\\nsecond story window does not exceed fourteen feet in vertical height\\nabove the ground or other safe landing place immediately below such\\nwindow sill.\\n  b. Where it is impractical in such transient dwellings to provide a\\nsecond required means of egress, the department may order, in lieu\\nthereof, additional alterations to the first means of egress and to\\nshafts, stairs and other vertical openings to safeguard the occupants of\\nthe dwelling, may require the public halls providing access to the first\\nmeans of egress to be equipped on both stories with an automatic\\nsprinkler system, and may also require automatic sprinkler heads in the\\nstair which serves as the only means of egress.\\n  c. Where two means of egress are required by this section and one is\\nan ornamental stair, the provision for closing off the stair at top or\\nbottom shall not be applicable to the ornamental stair.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "64",
                  "title" : "One story transient dwellings",
                  "docType" : "SECTION",
                  "docLevelId" : "64",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 46,
                  "repealedDate" : null,
                  "fromSection" : "64",
                  "toSection" : "64",
                  "text" : "  § 64. One story transient dwellings. The only provisions of article\\nfour which shall apply to one story transient dwellings in existence on\\nJuly first, nineteen hundred fifty-two, shall be sections sixty,\\nsixty-one, sixty-five and title two.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "65",
                  "title" : "Artificial lighting",
                  "docType" : "SECTION",
                  "docLevelId" : "65",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 47,
                  "repealedDate" : null,
                  "fromSection" : "65",
                  "toSection" : "65",
                  "text" : "  § 65. Artificial lighting.  The owner shall provide a light or lights\\nin every public hall, stair and fire-stair on every floor so that every\\nsuch space shall be lighted adequately.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 15
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "A4T2",
              "title" : "Sanitation",
              "docType" : "TITLE",
              "docLevelId" : "2",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 48,
              "repealedDate" : null,
              "fromSection" : "70",
              "toSection" : "72",
              "text" : "                                 TITLE 2\\n                               SANITATION\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "70",
                  "title" : "Repairs and cleanliness",
                  "docType" : "SECTION",
                  "docLevelId" : "70",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 49,
                  "repealedDate" : null,
                  "fromSection" : "70",
                  "toSection" : "70",
                  "text" : "  § 70. Repairs and cleanliness. Every transient dwelling shall be\\nmaintained in conformity with the provisions of section one hundred\\nseventy-four.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "71",
                  "title" : "Water closet and bath accommodations",
                  "docType" : "SECTION",
                  "docLevelId" : "71",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 50,
                  "repealedDate" : null,
                  "fromSection" : "71",
                  "toSection" : "71",
                  "text" : "  § 71. Water closet and bath accommodations. Every water closet or\\nbathroom installed in transient dwellings on or after July first,\\nnineteen hundred fifty-two, and in transient dwellings converted on or\\nafter such date shall be constructed in conformity with the provisions\\nof section one hundred seventy-one.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "72",
                  "title" : "Water supply; plumbing and drainage",
                  "docType" : "SECTION",
                  "docLevelId" : "72",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 51,
                  "repealedDate" : null,
                  "fromSection" : "72",
                  "toSection" : "72",
                  "text" : "  § 72. Water supply; plumbing and drainage.  Every such dwelling shall\\ncomply with the provisions of sections forty-one and forty-three.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 3
              },
              "repealed" : false
            } ],
            "size" : 3
          },
          "repealed" : false
        }, {
          "lawId" : "MRE",
          "lawName" : "Multiple Residence",
          "locationId" : "A5",
          "title" : "New Multiple Dwellings--general Provisions",
          "docType" : "ARTICLE",
          "docLevelId" : "5",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 52,
          "repealedDate" : null,
          "fromSection" : "100",
          "toSection" : "174",
          "text" : "                                ARTICLE 5\\n               NEW MULTIPLE DWELLINGS--GENERAL PROVISIONS\\nSection 100. Application of article five.\\n                                 TITLE 1\\n                              LIGHT AND AIR\\nSection 101. Height and bulk.\\n        102. Yards and courts.\\n        103. Lighting and ventilation of rooms.\\n        104. Size of rooms.\\n        105. Cooking spaces.\\n        106. Rooms in cellars.\\n        107. Entrance doors.\\n        108. Windows and skylights for public halls and stairs.\\n        109. Artificial lighting.\\n                                        TITLE 2\\n                               FIRE PROTECTION AND SAFETY\\nSection 130. Entrance halls.\\n        131. Shafts, elevators and dumbwaiters.\\n        132. Stairs.\\n        133. Fire-escapes.\\n        134. Cellar entrance.\\n        135. Frame buildings.\\n        136. Motor vehicle storage.\\n        137. Business uses.\\n        138. Parapets and guard railings.\\n        139. Boiler rooms.\\n                                 TITLE 3\\n                          SANITATION AND HEALTH\\nSection 170. Water supply.\\n        171. Water-closet and bath accommodations.\\n        172. Plumbing and drainage.\\n        173. Heating.\\n        174. Repairs and cleanliness.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "100",
              "title" : "Application of article five",
              "docType" : "SECTION",
              "docLevelId" : "100",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 53,
              "repealedDate" : null,
              "fromSection" : "100",
              "toSection" : "100",
              "text" : "  § 100. Application of article five. All the provisions of this article\\nshall apply to every multiple dwelling of permanent or transient\\noccupancy erected on or after July first, nineteen hundred fifty-two,\\nand shall apply in addition to and not in substitution for the\\nprovisions of article two, articles six or seven, and in the case of\\ntransient dwellings, sections fifty-three, fifty-six, and sixty-one of\\narticle four.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "A5T1",
              "title" : "Light and Air",
              "docType" : "TITLE",
              "docLevelId" : "1",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 54,
              "repealedDate" : null,
              "fromSection" : "101",
              "toSection" : "109",
              "text" : "                                 TITLE 1\\n                              LIGHT AND AIR\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "101",
                  "title" : "Height and bulk",
                  "docType" : "SECTION",
                  "docLevelId" : "101",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 55,
                  "repealedDate" : null,
                  "fromSection" : "101",
                  "toSection" : "101",
                  "text" : "  § 101. Height and bulk. The height and bulk of any new multiple\\ndwelling shall be in accordance with the provisions of any applicable\\nlocal law, ordinance, resolution, code provision or regulation.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "102",
                  "title" : "Yards and courts",
                  "docType" : "SECTION",
                  "docLevelId" : "102",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 56,
                  "repealedDate" : null,
                  "fromSection" : "102",
                  "toSection" : "102",
                  "text" : "  § 102. Yards and courts. Yards and courts in connection with any such\\nmultiple dwelling shall be in accordance with the provisions of any\\napplicable local law, ordinance, resolution, code provision or\\nregulation.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "103",
                  "title" : "Lighting and ventilation of rooms",
                  "docType" : "SECTION",
                  "docLevelId" : "103",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 57,
                  "repealedDate" : null,
                  "fromSection" : "103",
                  "toSection" : "103",
                  "text" : "  § 103. Lighting and ventilation of rooms. 1. Except as in this section\\nand in sections one hundred five, one hundred seventy-one and articles\\nthree and four otherwise expressly provided, every living room shall\\nhave at least one window opening directly upon a street, yard or court\\nupon the same lot as that occupied by the dwelling in which such room is\\nsituated.\\n  2. Nothing in this section shall be construed as prohibiting the\\nwindows of any room from opening on a partially-enclosed terrace\\nprovided such terrace opens directly to a street, yard or court and the\\narea of the front of the terrace which is open to the outer air is at\\nleast equal to seventy-five per centum of the floor surface area of the\\nterrace.\\n  3. No required window shall open upon any offset or recess less than\\nsix feet in width except a window of a water-closet compartment,\\nbathroom, or stair or of a kitchenette.\\n  4. The total window area in every living room shall be at least\\none-tenth of the floor surface area of such room.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "104",
                  "title" : "Size of rooms",
                  "docType" : "SECTION",
                  "docLevelId" : "104",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 58,
                  "repealedDate" : null,
                  "fromSection" : "104",
                  "toSection" : "104",
                  "text" : "  § 104. Size of rooms.  1. Every living room, except kitchens, shall\\ncontain at least eighty square feet of floor space and shall be not less\\nthan eight feet in its least horizontal dimension. However, in every\\npermanently occupied dwelling, one living room in each apartment or\\nsuite shall have at least one hundred thirty-two square feet of floor\\nspace.\\n  2. Every living room shall be at least seven and a half feet high, the\\nmeasurements in all cases to be taken from the finished floor to the\\nfinished underside of the ceiling. Beams crossing the ceiling may be\\ndisregarded if none of them extends below the ceiling more than six\\ninches.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "105",
                  "title" : "Cooking spaces",
                  "docType" : "SECTION",
                  "docLevelId" : "105",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 59,
                  "repealedDate" : null,
                  "fromSection" : "105",
                  "toSection" : "105",
                  "text" : "  § 105. Cooking spaces.  1. Every space which is intended, arranged or\\ndesigned for cooking or warming of food shall be either a kitchen or\\nkitchenette.\\n  2. A kitchen or kitchenette shall be unlawful unless it is\\nconstructed, arranged and maintained in compliance with the following\\napplicable provisions:\\n  a. The ceiling and walls, exclusive of doors, of all kitchenettes\\nshall be fire-retarded or in lieu thereof such space shall be equipped\\nwith one or more sprinkler heads to fuse at a temperature not higher\\nthan two hundred twelve degrees Fahrenheit. Such heads shall be\\nconnected to the water supply through a pipe of adequate size.\\n  b. In every kitchen and kitchenette, all combustible material\\nimmediately underneath or within one foot of any apparatus used for\\ncooking or warming of food shall be fire-retarded or covered with\\nfire-resistive material.\\n  c. Every kitchenette shall be provided with a window opening upon a\\nstreet or upon a yard, court or shaft. Such window shall be at least one\\nfoot wide, have a total area of at least three square feet and be at\\nleast ten per centum of the superficial floor area of such kitchenette.\\nIn lieu of such window, in such kitchenette it shall be lawful to\\ninstall a system of mechanical or gravity ventilation to provide at\\nleast six changes per hour of the air volume of such kitchenette.\\n  d. Every kitchenette may be equipped with a door or doors, provided\\nthe lower portion of each such door has a metal grille containing at\\nleast forty-eight square inches of clear openings or, in lieu of such a\\ngrille, there are two clear open spaces, each of at least twenty-four\\nsquare inches, one between the floor and each such door, and the other\\nbetween the top of each such door and the head jamb.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "106",
                  "title" : "Rooms in cellars",
                  "docType" : "SECTION",
                  "docLevelId" : "106",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 60,
                  "repealedDate" : null,
                  "fromSection" : "106",
                  "toSection" : "106",
                  "text" : "  § 106. Rooms in cellars. It shall be unlawful to occupy all or any\\npart of a cellar for sleeping purposes, but all or part of such cellar\\nmay be used for storage or other general utility purposes accessory to\\nthe occupancy, use or management of the dwelling.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "107",
                  "title" : "Entrance doors",
                  "docType" : "SECTION",
                  "docLevelId" : "107",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 61,
                  "repealedDate" : null,
                  "fromSection" : "107",
                  "toSection" : "107",
                  "text" : "  § 107. Entrance doors.  Every door giving access to an entrance hall\\nfrom outside the dwelling shall contain at least five square feet of\\nglazed surface. Every such door shall open outwardly. The width of every\\nsuch door shall be at least forty-four inches. However, when double\\ndoors are provided each of the doors separately shall be at least two\\nfeet six inches.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "108",
                  "title" : "Windows and skylights for public halls and stairs",
                  "docType" : "SECTION",
                  "docLevelId" : "108",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 62,
                  "repealedDate" : null,
                  "fromSection" : "108",
                  "toSection" : "108",
                  "text" : "  § 108. Windows and skylights for public halls and stairs. 1.  Where a\\nwindow or windows are required to light a public hall or part thereof,\\nat least one of such windows shall be not less than two feet six inches\\nwide and five feet high. Every required window in such a hall shall open\\nupon a street, yard or court. On the top story of such a dwelling a\\nventilating skylight of the same dimensions shall be accepted in lieu of\\na window for that story.\\n  2. There shall be in the roof, directly over each required stair and\\nfire-stair a ventilating skylight provided with louvres or ventilators\\nhaving a minimum open area of forty square inches. The roof of every\\nsuch skylight shall be glazed with plain glass and equipped with\\nsuitable metal screens above and below. The glazed area of every such\\nskylight shall be at least twenty square feet, except that in such a\\ndwelling or section thereof two stories or less in height the glazed\\narea of such a skylight need be only nine square feet. In lieu of a\\nskylight, a window of the same area as prescribed in subdivision one may\\nbe provided. If such a window is used in lieu of a skylight, fixed\\nlouvres having a minimum opening of forty square inches shall also be\\ninstalled in or directly adjacent to such window.\\n  3. When any stair, fire-stair or fire-tower in such a dwelling\\nterminates at the level of a setback of an outer wall and such setback\\nconsists of a terrace at least four feet in width, measured between the\\ninside of the parapet wall and the wall of the dwelling and at least ten\\nfeet in length, measured parallel to the wall of the dwelling, there may\\nbe provided in lieu of such skylight a fireproof door and assembly with\\nthe door self-closing giving access from such stair or fire-stair to\\nsuch terrace. Such door shall have a panel at least five square feet in\\narea glazed with wire glass and shall be equipped with louvres having a\\nminimum open area of forty square inches.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "109",
                  "title" : "Artificial lighting",
                  "docType" : "SECTION",
                  "docLevelId" : "109",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 63,
                  "repealedDate" : null,
                  "fromSection" : "109",
                  "toSection" : "109",
                  "text" : "  § 109. Artificial lighting. The owner shall provide a light or lights\\nin every public hall, stair and fire-stair on every floor so that every\\nsuch space shall be lighted adequately.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 9
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "A5T2",
              "title" : "Fire Protection and Safety",
              "docType" : "TITLE",
              "docLevelId" : "2",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 64,
              "repealedDate" : null,
              "fromSection" : "130",
              "toSection" : "139",
              "text" : "                                 TITLE 2\\n                       FIRE PROTECTION AND SAFETY\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "130",
                  "title" : "Entrance halls",
                  "docType" : "SECTION",
                  "docLevelId" : "130",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 65,
                  "repealedDate" : null,
                  "fromSection" : "130",
                  "toSection" : "130",
                  "text" : "  § 130. Entrance halls. Every entrance hall shall be at least three\\nfeet eight inches in clear width from the entrance to the first stair.\\nIf such an entrance hall is the only entrance to more than one required\\nstairs, the width of such hall shall be increased in every part, for\\neach such additional flight of stairs, by one-half the width required\\nfor one flight of stairs.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "131",
                  "title" : "Shafts, elevators and dumbwaiters",
                  "docType" : "SECTION",
                  "docLevelId" : "131",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 66,
                  "repealedDate" : null,
                  "fromSection" : "131",
                  "toSection" : "131",
                  "text" : "  § 131. Shafts, elevators and dumbwaiters. Every shaft shall be\\nenclosed on all sides with fireproof walls and shall have fireproof\\ndoors and assemblies at all openings, with the doors self-closing. Not\\nmore than three elevators or dumbwaiters shall ever be placed in the\\nsame shaft. All dumbwaiter doors shall be fastened by an interior lock\\nin the shaft operated and controlled from a central point. The doors of\\nevery elevator shaft shall be provided with an automatic device to\\nprevent the normal operation of the elevator unless the hoistway door at\\nwhich the car is standing is closed and locked, or unless all hoistway\\ndoors are locked in a closed position. Such doors, except for\\npower-operated sliding doors, shall have a vision panel of wire glass\\nnot exceeding one square foot in area. Every elevator shall be equipped\\nwith a gate or door with an automatic device to prevent the normal\\noperation of such elevator unless such gate or door is closed.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "132",
                  "title" : "Stairs",
                  "docType" : "SECTION",
                  "docLevelId" : "132",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 67,
                  "repealedDate" : null,
                  "fromSection" : "132",
                  "toSection" : "132",
                  "text" : "  § 132. Stairs. Every interior and exterior stair and fire-stair shall\\nbe provided with proper balustrades and handrails. Every such stair and\\nfire-stair three feet eight inches or more in width shall be provided\\nwith a handrail on each side. Each tread, exclusive of nosing, shall be\\nnot less than nine and one-half inches wide; each riser shall not exceed\\nseven and three-quarter inches in height; and the product of the number\\nof inches in the width of the tread and the number of inches in the\\nheight of the riser shall be at least seventy and at the most\\nseventy-five. Winding stairs shall be unlawful in any public part of the\\ndwelling.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "133",
                  "title" : "Fire-escapes",
                  "docType" : "SECTION",
                  "docLevelId" : "133",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 68,
                  "repealedDate" : null,
                  "fromSection" : "133",
                  "toSection" : "133",
                  "text" : "  § 133. Fire-escapes. 1. Every fire-escape shall be located, arranged,\\nconstructed and maintained in accordance with the following provisions:\\n  a. Each fire-escape shall be accessible to one or more exterior doors\\nor windows opening from the room, apartment or suite, and such window or\\ndoor shall be two feet or more in clear width and two feet six inches or\\nmore in clear height. The sill of any such window shall be within three\\nfeet of the floor.\\n  b. Access to any fire-escape shall not be through any public toilet,\\nor be obstructed by any bathroom fixture, kitchen fixture, sink, or in\\nany other way. Bars, grilles, gates or other obstructing devices on any\\nwindow or door giving access to any fire-escape shall be unlawful.  A\\nrequired fire-escape shall never include a window of a stair hall or\\npublic stairs.\\n  c. Every fire-escape shall be constructed of open balconies and\\nstairways of incombustible material and designed to support a uniformly\\ndistributed live load of at least eighty pounds per square foot. The use\\nof cast iron in the construction of fire-escapes shall be unlawful.\\n  d. No fire-escape shall be removed from or erected upon any multiple\\ndwelling without a permit from the department. No fire-escape shall be\\nremoved or replaced unless a secondary means of egress is available or\\nprovided in lieu thereof.\\n  2. a. Every balcony for a fire-escape shall be three feet or more in\\nclear width.\\n  b. Every lowest balcony more than five feet above a safe landing\\nbeneath shall have a drop ladder fifteen inches in width and of\\nsufficient length to reach such landing. Such ladder shall be held in a\\nproper position at all times, and, unless properly counterbalanced,\\nshall be placed in guides so that it can be lowered easily. The lowest\\nbalcony shall not be more than fourteen feet above the ground or safe\\nlanding place beneath.\\n  c. Every stairway shall be placed at an angle of sixty degrees or less\\nwith steps at least six inches in width and twenty inches in length and\\nwith a maximum rise of nine inches. The opening in any balcony for such\\na stairway shall be at least twenty-one by twenty-eight inches.\\n  d. A stairway shall be provided from every balcony on the top story to\\nthe roof of a multiple dwelling three or more stories in height except\\nwhere the roof is sloped or pitched in excess of fifteen degrees.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "134",
                  "title" : "Cellar entrance",
                  "docType" : "SECTION",
                  "docLevelId" : "134",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 69,
                  "repealedDate" : null,
                  "fromSection" : "134",
                  "toSection" : "134",
                  "text" : "  § 134. Cellar entrance. There shall be a direct entrance to the\\ncellar, or to the lowest story if there be no cellar, from the outside\\nof every multiple dwelling, except that any stair leading to such cellar\\nor lowest story may be located inside the dwelling provided it is\\nenclosed in fireproof walls and fireproof doors and assemblies, with the\\ndoors self-closing, at both the level of such cellar or lowest story and\\nthat of the story above.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "135",
                  "title" : "Frame buildings",
                  "docType" : "SECTION",
                  "docLevelId" : "135",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 70,
                  "repealedDate" : null,
                  "fromSection" : "135",
                  "toSection" : "135",
                  "text" : "  § 135. Frame buildings. It shall be unlawful to erect a frame multiple\\ndwelling exceeding two stories in height.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "136",
                  "title" : "Motor vehicle storage",
                  "docType" : "SECTION",
                  "docLevelId" : "136",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 71,
                  "repealedDate" : null,
                  "fromSection" : "136",
                  "toSection" : "136",
                  "text" : "  § 136. Motor vehicle storage. A space or a structure may be provided\\nand maintained in any multiple dwelling or upon the premises thereof for\\nthe storage of passenger motor vehicles but only with a written permit\\ntherefor from the department and in accordance with every applicable\\nlocal law, ordinance, resolution, code provision or regulation and the\\nrules and regulations of the commission.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "137",
                  "title" : "Business uses",
                  "docType" : "SECTION",
                  "docLevelId" : "137",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 72,
                  "repealedDate" : null,
                  "fromSection" : "137",
                  "toSection" : "137",
                  "text" : "  § 137. Business uses. When business is conducted in a non-fireproof\\nmultiple dwelling, the ceiling of the business space shall be covered\\nwith fire-resistive materials or be equipped with a sprinkler system.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "138",
                  "title" : "Parapets and guard railings",
                  "docType" : "SECTION",
                  "docLevelId" : "138",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 73,
                  "repealedDate" : null,
                  "fromSection" : "138",
                  "toSection" : "138",
                  "text" : "  § 138. Parapets and guard railings. Except as hereinafter provided\\nevery open area of a roof, terrace, areaway, outside stair, retaining\\nwall or porch shall be protected by a parapet wall, a guard railing, or\\nboth, extending three feet six inches or more in height above the level\\nof such area or, in the case of a stair landing, stair window or window\\nin a public hall, above the level of the floor adjacent thereto. In\\ndwellings two stories in height, it shall be sufficient if the guard\\nrailing is erected at least five feet distant from and encloses any\\nrequired bulkhead or scuttle opening to the roof. This section shall not\\napply to dwellings one story in height.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "139",
                  "title" : "Boiler rooms",
                  "docType" : "SECTION",
                  "docLevelId" : "139",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 74,
                  "repealedDate" : null,
                  "fromSection" : "139",
                  "toSection" : "139",
                  "text" : "  § 139. Boiler rooms.  In every dwelling the boiler or furnace of a\\ncentral heating plant shall be enclosed in a fireproof room or space and\\nall openings therefrom to other portions of the dwelling shall be\\nequipped with fireproof doors and assemblies with the doors\\nself-closing, except that in any dwelling three stories or less in\\nheight, such room or space may in the alternative be enclosed with walls\\nor partitions constructed of fire-resistive materials and the ceiling\\nfire retarded.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 10
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "A5T3",
              "title" : "Sanitation and Health",
              "docType" : "TITLE",
              "docLevelId" : "3",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 75,
              "repealedDate" : null,
              "fromSection" : "170",
              "toSection" : "174",
              "text" : "                                 TITLE 3\\n                          SANITATION AND HEALTH\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "170",
                  "title" : "Water supply",
                  "docType" : "SECTION",
                  "docLevelId" : "170",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 76,
                  "repealedDate" : null,
                  "fromSection" : "170",
                  "toSection" : "170",
                  "text" : "  § 170. Water supply.  The owner shall provide proper appliances to\\nreceive and distribute in such dwelling an adequate supply of water\\nobtained from the public water supply system or from a source approved\\nby the public health officer having jurisdiction at all times when the\\nbuilding is occupied and during all hours and hot water between six\\no'clock in the morning and midnight.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "171",
                  "title" : "Water-closet and bath accommodations",
                  "docType" : "SECTION",
                  "docLevelId" : "171",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 77,
                  "repealedDate" : null,
                  "fromSection" : "171",
                  "toSection" : "171",
                  "text" : "  § 171. Water-closet and bath accommodations.  1. Every dwelling\\narranged for permanent occupancy shall contain a water-closet in every\\napartment.\\n  2. The floor of every compartment, bathroom or general toilet room\\nshall be made waterproof and such waterproofing shall extend six inches\\nor more above the floor so that the floor can be washed or flushed out\\nwithout leaking. No plumbing or plumbing fixture shall be enclosed\\nwholly or in part with woodwork.\\n  3. Water-closets may be placed together in a general toilet room\\nprovided such water-closets are supplementary to the water-closet\\naccommodations required for the exclusive use of tenants of the\\ndwelling, or are solely for the use of business portions of the\\ndwelling.\\n  4. Every apartment arranged for permanent occupancy shall contain a\\nbath or shower accessible from every bedroom without passing through any\\nother bedroom. In dwellings arranged for transient occupancy there shall\\nbe at least one shower or bath for every eight resident occupants.\\n  5. Except as specifically provided otherwise in this chapter, every\\nwater-closet compartment and bath or shower room shall have a window\\nopening upon a street or upon a lawful court or yard.\\n  6. In lieu of a required window or skylight, it shall be lawful to\\ninstall a system of mechanical or gravity ventilation for water-closet\\ncompartments or bathrooms in any portion of a dwelling. Such system of\\nventilation shall be constructed, arranged and maintained continuously\\nto provide at least four changes per hour of the air volume of each such\\nwater-closet compartment or bathroom.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "172",
                  "title" : "Plumbing and drainage",
                  "docType" : "SECTION",
                  "docLevelId" : "172",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 78,
                  "repealedDate" : null,
                  "fromSection" : "172",
                  "toSection" : "172",
                  "text" : "  § 172. Plumbing and drainage. All liquid or water-borne waste from\\nplumbing fixtures shall be conveyed by a house drain and house sewer to\\na street sewer or to a combined street storm water main and sewer,\\nunless no such sewers are available.  Where neither kind of sewer is\\navailable, provision shall be made for disposing of such waste as may be\\npermitted pursuant to article five of the public health law and as\\nrequired by local law or ordinance.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "173",
                  "title" : "Heating",
                  "docType" : "SECTION",
                  "docLevelId" : "173",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 79,
                  "repealedDate" : null,
                  "fromSection" : "173",
                  "toSection" : "173",
                  "text" : "  § 173. Heating. Every new dwelling shall be provided with heat in all\\nliving rooms sufficient to maintain the minimum temperatures required by\\nlocal law, ordinances, rules or regulation, or by the local public\\nhealth officer, provided, however, that such minimum temperature shall,\\nnotwithstanding the provisions of subdivision one of section three\\nhundred twenty-nine of this chapter, be sixty-eight degrees Fahrenheit\\nduring the hours between six o'clock in the morning and ten o'clock in\\nthe evening during the months between October first and May\\nthirty-first, whenever the outdoor temperature falls below fifty-five\\ndegrees Fahrenheit.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "174",
                  "title" : "Repairs and cleanliness",
                  "docType" : "SECTION",
                  "docLevelId" : "174",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 80,
                  "repealedDate" : null,
                  "fromSection" : "174",
                  "toSection" : "174",
                  "text" : "  § 174. Repairs and cleanliness. The owner shall keep all and every\\npart of a dwelling and the lot on which it is situated in good repair,\\nclean and free from vermin, rodents, dirt, filth, garbage or other thing\\nor matter dangerous to life or health; but the tenant shall also be\\nliable if a violation is caused by his own wilful act, assistance or\\nnegligence or that of any member of his family or household or his\\nguests.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 5
              },
              "repealed" : false
            } ],
            "size" : 4
          },
          "repealed" : false
        }, {
          "lawId" : "MRE",
          "lawName" : "Multiple Residence",
          "locationId" : "A6",
          "title" : "Fireproof New Multiple Dwellings",
          "docType" : "ARTICLE",
          "docLevelId" : "6",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 81,
          "repealedDate" : null,
          "fromSection" : "200",
          "toSection" : "215",
          "text" : "                                ARTICLE 6\\n                    FIREPROOF NEW MULTIPLE DWELLINGS\\nSection 200. Application of article six.\\n                                 TITLE 1\\n                             FIRE PROTECTION\\nSection 201. Requirements for fireproof construction.\\n        202. Egress from dwellings.\\n        203. Egress from apartments.\\n        204. Bulkheads.\\n        205. Separation and ventilation of stairs.\\n        206. Cellar and basement stairs.\\n        207. Public halls.\\n                                 TITLE 2\\n                               SANITATION\\nSection 215. Interior water-closets and bathrooms.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "200",
              "title" : "Application of article six",
              "docType" : "SECTION",
              "docLevelId" : "200",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 82,
              "repealedDate" : null,
              "fromSection" : "200",
              "toSection" : "200",
              "text" : "  § 200. Application of article six. The provisions of this article\\nshall apply only to fireproof new multiple dwellings of permanent or\\ntransient occupancy, and shall apply in addition to and not in\\nsubstitution for the provisions of articles two and five, and in the\\ncase of transient dwellings, sections fifty-three, fifty-six, and\\nsixty-one of article four.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "A6T1",
              "title" : "Fire Protection",
              "docType" : "TITLE",
              "docLevelId" : "1",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 83,
              "repealedDate" : null,
              "fromSection" : "201",
              "toSection" : "207",
              "text" : "                                 TITLE 1\\n                             FIRE PROTECTION\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "201",
                  "title" : "Requirements for fireproof construction",
                  "docType" : "SECTION",
                  "docLevelId" : "201",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 84,
                  "repealedDate" : null,
                  "fromSection" : "201",
                  "toSection" : "201",
                  "text" : "  § 201. Requirements for fireproof construction. 1. Every new multiple\\ndwelling exceeding six stories or seventy-five feet in height shall be\\nfireproof.\\n  2. The foregoing requirements shall not be construed as prohibiting:\\n  a. Elsewhere than within, or in the openings to, the public halls,\\nstairs and shafts, the use of wood for sleepers, grounds, nailing\\nblocks, underflooring, finish flooring, interior doors with their\\nassemblies and saddles, floor base not more than one foot in height,\\npicture and wall moulding, shelving, closet and kitchen fixtures,\\ncupboards, cabinets and wardrobes.\\n  b. The use of wood for window and for interior trim and finish backed\\nsolidly against, or filled with, incombustible material and elsewhere\\nthan within, or in the openings to, the public halls, stairs and shafts.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "202",
                  "title" : "Egress from dwellings",
                  "docType" : "SECTION",
                  "docLevelId" : "202",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 85,
                  "repealedDate" : null,
                  "fromSection" : "202",
                  "toSection" : "202",
                  "text" : "  § 202. Egress from dwellings. 1. Nursing and convalescent homes, homes\\nfor the aged and boarding and nursery schools, two stories in height\\nerected after July first, nineteen hundred fifty-seven, child caring\\ninstitutions, two stories in height erected after July first, nineteen\\nhundred sixty-two, and all dwellings three or more stories in height\\nshall have at least two fire-stairs. Except as otherwise specifically\\nprovided in subdivision four, such fire-stairs shall extend from the\\nentrance story to the roof and be equipped with fireproof self-closing\\ndoors glazed with wire glass and without transoms. No windows shall be\\nrequired in such stairs, but any openings in exterior walls, except any\\nwindow openings facing a street or yard, shall be equipped with\\nfireproof frame and sash and glazed with wire glass.\\n  2. Every such fire-stair shall have an entrance on the entrance story\\nfrom a street or an entrance at the side or rear of the dwelling from a\\nyard, court or passageway having continuous, safe and unobstructed\\naccess to a street. Every required stair and stair-landing shall be at\\nleast three feet eight inches in clear width.\\n  3. There shall be horizontal access from every apartment to at least\\ntwo fire-stairs, at least one of which shall be within one hundred feet\\nhorizontally in the line of travel from a required means of egress from\\nsuch apartment.\\n  4. A dwelling as a rule transiently or temporarily occupied, in which\\nat least eighty per centum of the living rooms above the second story\\nopen directly upon a public hall without any intervening foyer or\\nprivate hall, shall have at least two fire-stairs accessible at each\\nstory from each room through a public hall. Such fire-stairs shall be so\\nlocated that at least one fire-stair shall be not more than one hundred\\ntwenty-five feet along the line of travel from the means of egress from\\nany living room. Every such fire-stair shall have a clear width of at\\nleast three feet eight inches. Two such fire-stairs shall be deemed\\nadequate for seventy living rooms on any story.\\n  5. Nursing and convalescent homes, homes for the aged, and boarding\\nand nursery schools, one story in height, erected after July first,\\nnineteen hundred fifty-seven, and child caring institutions, one story\\nin height, erected after July first, nineteen hundred sixty-two, shall\\nhave at least two means of egress from the dwelling accessible to every\\napartment providing free and unobstructed egress by a door opening to\\nthe outer air.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "203",
                  "title" : "Egress from apartments",
                  "docType" : "SECTION",
                  "docLevelId" : "203",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 86,
                  "repealedDate" : null,
                  "fromSection" : "203",
                  "toSection" : "203",
                  "text" : "  § 203. Egress from apartments. 1. There shall be at least one means of\\negress from each apartment or suite on each and every story of such\\napartment or suite, and a second means of egress if the first means is\\nnot within forty feet of every living room in such apartment or suite on\\nsuch story.\\n  2. No means of egress from any apartment or suite shall open into any\\nstair or fire-stair required under the provisions of this section except\\nthrough a vestibule or public hall.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "204",
                  "title" : "Bulkheads",
                  "docType" : "SECTION",
                  "docLevelId" : "204",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 87,
                  "repealedDate" : null,
                  "fromSection" : "204",
                  "toSection" : "204",
                  "text" : "  § 204. Bulkheads. Every stair and fire-stair required by this chapter\\nto extend to the level of the roof shall extend to and through a\\nfireproof bulkhead or other fireproof enclosure in such roof. Such\\nbulkhead or enclosure shall give unobstructed access at all times to\\nsuch roof by means of a fireproof door and door assembly with the door\\nself-closing. Stairs to a bulkhead or enclosure shall have a handrail.\\nWhere the roof of a dwelling is pitched or sloped more than fifteen\\ndegrees, no bulkhead or stairs leading thereto shall be required.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "205",
                  "title" : "Separation and ventilation of stairs",
                  "docType" : "SECTION",
                  "docLevelId" : "205",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 88,
                  "repealedDate" : null,
                  "fromSection" : "205",
                  "toSection" : "205",
                  "text" : "  § 205. Separation and ventilation of stairs. 1. All stairs and\\nfire-stairs shall be completely separated from one another and from\\nevery elevator or other shaft by fireproof walls.  They shall be\\nconstructed of fireproof material throughout and shall contain no wood\\nor other inflammable material of any kind, except that handrails of\\nhardwood may be provided.\\n  2. Access to stairs and fire-stairs from any public vestibule or other\\npublic hall shall be through fireproof doors and assemblies, with the\\ndoors self-closing and at least three feet wide, or through pairs of\\nsuch doors at least four feet wide, containing in either case a fixed\\nsash glazed with wire glass at least one-quarter inch thick and at least\\nthree hundred sixty square inches in area.\\n  3. At the highest level of every stair and fire-stair there shall be\\nprovided a window or a skylight. At such termination, there shall also\\nbe an opening of at least one hundred forty-four square inches which\\nshall communicate directly to the outer air, which opening may be a part\\nof such window or skylight. Except as herein provided, such skylight\\nshall ccomply with the provisions of subdivision two of section one\\nhundred eight.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "206",
                  "title" : "Cellar and basement stairs",
                  "docType" : "SECTION",
                  "docLevelId" : "206",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 89,
                  "repealedDate" : null,
                  "fromSection" : "206",
                  "toSection" : "206",
                  "text" : "  § 206. Cellar and basement stairs. All inside cellar or basement\\nstairs shall be entirely enclosed with fireproof walls and be provided\\nwith fireproof doors and assemblies, with the doors self-closing, at all\\nopenings.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "207",
                  "title" : "Public halls",
                  "docType" : "SECTION",
                  "docLevelId" : "207",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 90,
                  "repealedDate" : null,
                  "fromSection" : "207",
                  "toSection" : "207",
                  "text" : "  § 207. Public halls. 1. Every public vestibule or other public hall\\nshall comply either with the applicable provisions of section two\\nhundred fifty-eight for non-fireproof dwellings, or with all of the\\nfollowing provisions:\\n  a. Every such public vestibule or hall shall be everywhere at least\\nthree feet eight inches in clear width and shall be separated from all\\nother parts of the dwelling by fireproof floors and walls.\\n  b. All openings from such a public vestibule or hall to stairs,\\nfire-stairs, shafts, apartments or suites shall be protected by\\nfire-proof doors and assemblies, with the doors self-closing, except\\nthat such doors and assemblies shall not be required in any transiently\\nor temporarily occupied fireproof dwelling for any apartment consisting\\nof one room opening directly upon a public hall.\\n  c. Such a public vestibule or hall shall not be required to have a\\nwindow, but if it does not have a window opening to the outer air it\\nshall be equipped for artificial lighting and ventilation.\\n  d. Any part of a public hall that is shut off from any other part of\\nsuch hall by a door or doors shall be deemed a separate hall.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 7
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "A6T2",
              "title" : "Sanitation",
              "docType" : "TITLE",
              "docLevelId" : "2",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 91,
              "repealedDate" : null,
              "fromSection" : "215",
              "toSection" : "215",
              "text" : "                                 TITLE 2\\n                               SANITATION\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "215",
                  "title" : "Interior water-closets and bathrooms",
                  "docType" : "SECTION",
                  "docLevelId" : "215",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 92,
                  "repealedDate" : null,
                  "fromSection" : "215",
                  "toSection" : "215",
                  "text" : "  § 215. Interior water-closets and bathrooms. 1. Except as otherwise\\nprovided in this section, water-closets, bath and shower rooms may be\\nventilated by windows or mechanically ventilated as prescribed in\\nsection one hundred seventy-one.\\n  2. In transiently occupied dwellings there shall be on each story at\\nleast two water-closet compartments for the first twenty living rooms or\\nfraction thereof and at least one additional water-closet compartment\\nfor each additional fifteen living rooms or fraction thereof.\\n  a. The water-closet compartments on each story shall be accessible\\nfrom every such living room on the story. Such water-closet compartments\\nmay be placed in one or more general toilet rooms.\\n  b. Every water-closet compartment of a general toilet containing\\nwater-closet compartments permitted under this subdivision shall have a\\nwindow opening to the outer air of the dimensions, kind and location\\nrequired in a living room of the same area by section one hundred three,\\nor be provided with a system of mechanical ventilation as prescribed in\\nsubdivision six of section one hundred seventy-one.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 1
              },
              "repealed" : false
            } ],
            "size" : 3
          },
          "repealed" : false
        }, {
          "lawId" : "MRE",
          "lawName" : "Multiple Residence",
          "locationId" : "A7",
          "title" : "Non-fireproof New Multiple Dwellings",
          "docType" : "ARTICLE",
          "docLevelId" : "7",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 93,
          "repealedDate" : null,
          "fromSection" : "250",
          "toSection" : "280",
          "text" : "                                ARTICLE 7\\n                  NON-FIREPROOF NEW MULTIPLE DWELLINGS\\nSection 250. Application of article seven.\\n                                 TITLE 1\\n                             FIRE PROTECTION\\nSection 251. Height limitation.\\n        252. Sub-curb uses.\\n        253. Construction of first floor.\\n        254. Egress from dwellings.\\n        255. Egress from apartments.\\n        256. Bulkheads and scuttles.\\n        257. Public stairs.\\n        258. Public halls.\\n        259. Cellar and basement stairs.\\n        260. One and two-story frame dwellings; area limitation.\\n                                 TITLE 2\\n                               SANITATION\\nSection 280. Water-closets and bathrooms.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "250",
              "title" : "Application of article seven",
              "docType" : "SECTION",
              "docLevelId" : "250",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 94,
              "repealedDate" : null,
              "fromSection" : "250",
              "toSection" : "250",
              "text" : "  § 250. Application of article seven. The provisions of this article\\nshall apply only to non-fireproof new dwellings of permanent or\\ntransient occupancy, and shall apply in addition to and not in\\nsubstitution for the provisions of articles two and five, and in the\\ncase of transient dwellings, sections fifty-three, fifty-six, and\\nsixty-one of article four.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "A7T1",
              "title" : "Fire Protection",
              "docType" : "TITLE",
              "docLevelId" : "1",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 95,
              "repealedDate" : null,
              "fromSection" : "251",
              "toSection" : "260",
              "text" : "                                 TITLE 1\\n                             FIRE PROTECTION\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "251",
                  "title" : "Height limitation",
                  "docType" : "SECTION",
                  "docLevelId" : "251",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 96,
                  "repealedDate" : null,
                  "fromSection" : "251",
                  "toSection" : "251",
                  "text" : "  § 251. Height limitation.  A dwelling not exceeding seventy-five feet\\nor six stories in height may be non-fireproof construction.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "252",
                  "title" : "Sub-curb uses",
                  "docType" : "SECTION",
                  "docLevelId" : "252",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 97,
                  "repealedDate" : null,
                  "fromSection" : "252",
                  "toSection" : "252",
                  "text" : "  § 252. Sub-curb uses. In all portions of such dwellings below the\\nlevel of the highest curb all structural members, partitions, furrings\\nand ceilings shall be constructed of incombustible materials.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "253",
                  "title" : "Construction of first floor",
                  "docType" : "SECTION",
                  "docLevelId" : "253",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 98,
                  "repealedDate" : null,
                  "fromSection" : "253",
                  "toSection" : "253",
                  "text" : "  § 253. Construction of first floor.  The first floor above the lowest\\ncellar, or, if there be no cellar, above the lowest story, shall be\\nfireproof or, if the dwelling be three stories or less in height,\\nfire-retarded.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "254",
                  "title" : "Egress from dwellings",
                  "docType" : "SECTION",
                  "docLevelId" : "254",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 99,
                  "repealedDate" : null,
                  "fromSection" : "254",
                  "toSection" : "254",
                  "text" : "  § 254. Egress from dwellings. 1. Nursing and convalescent homes, homes\\nfor the aged and boarding and nursery schools, two stories in height\\nerected after July first, nineteen hundred fifty-seven, child caring\\ninstitutions, two stories in height, erected after July first, nineteen\\nhundred sixty-two and all dwellings three or more stories in height\\nshall have at least two means of egress and, except as otherwise\\nprovided in the case of a pitched or sloped roof, shall extend to the\\nroof from an entrance story, street, court or yard. The entrances to\\nsuch means of egress at every story shall be at least fifteen feet\\ndistant from each other unless they are on opposite sides of a public\\nhall. One means of egress shall be a stair constructed as provided in\\nsection two hundred fifty-seven. The other means of egress shall be\\neither another such stair or a fire-stair or a fire-escape constructed\\nas provided in section one hundred thirty-three.\\n  2. If the number of living rooms on any story, or in any section of\\nany story, above the entrance story exceeds twenty, there shall be an\\nadditional stair or a fire-stair extending from the entrance story to\\nthe roof for each twenty rooms or fraction thereof on such story or\\nsection thereof in excess of twenty, except that no additional stair\\nshall be required for such excess on any story or section thereof if the\\nnumber of living rooms thereon does not exceed thirty and if in addition\\none stair serving such story or section and every entrance hall or other\\npublic hall connected therewith is everywhere four feet six inches or\\nmore in clear width.\\n  3. There shall be accessible from every apartment two means of egress\\nfrom the dwelling, one of which shall be an enclosed stair complying\\nwith the provisions of section two hundred fifty-seven within fifty feet\\nfrom a means of egress from such apartment.\\n  4. Nursing and convalescent homes, homes for the aged, and boarding\\nand nursery schools, one story in height, erected after July first,\\nnineteen hundred fifty-seven, and child caring institutions, one story\\nin height, erected after July first, nineteen hundred sixty-two, shall\\nhave at least two means of egress from the dwelling accessible to every\\napartment providing free and unobstructed egress by a door opening to\\nthe outer air.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "255",
                  "title" : "Egress from apartments",
                  "docType" : "SECTION",
                  "docLevelId" : "255",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 100,
                  "repealedDate" : null,
                  "fromSection" : "255",
                  "toSection" : "255",
                  "text" : "  § 255. Egress from apartments.  1. A dwelling three or more stories in\\nheight shall have at least two means of egress from every apartment or\\nsuite. Such means shall be remote from each other. Except where it opens\\ninto a stair as permitted in subdivision three, one means shall be to a\\npublic hall connecting with an enclosed stair or fire-stair not more\\nthan fifty feet distant from such means. The other required means of\\negress shall open either directly upon a fire-escape or a public\\nvestibule or other public hall connecting with a stair or fire-stair.\\n  2. Except as hereinafter provided for dwellings two stories or less in\\nheight, such vestibule, hall or stair shall be separated from the public\\nhall or stair, on which the first means of egress opens, by a fireproof\\nwall, unpierced except by a fireproof door and assembly with the door\\nself-closing. In a dwelling two stories or less in height, the\\nseparating wall may be fire-retarded.\\n  3. In a dwelling three stories or less in height and occupied by four\\nfamilies or less on each story, and in any section of a permanently\\noccupied dwelling which is two stories or less in height and occupied by\\nfour families or less on each story, a means of egress from an apartment\\nmay open directly into a stair without the intervention of a public\\nhall. Such means shall have a fireproof door and assembly with the door\\nself-closing and without a transom.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "256",
                  "title" : "Bulkheads and scuttles",
                  "docType" : "SECTION",
                  "docLevelId" : "256",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 101,
                  "repealedDate" : null,
                  "fromSection" : "256",
                  "toSection" : "256",
                  "text" : "  § 256. Bulkheads and scuttles.  1. Every required stair and fire-stair\\nin a dwelling three stories or more in height shall have a bulkhead\\nconstructed as provided for fireproof dwellings in section two hundred\\nfour.\\n  2. A dwelling which is two stories or less in height shall be provided\\nat each required stair or fire-stair either with such bulkhead or with a\\nscuttle at least two feet by three feet in size, located in the ceiling\\nof the public hall on the top story. Every such scuttle shall be\\narranged to be readily opened, shall be covered on the outside with\\nmetal and shall be provided with stairs or a stationary metal ladder\\nleading thereto and easily accessible to all the occupants of the\\ndwelling.\\n  3. When the roof of a dwelling is pitched or sloped more than fifteen\\ndegrees, no bulkhead or scuttle, or stair or ladder leading thereto,\\nshall be required.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "257",
                  "title" : "Public stairs",
                  "docType" : "SECTION",
                  "docLevelId" : "257",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 102,
                  "repealedDate" : null,
                  "fromSection" : "257",
                  "toSection" : "257",
                  "text" : "  § 257. Public stairs. 1. Every stair and fire-stair shall, except as\\notherwise provided in subdivisions three and four of this section and in\\nsection two hundred fifty-nine, be constructed as provided for\\nfire-stairs in sections two hundred two and two hundred five for\\nfireproof dwellings.\\n  2. Every stair and fire-stair shall be at least three feet in clear\\nwidth throughout, and at all floor levels shall have landings at least\\nthree feet eight inches in clear width.\\n  3. Every stair and fire-stair shall be completely separated from every\\nother stair and fire-stair and from every public hall and shaft by\\nfireproof walls, with fireproof doors and assemblies, with the doors\\nself-closing and without transoms, at all openings, except that in\\ndwellings two stories or less in height such walls may be fire-retarded.\\nThe doors giving access to such stairs shall not be held open by any\\ndevice whatever.\\n  4. Except in the case of an interior enclosed stair separated from and\\ndirectly accessible to the public hall by a self-closing fireproof door\\nand except as provided in subdivision five, there shall be provided to\\nlight and ventilate every stair at every story a window or windows\\nopening on a street, court or yard.\\n  5. In a dwelling occupied by two families or less on every story:\\n  a. If such dwelling is three stories or less in height, there may be\\nprovided for any stair, in lieu of windows, a stairwell sixteen inches\\nor more in clear width extending from the entrance story to the roof.\\n  b. If such dwelling is a permanently occupied dwelling and is two\\nstories or less in height, there may be provided for any stair, in lieu\\nof windows, a stairwell six inches or more in clear width. For the\\npurposes of this paragraph, a section of a permanently occupied dwelling\\nmay be deemed a separate multiple dwelling.\\n  c. If such dwelling is two stories in height and has no public hall on\\nthe first story, no stairwell or stair windows need be provided.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "258",
                  "title" : "Public halls",
                  "docType" : "SECTION",
                  "docLevelId" : "258",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 103,
                  "repealedDate" : null,
                  "fromSection" : "258",
                  "toSection" : "258",
                  "text" : "  § 258. Public halls. 1. Every public hall shall be everywhere at least\\nthree feet in clear width.\\n  2. Except as herein provided, every public hall shall be completely\\nenclosed with fireproof floor, ceiling and walls, and separated from\\nevery stair by fireproof partitions or walls, and all doors and their\\nassemblies opening therefrom shall be fireproof, with the doors\\nself-closing and without transoms. In a dwelling three stories or less\\nin height occupied by not more than four families on each story, or in a\\npermanently occupied dwelling or any section thereof two stories or less\\nin height, any such hall which furnishes access to only one stair need\\nnot be separated from such stair by any partition or door and the walls\\nof a public hall may be fire-retarded and the floors may be provided\\nwith three inches or more of incombustible materials between the beams.\\n  3. Except in dwellings three stories or less in height and occupied by\\ntwo families or less on every story, every public hall shall have at\\nleast one window opening directly upon a street or upon a lawful yard or\\ncourt. There shall be such a window at the end of such hall and at right\\nangles to its length, with an additional window in each forty feet of\\nhall or fraction thereof beyond the first sixty feet from such end\\nwindow; or the hall shall have one window opening directly upon a\\nstreet, yard or court, in every forty feet of the length of such hall or\\nfraction thereof measured from one end of the hall. Any part of a public\\nhall that is shut off from any other part of such hall by a door or\\ndoors shall be deemed a separate hall.\\n  4. The foregoing provisions of this section with regard to lighting\\nand ventilation shall not apply to a vestibule or other public hall\\nwhich serves as a means of access from one or more apartments opening\\nthereon to a fire-stair meeting the requirements of section two hundred\\ntwo if such vestibule or public hall is lighted and ventilated as\\nrequired by sections one hundred nine and two hundred seven.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "259",
                  "title" : "Cellar and basement stairs",
                  "docType" : "SECTION",
                  "docLevelId" : "259",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 104,
                  "repealedDate" : null,
                  "fromSection" : "259",
                  "toSection" : "259",
                  "text" : "  § 259. Cellar and basement stairs. A cellar or basement stair located\\ninside the dwelling shall be entirely enclosed with fireproof walls and\\nbe provided, at all openings, with fireproof doors and assemblies, with\\nthe doors self-closing, except that in any dwelling three stories or\\nless in height, such stair may be enclosed with walls or partitions\\nconstructed of fire-resistive materials.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                }, {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "260",
                  "title" : "One and two-story frame dwellings; area limitation",
                  "docType" : "SECTION",
                  "docLevelId" : "260",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 105,
                  "repealedDate" : null,
                  "fromSection" : "260",
                  "toSection" : "260",
                  "text" : "  § 260. One and two-story frame dwellings; area limitation.  A frame\\ndwelling not exceeding two stories in height erected pursuant to plans\\nfiled after April first, nineteen hundred fifty-nine, and containing an\\narea greater than three thousand square feet must, in addition to any\\nother applicable provisions of this article, comply with the following\\nprovisions:\\n  1. Fire-stopped partitions shall be constructed between apartments in\\nsuch dwelling so as to prevent the passage of fire, smoke or gases from\\none apartment to another.\\n  2. No section of such dwelling shall contain more than three thousand\\nsquare feet. Each such section shall be separated from all other\\nsections of the dwelling by fire walls of masonry or other materials\\nhaving a fire resistive rating of at least two hours. Such wall (1)\\nshall be unpierced except for openings for heat, utility and other\\nservice lines and ducts with such openings sealed with incombustible\\nmaterials (2) shall extend continuously from the floor of the lowest\\nlevel of the dwelling, to at least two feet above the level of the\\nfinished roof and (3) be fire-stopped at floors and roof in such manner\\nas to prevent the passage of fire, smoke or gases between sections.\\nWhere there is a peaked or sloped roof, such wall may terminate at the\\ntop of the roof boards.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 10
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "A7T2",
              "title" : "Sanitation",
              "docType" : "TITLE",
              "docLevelId" : "2",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 106,
              "repealedDate" : null,
              "fromSection" : "280",
              "toSection" : "280",
              "text" : "                                 TITLE 2\\n                               SANITATION\\n",
              "documents" : {
                "items" : [ {
                  "lawId" : "MRE",
                  "lawName" : "Multiple Residence",
                  "locationId" : "280",
                  "title" : "Water-closets and bathrooms",
                  "docType" : "SECTION",
                  "docLevelId" : "280",
                  "activeDate" : "2014-09-22",
                  "sequenceNo" : 107,
                  "repealedDate" : null,
                  "fromSection" : "280",
                  "toSection" : "280",
                  "text" : "  § 280. Water-closets and bathrooms. The requirements for water-closet\\ncompartments, bath and shower rooms shall be the same as provided in\\nsection two hundred fifteen for fireproof dwellings, except that each\\nrequired water-closet compartment, bath or shower room in an apartment\\nshall be ventilated by a window opening to the outer air as provided in\\nsection one hundred seventy-one.  Water-closet compartments, bath and\\nshower rooms which are supplementary to those required under the\\nprovisions of sections one hundred seventy-one and two hundred fifteen\\nmay be mechanically or gravity ventilated as provided in section one\\nhundred seventy-one.\\n",
                  "documents" : {
                    "items" : [ ],
                    "size" : 0
                  },
                  "repealed" : false
                } ],
                "size" : 1
              },
              "repealed" : false
            } ],
            "size" : 3
          },
          "repealed" : false
        }, {
          "lawId" : "MRE",
          "lawName" : "Multiple Residence",
          "locationId" : "A8",
          "title" : "Requirements and Remedies",
          "docType" : "ARTICLE",
          "docLevelId" : "8",
          "activeDate" : "2019-11-08",
          "sequenceNo" : 108,
          "repealedDate" : null,
          "fromSection" : "300",
          "toSection" : "307",
          "text" : "                                ARTICLE 8\\n                        REQUIREMENTS AND REMEDIES\\nSection 300.   Registry of owner.\\n        301.   Permits.\\n        302.   Certificate of occupancy.\\n        302-a. Unlawful occupation.\\n        303.   Enforcement.\\n        304.   Penalties for violations.\\n        305.   Nuisances.\\n        305-a. Abatement of rent in the case of serious violations.\\n        305-c. Right of tenant to offset payments for heat failure;\\n                 certain cases.\\n        306.   Service of notices and orders.\\n        307.   Records and searches.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "300",
              "title" : "Registry of owner",
              "docType" : "SECTION",
              "docLevelId" : "300",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 109,
              "repealedDate" : null,
              "fromSection" : "300",
              "toSection" : "300",
              "text" : "  § 300. Registry of owner. On or before July first, nineteen hundred\\nfifty-four, every owner of a multiple dwelling shall file with the\\ndepartment a statement, in duplicate, on a form to be prepared by the\\ndepartment substantially as follows:\\nOwner of record: .......................................................\\nStreet No. or other identifying description: ...........................\\nType of construction: ..................................................\\n                                  (frame, brick, stucco, etc.)\\nHeight of building: ................No. of stories: ....................\\nNumber of rooms or apartments for which designed: ......................\\nNumber of persons in occupancy: ........................................\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "301",
              "title" : "Permits",
              "docType" : "SECTION",
              "docLevelId" : "301",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 110,
              "repealedDate" : null,
              "fromSection" : "301",
              "toSection" : "301",
              "text" : "  § 301. Permits. 1. It shall be unlawful to commence the construction\\nor alteration of a multiple dwelling or any part or section thereof, or\\nof any building or structure on the same lot with such a dwelling, or\\nthe alteration or conversion of a building for use as a multiple\\ndwelling, or the moving of a dwelling from one lot to another, until an\\napplication or plans have been filed in and a permit issued by the\\ndepartment. The department shall have the power to charge and collect a\\nreasonable fee for each application filed and for each permit issued.\\n  2. No person shall be recognized as the agent of the owner unless he\\nshall file with the department a written instrument, signed by the\\nowner, designating him as such agent. Upon the filing of such\\ninstrument, the person designated therein as such agent shall be deemed\\nto be and shall be known as the certified agent of the owner.\\n  3. The department shall have power to issue, refuse, revoke or cancel\\nany permit or approval in case of any failure to comply with any of the\\nprovisions of this chapter, or in case any false allegation or\\nrepresentation is made in any plans or statements submitted or filed for\\nsuch permit or approval. If such permit is refused, revoked or\\ncancelled, the reason for such action shall be recorded by the\\ndepartment.\\n  4. All plans, statements and permits filed in any department shall be\\npublic records and shall not be destroyed or removed from the\\ndepartment.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "302",
              "title" : "Certificate of occupancy",
              "docType" : "SECTION",
              "docLevelId" : "302",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 111,
              "repealedDate" : null,
              "fromSection" : "302",
              "toSection" : "302",
              "text" : "  § 302. Certificate of occupancy. 1. No multiple dwelling shall be\\noccupied in whole or in part until the issuance of a certificate by the\\ndepartment that said dwelling conforms in all respects to the\\nrequirements of this chapter, except that no such certificate shall be\\nrequired for any multiple dwelling existing on July first, nineteen\\nhundred fifty-two, for which a certificate of occupancy was not required\\nbefore such date and in which no changes or alterations commenced on or\\nafter such date have been made except in compliance with this chapter,\\nand except that a certificate shall be required prior to July first,\\nnineteen hundred fifty-seven for any dwelling, the plans for the\\nalteration or conversion of which to multiple dwelling occupancy were on\\nfile with the department or a permit authorizing such conversion was\\nissued before such date and for which a certificate of occupancy upon\\ncompletion of such conversion or alteration was not required before such\\ndate. This exception shall not be deemed to relieve any owner from the\\nobligation to make such dwelling comply with the applicable provisions\\nof this chapter.\\n  2. Except as above provided, no dwelling constructed as or altered or\\nconverted into a multiple dwelling on or after July first, nineteen\\nhundred fifty-two, shall be occupied in whole or in part until the\\nissuance of a certificate of occupancy.\\n  3. The department shall, on request of the owner or of his certified\\nagent, issue a certificate of occupancy for any old multiple dwelling\\nnot requiring such certificate, provided that, after an inspection by\\nthe department, no violations are found against such dwelling.\\n  4. A certificate of occupancy shall be issued within ten days after\\nwritten application therefor, if the dwelling shall be entitled thereto.\\nWhen the department does not issue such certificate within ten days, the\\nhead of the department shall, on the request of the owner or his\\ncertified agent, issue a temporary certificate of occupancy for a\\nmultiple dwelling or a section or a part thereof for a period of ninety\\ndays or less, provided that such certificate shall bear the endorsement\\nthat the dwelling has been inspected by the department and complies with\\nall the requirements of this chapter, and that such temporary occupancy\\nwill not jeopardize life, health or property. Such temporary certificate\\nmay be renewed at the discretion of the head of the department for\\nsimilar periods but shall not extend, together with such renewals,\\nbeyond one year from the date of its original issuance.\\n  5. A certificate, a record in the department, or a statement signed by\\nthe head of the department that a certificate has been issued, may be\\nrelied upon by every person who in good faith purchases a multiple\\ndwelling or who in good faith lends money upon the security of a\\nmortgage covering such a dwelling. Whenever any person has so relied\\nupon such a certificate, no claim that such dwelling had not, prior to\\nthe issuance of such certificate, conformed in all respects to the\\nprovisions of this chapter shall be made against such person or his\\nsuccessor in title or ownership with respect to such multiple dwelling\\nor mortgage, or against the interest of any such person with respect\\nthereto.\\n  6. Notwithstanding any general or local law to the contrary, a\\ncertificate issued for any multiple dwelling organized pursuant to the\\nprovisions of article nine-B of the real property law, shall be deemed\\nissued for each dwelling unit contained within such multiple dwelling in\\nfull compliance with the requirements of this section.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "302-A",
              "title" : "Unlawful occupation",
              "docType" : "SECTION",
              "docLevelId" : "302-A",
              "activeDate" : "2019-11-08",
              "sequenceNo" : 112,
              "repealedDate" : null,
              "fromSection" : "302-A",
              "toSection" : "302-A",
              "text" : "  § 302-a. Unlawful occupation. 1. If any dwelling or structure be\\noccupied in whole or in part for human habitation in violation of\\nsection three hundred two of this article, no rent shall be recovered by\\nthe owner of such premises for said period, and no action for possession\\nof said premises for nonpayment of such rent shall be maintained\\ntherefor.\\n  2. The department charged with the enforcement of this chapter may\\ncause to be vacated any dwelling or any part thereof which contains a\\nnuisance as defined in section three hundred five of this article, or is\\noccupied by more families or persons than permitted in this chapter, or\\nis erected, altered or occupied contrary to law. Any such dwelling shall\\nnot again be occupied until it or its occupancy, as the case may be, has\\nbeen made to conform to law.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "303",
              "title" : "Enforcement",
              "docType" : "SECTION",
              "docLevelId" : "303",
              "activeDate" : "2019-01-11",
              "sequenceNo" : 113,
              "repealedDate" : null,
              "fromSection" : "303",
              "toSection" : "303",
              "text" : "  § 303. Enforcement. 1. The provisions of this chapter shall be\\nenforced within each municipality by a person or department charged with\\nsuch duty as provided in this section, provided, however, that in the\\ncase of a town such person or department shall have power and\\njurisdiction concerning such enforcement only with respect to such part\\nof the town as is outside the limits of any village or city. Whenever in\\nany city or village there is a person or department enforcing any\\nbuilding code, or in any town there is a person or department enforcing\\nany building code with respect to the whole or the portion thereof\\noutside the limits of any village or city, the provisions of this\\nchapter shall be enforced by such person or department in such city or\\nvillage, or in such town or portion thereof, respectively. If there be\\nno such person or department in and for a city or village, or in a town\\nfor the whole or the portion thereof outside the limits of any city or\\nvillage, the chief executive officer or, if there be none, the chief\\nadministrative body or board of the city, village, or town,\\nrespectively, shall have the power to and shall organize a department or\\nshall designate or employ a person or department for the enforcement of\\nthis chapter in such city or village, or in such town or portion\\nthereof, respectively, and the provisions of this chapter shall be\\nenforced therein by the department so organized or the person or\\ndepartment so designated or employed. The person so designated or\\nemployed to enforce this chapter in a city or village or in a town or\\nportion thereof, or in two or more of them acting jointly, as\\nhereinafter provided, need not be an elector of the city, village or\\ntown, or of any of them, as the case may be, in or for which he is so\\ndesignated or employed. A person assigned as a fire department inspector\\npursuant to subdivision four of this section shall not by virtue of such\\nassignment be disqualified from holding the office of enforcement\\nofficer.\\n  2. One such person or department may be designated or employed by two\\nor more cities, villages or towns, acting jointly, for the enforcement\\nof this chapter in such cities or villages, or in such towns or portions\\nthereof, respectively, and such cities, villages and towns may make and\\nperform agreements in connection therewith. Where two or more\\nmunicipalities are so jointly acting, provision shall be made by each\\nmunicipality for the appropriation, custody, audit, approval and payment\\nof funds sufficient to defray the expense of operation of such person or\\ndepartment, including salaries, in such municipality or municipalities\\nor portion or portions thereof. Any joint agreement made as provided in\\nthis section shall include provisions for the proportionate cost of the\\nexpense of operation of such person or department, including salaries,\\nto be borne by each municipality or portion thereof and the manner of\\nemployment of personnel and may provide that a fiscal officer of one\\nsuch municipality shall be the custodian of the moneys made available\\nfor expenditure for the purposes of such enforcement by all such\\nmunicipalities or portions thereof and that such fiscal officer may make\\npayments therefrom upon audit of the appropriate auditing body or\\nofficer of his municipality. In providing for the enforcement of this\\nchapter in any municipality or portion thereof, a municipality may also\\ncontract with another municipality to enforce this chapter within such\\nmunicipality or portion thereof as required by this chapter, under such\\nterms and conditions as may be stated in such contract, and any amount\\nagreed to be paid under such contract shall be a charge upon the\\nmunicipality or portion thereof for which such enforcement is provided\\nand shall be paid in the same manner as other charges of the\\nmunicipality.\\n  3. The person or department charged with the duty of enforcing the\\nprovisions of this chapter in a municipality or portion thereof shall\\nhave power to enter, examine, and inspect, or cause to be examined and\\ninspected, any building or property for the purpose of carrying out the\\nduties of such person or department under this chapter. Such person or\\ndepartment is authorized and empowered to issue departmental notices and\\norders and is authorized to institute appropriate judicial action or\\nproceeding to enforce any building code.\\n  4. The fire department of any city, village or fire district, the fire\\ndepartment of any town which as such has a fire department, and any fire\\ncompany located in the area of a town outside villages and fire\\ndistricts, may, with the approval of the chief executive officer or, if\\nthere be none, the chief administrative body or board of the city,\\nvillage or town, respectively, assign to one or more members of the fire\\ndepartment or company, as the case may be, the duty of making\\ninspections of buildings and properties which are subject to the\\nprovisions of this chapter and are located in the area regularly served\\nand protected by such fire department or company including areas\\nprotected pursuant to a contract. The purpose of any such inspection\\nshall be to determine whether the provisions of this chapter and the\\nrules and regulations adopted and promulgated pursuant thereto in\\nrelation to fire protection and safety are being complied with.\\nFirefighters assigned to such duty shall have full power and authority\\nto enter, examine and inspect any such building or property at such\\ntimes and hours as are reasonably convenient. It shall be the duty of\\nany firefighter so assigned to report any violations of such provisions\\nof this chapter or of such rules and regulations to the person or\\ndepartment charged with the duty of enforcing the provisions of this\\nchapter in the city, town or village in which the building or property\\nis located and also to the chief of his or her fire department or fire\\ncompany, as the case may be. In the event that an area is served\\npursuant to a fire protection contract by more than one fire department\\nor fire company, the firefighter or firefighters assigned to perform\\nsuch duty in such area shall report violations to the chief of each fire\\ndepartment and fire company serving such area. The failure of any such\\nfirefighter to discover and properly report any such violations or his\\nneglect or omission to perform such duties, shall not subject him or\\nher, his or her fire department, fire company, or the city, village,\\nfire district or town in which or of which he or she is a firefighter to\\nany civil or other liability. Any such firefighter shall not be liable\\ncivilly for any act or acts done by him or her as a firefighter in the\\nperformance of such duties, except for wilful negligence or malfeasance,\\nbut the provisions of this subdivision shall not relieve any such city,\\nvillage, fire district, town, or fire company from liability, if any,\\nfor the negligent or wrongful acts of the firefighter in the actual\\nperformance of such duty. Firefighters assigned to any such duty may be\\nknown as fire inspectors but shall not, by reason of this law, be an\\nofficer of any city, village, fire district or town or of any fire\\ndepartment or fire company. Unless otherwise provided by some other law,\\ngeneral, special or local, any such assignment of duty and the\\ntermination of any such assignment shall be made by the chief of the\\nfire department or the fire company, as the case may be. Before any such\\ninspection is made, the firefighter assigned to perform such duty must\\nbe approved by the chief executive officer or, if there be none, the\\nchief administrative body or board of the city, village or town,\\nrespectively, in which the inspection will be made.\\n  5. Pending the organization of a department or designation of a person\\nor department for the enforcement of this chapter in any city or\\nvillage, or in a town outside any city or village, the chief executive\\nofficer, or if there be none, the chief administrative body or board of\\nthe city, village or town, shall be charged with the duty of enforcing\\nthe provisions of this chapter in such city or village, or in such town\\noutside a city or village, until such time as a department is organized\\nor a person or department is designated or employed to enforce the\\nprovisions of this chapter.\\n  6. Notwithstanding the foregoing provisions of this section, this\\nchapter shall be enforced within the county of Hamilton, in the manner\\nprovided in this subdivision. On or before September first, nineteen\\nhundred fifty-four, the board of supervisors of such county may, by\\nlocal law, create an office or department, or designate a county office\\nor department, for the purpose of enforcing the provisions of this\\nchapter within such county. The office or department so created or\\ndesignated shall succeed to and become vested with the duty of enforcing\\nthe provisions of this chapter within each municipality in such county.\\nAll provisions of this chapter, not inconsistent with this subdivision,\\nshall apply to the enforcement of this chapter within such county by the\\noffice or department so created or designated. The cost and expense of\\nsuch enforcement shall be a county charge. In the event such board of\\nsupervisors shall fail to provide for the enforcement of this chapter\\npursuant to the foregoing provisions of this subdivision by such date,\\nthen and in such event, the provisions of this chapter shall be enforced\\nwithin each municipality in such county in the manner hereinbefore\\nprovided in this section.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "304",
              "title" : "Penalties for violations",
              "docType" : "SECTION",
              "docLevelId" : "304",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 114,
              "repealedDate" : null,
              "fromSection" : "304",
              "toSection" : "304",
              "text" : "  § 304. Penalties for violations. 1. Any person, who having been served\\nwith a notice or order to remove any violation of this chapter or of any\\nnuisance, fails to comply therewith within thirty days or within such\\nfurther reasonable time therefore fixed by the department, shall be\\nguilty of a misdemeanor punishable for each offense by a fine of not\\nexceeding five hundred dollars or by imprisonment for a period of one\\nyear, or by both such fine and imprisonment. However, every person who\\nshall violate or assist in a violation of any provision of sections\\nforty, seventy and one hundred seventy-four shall be guilty of an\\noffense punishable by a fine of not less than ten dollars nor exceeding\\nfive hundred dollars or by imprisonment for a period not exceeding six\\nmonths, or by both such fine and imprisonment. Courts of special\\nsessions shall have exclusive jurisdiction in the municipalities to\\nwhich this chapter is applicable to hear and determine charges of\\nviolations constituting misdemeanors or offenses under this chapter.\\n  2. The term \"person\" as used in this section shall include the owner,\\nmortgagee or vendee in possession, assignee of rents, receiver,\\nexecutor, trustee, lessee, agent or any other person, firm or\\ncorporation directly or indirectly in control of a dwelling or part\\nthereof.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "305",
              "title" : "Nuisances",
              "docType" : "SECTION",
              "docLevelId" : "305",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 115,
              "repealedDate" : null,
              "fromSection" : "305",
              "toSection" : "305",
              "text" : "  § 305. Nuisances. 1. The term nuisance shall be held to embrace\\nwhatever is dangerous to human life or detrimental to health and shall\\ninclude but not be limited to: (a) a public nuisance as known at common\\nlaw, statutory law and in equity jurisprudence, and (b) a dwelling that,\\nin violation of this chapter or of any other state or local law,\\nordinance or regulation, does not have adequate egress, safeguards\\nagainst fire, adequate electrical service, installation and wiring,\\nstructural support, ventilation, plumbing, sewerage or drainage\\nfacilities, is overcrowded or inadequately cleaned or lighted and the\\ncondition constituting such violation is dangerous to human life or\\ndetrimental to health. All such nuisances are hereby declared to be\\nunlawful.\\n  2. Whenever the department shall declare that a dwelling is a\\nnuisance, it shall serve a notice or order in the manner prescribed by\\nsection three hundred six of this chapter, reciting the facts\\nconstituting such nuisance, specifying in what respect the dwelling is\\ndangerous to human life or detrimental to health and requiring the owner\\nto remove such nuisance within thirty days after service of such notice\\nor order or such lesser period of time where an emergency exists as may\\nbe determined by the department head. Such notice or order shall provide\\nthat, if the owner fails to remove such nuisance within such period for\\ncompliance so prescribed, the department may remove or cause the removal\\nof such nuisance by cleansing, repairing, vacating, demolishing or by\\ntaking such other corrective action deemed necessary and shall notify\\nthe owner of his right to a hearing as hereinafter provided.\\n  Wherever such notice is given, the owner may request a hearing before\\nthe head of the department charged with enforcement, and a hearing shall\\nbe given such owner prior to the expiration of the period for compliance\\nso prescribed.\\n  3. a. If such nuisance is not removed by the owner within the time\\nheretofore prescribed after service of such notice or order, the\\ndepartment may proceed with the removal of such nuisance as provided in\\nthe notice or order.\\n  b. If the owner refuses to permit the department to remove or cause\\nthe removal of such nuisance by cleansing, repairing, vacating,\\ndemolishing or by taking such other corrective action as may be\\nnecessary, or interferes in any way with the department or causes delay\\nto the taking of corrective action, the department may cause such\\ndwelling, in whole or in part, to be vacated and sealed up or vacated\\nand demolished, but, in such case, the department shall commence a\\nspecial proceeding in the supreme court for such relief. During the\\npendency of such proceeding, the department may obtain a temporary order\\nfor the immediate vacating of such dwelling, upon proof of a present\\ndanger to human life or detriment to health. In addition to the owner,\\nall tenants, mortgagees and lienors of record shall be necessary parties\\nto such special proceeding.\\n  4. a. If the department proceeds to execute a notice or order issued\\nby it or by the court for the removal of a nuisance, the department may\\nlet contracts therefor, in accordance with the provisions of any local\\nlaws, ordinances, rules and regulations of the municipality applicable\\nto the letting of contracts for municipal improvements.  The cost of\\nexecuting such notice or order or orders whether or not carried out\\npursuant to court order shall be met from any appropriation made\\ntherefor, or if such appropriation has not been made or is insufficient,\\nfrom the proceeds of the sale of obligations pursuant to the local\\nfinance law. The department shall keep a record of such notices and\\norders together with the acts done and the items of cost incurred in\\ntheir execution.\\n  b. The municipality shall have a lien upon the premises of the\\ndwelling for the cost of executing such notice or order or orders for\\nthe removal of a nuisance and shall file a notice of such lien in the\\noffice of the clerk where notices of mechanics' liens are filed; and all\\nproceedings with respect to such lien, its enforcement and discharge\\nshall be carried on in the same manner as proceedings with respect to\\nmechanics' liens under the lien law.\\n  c. Notwithstanding the foregoing and in addition to any other remedy\\navailable, the department may maintain an action against the owner to\\nrecover the cost of executing such notice or order or orders.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "305-A",
              "title" : "Abatement of rent in the case of serious violations",
              "docType" : "SECTION",
              "docLevelId" : "305-A",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 116,
              "repealedDate" : null,
              "fromSection" : "305-A",
              "toSection" : "305-A",
              "text" : "  § 305-a. Abatement of rent in the case of serious violations. 1.  The\\nprovisions of this section shall apply to all cities of less than five\\nhundred thousand population and to all towns and villages.\\n  2. a. A \"rent impairing\" violation within the meaning of this section\\nshall designate a condition in a multiple dwelling which, in the opinion\\nof the state building code council, constitutes, or if not promptly\\ncorrected, will constitute, a fire hazard or a serious threat to the\\nlife, health or safety of occupants thereof.\\n  b. The determination as to which violations are \"rent impairing\" shall\\nbe made in the following manner. Within six months after the enactment\\nof this section, the state building code council shall promulgate a list\\nof conditions constituting violations of the provisions of this chapter\\nand of any regulations promulgated pursuant to the provisions of\\nsubdivision three of section three of this chapter.  Such list shall\\ncontain a brief description of the condition constituting the violation,\\nthe section of this chapter or regulation violated, and the order number\\nassigned thereto. Such council may from time to time change the number\\nor description of violations on such list, as may seem appropriate to\\nsuch council. Such list shall be available at all times to the public.\\n  c. At the time of the promulgation of the list of violations, the\\nstate building code council shall also designate, by reference to the\\norder number, those violations which it proposes to classify as rent\\nimpairing as above defined. Within thirty days thereafter, such council\\nshall hold a public hearing at which all persons interested may be heard\\nas to the propriety of the classification of such violations as rent\\nimpairing. Within a reasonable time after the hearing, such council\\nshall make and publish a list of those violations which are classified\\nas rent impairing. Any person interested may, within four months\\nthereafter, seek a review by the supreme court of the propriety of the\\nclassification of any of such violations as \"Rent Impairing\" by a\\nspecial proceeding pursuant to article seventy-eight of the civil\\npractice law and rules. No other body or officer shall have the power to\\nreview said classification.\\n  d. The state building code council may at any time change the number\\nor description of rent impairing violations but no such change shall be\\nmade except in the manner above set forth after notice and public\\nhearing.\\n  3. a. If (i) the official records of the department shall note that a\\nrent impairing violation exists in respect to a multiple dwelling and\\nthat notice of such violation has been given by the department, by mail,\\nto the owner last registered with the department and (ii) such note of\\nthe violation is not cancelled or removed of record within six months\\nafter the date of such notice of such violation, then for the period\\nthat such violation remains uncorrected after the expiration of said six\\nmonths, no rent shall be recovered by any owner for any premises in such\\nmultiple dwelling used by a resident thereof for human habitation in\\nwhich the condition constituting such rent impairing violation exists,\\nprovided, however, that if the violation is one that requires approval\\nof plans by the department for the corrective work and if plans for such\\ncorrective work shall have been duly filed within three months from the\\ndate of notice of such violation by the department to the owner last\\nregistered with the department, the six-months period aforementioned\\nshall not begin to run until the date that plans for the corrective work\\nare approved by the department; if plans are not filed within said\\nthree-months period or if so filed, they are disapproved and amendments\\nare not duly filed within thirty days after the date of notification of\\nthe disapproval by the department to the person having filed the plans,\\nthe six-months period shall be computed as if no plans whatever had been\\nfiled under this proviso. If a condition constituting a rent impairing\\nviolation exists in the part of a multiple dwelling used in common by\\nthe residents or in the part under the control of the owner thereof, the\\nviolation shall be deemed to exist in the respective premises of each\\nresident of the multiple dwelling.\\n  b. The provisions of subparagraph a shall not apply if (i) the\\ncondition referred to in the department's notice to the owner last\\nregistered with the department did not in fact exist, notwithstanding\\nthe notation thereof in the records of the department; (ii) the\\ncondition which is the subject of the violation has in fact been\\ncorrected, though the note thereof in the department has not been\\nremoved or cancelled; (iii) the violation has been caused by the\\nresident from whom rent is sought to be collected or by members of his\\nfamily or by his guests or by another resident of the multiple dwelling\\nor the members of the family of such other resident or by his guests, or\\n(iv) the resident proceeded against for rent has refused entry to the\\nowner for the purpose of correcting the condition giving rise to the\\nviolation.\\n  c. To raise a defense under subparagraph a in any action to recover\\nrent or in any special proceeding for the recovery of possession because\\nof non-payment of rent, the resident must affirmatively plead and prove\\nthe material facts under subparagraph a, and must also deposit with the\\nclerk of the court in which the action or proceeding is pending at the\\ntime of filing of the resident's answer the amount of rent sought to be\\nrecovered in the action or upon which the proceeding to recover\\npossession is based, to be held by the clerk of the court until final\\ndisposition of the action or proceeding at which time the rent deposited\\nshall be paid to the owner, if the owner prevails, or be returned to the\\nresident if the resident prevails.  Such deposit of rent shall vitiate\\nany right on the part of the owner to terminate the lease or rental\\nagreement of the resident because of nonpayment of rent.\\n  d. If a resident voluntarily pays rent or an installment of rent when\\nhe would be privileged to withhold the same under subparagraph a, he\\nshall not thereafter have any claim or cause of action to recover back\\nthe rent or installment of rent so paid. A voluntary payment within the\\nmeaning hereof shall mean payment other than one made pursuant to a\\njudgment in an action or special proceeding.\\n  e. If upon the trial of any action to recover rent or any special\\nproceeding for the recovery of possession because of non-payment of rent\\nit shall appear that the resident has raised a defense under this\\nsection in bad faith, or has caused the violation or has refused entry\\nto the owner for the purpose of correcting the condition giving rise to\\nthe violation, the court, in its discretion, may impose upon the\\nresident the reasonable costs of the owner, including counsel fees, in\\nmaintaining the action or proceeding not to exceed one hundred dollars.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "305-C",
              "title" : "Right of tenant to offset payments for heat failure; certain cases",
              "docType" : "SECTION",
              "docLevelId" : "305-C",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 117,
              "repealedDate" : null,
              "fromSection" : "305-C",
              "toSection" : "305-C",
              "text" : "  § 305-c. Right of tenant to offset payments for heat failure; certain\\ncases. 1. Any tenant acting alone or together with other tenants of a\\nmultiple dwelling employing an oil fired heating device for which the\\nowner is responsible and wherein there exists a lack of heat due to the\\nowner's failure to have oil supplied to the premises, may contract and\\npay for the delivery of such oil in accordance with the provisions of\\nthis section. Any payment so made shall be deductible from rent\\nproviding the following provisions have been substantially complied with\\nby the tenant or someone acting on his behalf:\\n  a. Reasonable efforts were made to contact the owner or his agent to\\ninform the owner of such failure to supply oil.\\n  b. Reasonable efforts were made to have the normal fuel supplier to\\nthe premises deliver the requested fuel.\\n  c. Delivery of fuel oil to the premises was secured from a fuel\\nsupplier regularly engaged in such business at a price within the range\\nof prices listed by the department in the index provided for in\\nsubdivision three of this section.\\n  d. The fuel supplier from whom oil is secured provided a written\\nstatement containing the following:\\n  (1) The name of the person or persons who requested the delivery; and\\n  (2) The date, time of and premises to which delivery was made; and\\n  (3) The amount, grade and price of the oil delivered; and\\n  (4) A certification that the usable fuel supply before the delivery\\nwas exhausted; and\\n  (5) The charge, if any, for refiring the burner; and\\n  (6) The amounts and from whom any payments were received.\\n  e. A tenant shall not be required to comply with the provisions of\\nparagraph a or b hereof unless the owner has continuously kept posted in\\na conspicuous place at the premises a notice containing his name,\\naddress and telephone number or that of his agent and the name, address\\nand telephone number of the fuel supplier to the premises.\\n  f. For purposes of this section, a multiple dwelling shall be\\nconsidered to lack heat if, during the months between October first and\\nMay thirty-first, while its usable fuel supply was exhausted, the\\noutdoor temperature fell below fifty-five degrees Fahrenheit at any time\\nduring the hours between six o'clock in the morning and ten o'clock in\\nthe evening.\\n  2. The deduction from rent allowed by this section shall also include\\na reasonable charge, if any, made by the supplier for refiring the oil\\nburner at the premises.\\n  3. The department charged with the enforcement of laws, ordinances and\\nregulations in relation to multiple dwellings shall:  a. Maintain and,\\nto the extent practicable, update at least bi-weekly an index reflecting\\nthe range of prices of fuel oil according to grade and quantity paid per\\ngallon on deliveries within the jurisdiction of the department during\\nthe last two week period for which statistics are available; and\\n  b. Maintain and keep current and available a list of suppliers which\\nhave agreed to make deliveries of fuel oil in the circumstances, and to\\nrender such assistance as is otherwise required hereby to enable tenants\\nto obtain the benefits, contemplated by this section.\\n  4. The payment for fuel oil at a price within the range of prices\\npermitted by paragraph c of subdivision one of this section shall be\\nconclusively presumed to have been a reasonable price.\\n  5. The introduction into evidence in any action or proceeding of any\\nstatement rendered in compliance with the provisions of paragraph d of\\nsubdivision one of this section shall be presumptive of the facts stated\\ntherein. Sufficient foundation for the allowance into evidence of such\\nstatement shall consist in the oral testimony of any person named as a\\npayer of all or part of the amount indicated thereon relating the facts\\nand circumstances in which the statement was rendered.\\n  6. Any tenant who has in good faith secured and paid for fuel oil\\notherwise in conformance with the provisions of this section and against\\nwhom an action or proceeding to recover possession of the premises for\\nnonpayment of rent or any other action or proceeding attributable at\\nleast in part to the tenant seeking or taking a deduction from rent as\\nallowed by this section shall, in addition to any other amounts, be\\nentitled to recover reasonable costs and attorney's fees against an\\nowner bringing such action or proceeding.\\n  7. No owner or agent shall be entitled to recover any amounts in\\ndamages from any fuel oil supplier who attempts in good faith and acts\\nreasonably to carry out the intendment of this section except damages\\narising out of gross negligence.\\n  8. The remedy provided in this section shall not be exclusive and a\\ncourt may provide such other relief as may be just and proper in the\\ncircumstances. Nothing in this section shall be construed to limit or\\ndeny any existing constitutional, statutory, administrative or common\\nlaw right of a tenant to contract and pay for the delivery of fuel oil\\nfor the multiple dwelling in which he resides or to pay for the cost of\\nany other goods and services for such multiple dwelling. This section\\nshall not be construed to preclude any defense, counterclaim or cause of\\naction that may otherwise exist with respect to an owner's failure to\\nprovide heat or any other service.\\n  9. Any agreement by a tenant of a dwelling waiving or modifying his\\nrights as set forth in this section shall be void as contrary to public\\npolicy.\\n  10. The provisions of this section shall be liberally construed so as\\nto give effect to the purposes set forth herein.\\n  * 11. Nothing contained in this section and no payment made pursuant\\nto this section shall be deemed to discharge the liability of a renter\\nwith an interest in real property pursuant to subdivision two of section\\nthree hundred four of the real property tax law from taxes levied on\\nsuch interest.\\n* NB (Effective pending ruling by Commissioner of Internal Revenue of\\nthe United States)\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "306",
              "title" : "Service of notices and orders",
              "docType" : "SECTION",
              "docLevelId" : "306",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 118,
              "repealedDate" : null,
              "fromSection" : "306",
              "toSection" : "306",
              "text" : "  § 306. Service of notices and orders.  Every notice or order issued by\\nthe department relative to a premises shall be served at least thirty\\ndays before the time for compliance therewith. It shall be sufficient\\nservice of a departmental notice or order, if it is posted in a\\nconspicuous place upon the premises affected and a copy thereof mailed,\\non the same day it is posted, to the person to whom it is directed at\\nthe address filed by him in the department, and, if his address is not\\nso filed in the department, then in such case, such notice shall be sent\\nby registered mail to his last known address or place of residence.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "307",
              "title" : "Records and searches",
              "docType" : "SECTION",
              "docLevelId" : "307",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 119,
              "repealedDate" : null,
              "fromSection" : "307",
              "toSection" : "307",
              "text" : "  § 307. Records and searches. All records of the department shall be\\npublic.  Upon request the department shall be required to make a search\\nand issue a certificate of any of its records, including violations, and\\nshall have the power to charge and collect reasonable fees for searches\\nor certificates.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            } ],
            "size" : 11
          },
          "repealed" : false
        }, {
          "lawId" : "MRE",
          "lawName" : "Multiple Residence",
          "locationId" : "A9",
          "title" : "Review; Rules; Saving Clauses; Effective Date",
          "docType" : "ARTICLE",
          "docLevelId" : "9",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 120,
          "repealedDate" : null,
          "fromSection" : "325",
          "toSection" : "330",
          "text" : "                                ARTICLE 9\\n              REVIEW; RULES; SAVING CLAUSES; EFFECTIVE DATE\\nSection 325. Review boards.\\n        326. Rules and regulations.\\n        327. Saving clauses.\\n        328. Effect of invalidity in part.\\n        329. Laws superseded.\\n        330. Time of taking effect.\\n",
          "documents" : {
            "items" : [ {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "325",
              "title" : "Review boards",
              "docType" : "SECTION",
              "docLevelId" : "325",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 121,
              "repealedDate" : null,
              "fromSection" : "325",
              "toSection" : "325",
              "text" : "  § 325. Review boards. 1. There may be in each county a review board,\\nto consist of three members, who shall be appointed by the board of\\nsupervisors of the county. One member shall be a registered architect or\\na professional engineer. The term of office of each member of such a\\nreview board shall be for three years, provided, however, that of the\\nmembers first appointed in the case of any such board one shall be\\nappointed for a term of one year, one for a term of two years, and one\\nfor a term of three years. Such members shall receive no compensation\\nunless the board of supervisors shall otherwise determine but each\\nmember shall be entitled to his expenses actually and necessarily\\nincurred by him in the performance of his duties. The board shall elect\\nits chairman from among its own members. Two members of the board shall\\nconstitute a quorum. The concurring vote of at least two members of the\\nboard shall be necessary for action. Any member chosen to fill a vacancy\\noccurring otherwise than by expiration of term shall be appointed for\\nthe unexpired term of the member whom he is to succeed. The board of\\nsupervisors shall have power to remove any member of the review board\\nfor cause and after public hearing.\\n  2. The board may appoint such employees as may be authorized by the\\nboard of supervisors, and prescribe their duties.\\n  3. Each county board shall have power within its county, except as\\nstated to the contrary in subdivision eight of this section, and each\\nlocal board of review, as provided in said subdivision eight, shall have\\npower within its own applicable area:\\n  a. With respect to dwellings existing on the effective date of this\\nchapter only, to vary or modify, in whole or in part, the application of\\nany provision of this chapter or of any rule or regulation of the\\ndepartment or commission, relating and limited to\\n  (1) secondary means of egress from dwellings,\\n  (2) fire retarding of public halls, stairs, and cellar ceilings,\\n  (3) requisite open spaces, and\\n  (4) requirements with respect to bulkheads and scuttles; provided,\\nhowever, that in the instance of each such variance or modification, the\\nbasic spirit and intent of the law are maintained and public health,\\nsafety and welfare are preserved, and further provided that in\\nconnection with any such variance or modification the board may\\nprescribe alternative or substitute requirements where such requirements\\nare appropriate or necessary to effectuate the basic purposes of this\\nchapter.  Any such variance or modification shall be granted only after\\nsatisfactory proof, at a public hearing, of practical difficulties or\\nunnecessary hardships to be encountered or caused by compliance with the\\nstrict letter of such law, rule or regulation.\\n  b. To fix a reasonable time for the hearing of an application,\\nrequiring that due notice be given of the time and place of such hearing\\nto the applicant and to the department or to other persons affected.  In\\nevery case the board shall state the reason or reasons for its decision.\\nA record of all orders, requirements and decisions of each such board,\\nindexed according to the section or sections of this chapter affected\\nthereby shall be kept in the office of the board, and such record shall\\nbe open to public inspection at all times during normal business hours.\\n  c. To enter, or delegate to any employee or officer of such a board\\npower to enter, any building or property for the purpose of conducting\\ninvestigations, surveys, or inspections necessary to carry out the\\nprovisions of this article.\\n  d. To adopt a seal and to alter the same at its pleasure, and to\\nrequire that it be used for the authentication of orders and proceedings\\nand for such other purposes as it may prescribe.\\n  e. To conduct examinations and investigations, administer oaths, hear\\ntestimony and take proof, under oath, if the board should so determine,\\nof any matter relevant or necessary to carry out the provisions of this\\narticle.\\n  f. To do all other things convenient and necessary to carry out its\\npowers.\\n  4. No member of such a board, nor any of its employees, shall pass\\nupon any question relating to any premises in which he or any\\ncorporation in which he is a stockholder or security holder has any\\ninterest directly or indirectly.\\n  5. An application for such variance or modification may be made within\\nthirty days after service of a notice or order to remove any violation\\nof this chapter or any nuisance, by any person aggrieved, or by the head\\nof an agency or department within the area in which such board has\\njurisdiction. An aggrieved person shall be construed as one who is\\ndirectly and adversely affected by a provision of this chapter or a rule\\nor regulation of the department or commission. Any action or decision of\\nsuch a board may be reviewed on the law or the facts in the manner\\nprovided by the provisions of article seventy-eight of the civil\\npractice law and rules.\\n  6. An appeal shall stay all proceedings, both civil and criminal, in\\nfurtherance of the action appealed from, unless the officer from whom\\nthe appeal is taken shall file with the board to which the appeal has\\nbeen taken a certificate that, by reason of facts stated therein, a stay\\nwould, in his opinion, cause imminent peril to life or property, in\\nwhich case, proceedings shall not be stayed otherwise than by a\\nrestraining order which, upon good cause shown, may be granted by such\\nboard or by the supreme court, on application, at least three days\\nnotice of which shall be given to the officer from whom the appeal is\\nbeing taken.\\n  7. Each review board shall have power to charge and collect reasonable\\nfees and to make rules governing such charges.\\n  8. A municipality may continue an existing local board of review,\\nwhich is in existence on July first, nineteen hundred fifty-four, to\\nhave jurisdiction solely within the territorial limits of such\\nmunicipality. In any such case, the jurisdiction of a county board of\\nreview shall not extend to any such municipality or municipalities.  In\\nthe event that no such local board exists in a municipality and in the\\nevent that, and so long as, there shall not be in such county a review\\nboard appointed pursuant to subdivision one of this section, a review\\nboard to consist of three members, one of whom shall be a registered\\narchitect or a professional engineer, may be established by such\\nmunicipality before September thirty, nineteen hundred sixty-six located\\nwithin such county to have jurisdiction solely within the territorial\\nlimits of such municipality. The powers and duties of a local board of\\nreview, insofar as the operation of the provisions of this chapter is\\nconcerned, shall be the same, within the territorial limits of the\\nmunicipality, as those of a county board created pursuant to this\\nsection.\\n  9. In the event that, and so long as, there shall not be in any county\\nor municipality a review board authorized to be established in this\\nsection, appeals authorized to be taken to such county or municipal\\nreview board, as herein provided, within the area in which such board\\nwould, if established, have jurisdiction, may be taken to the commission\\ninstead, and in such event and with respect to any such county or\\nmunicipality, the commission shall have the same powers and jurisdiction\\nas is herein provided for a county or municipality review board in such\\ncounty.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "326",
              "title" : "Rules and regulations",
              "docType" : "SECTION",
              "docLevelId" : "326",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 122,
              "repealedDate" : null,
              "fromSection" : "326",
              "toSection" : "326",
              "text" : "  § 326. Rules and regulations. 1. The commission shall have the power\\nto adopt and promulgate rules and regulations carrying into effect such\\nprovisions of the sections of this chapter wherein reference is made to\\nthe rules and regulations of or to be adopted by the commission, and\\nalso in other cases where the approval of the department or the\\nexistence of conditions satisfactory to it is a requisite under this\\nchapter for compliance with any provision of this chapter or the\\nexercise of discretionary powers by the department with respect to\\nalternative requirements, is authorized.\\n  2. Such rules and regulations shall be designed within the limitations\\nof the specifically applicable provisions of this chapter:\\n  a. To effectuate the general purposes of this chapter.\\n  b. To provide reasonably uniform standards, ratings and requirements,\\nconsonant with accepted standards of engineering, fire prevention and\\nsafety practices.\\n  c. To formulate such standards and requirements, so far as may be\\npracticable, in terms of performance objectives, so as to make adequate\\nperformance for the use intended the test of acceptability.\\n  d. To permit to the fullest extent possible, use of modern technical\\nmethods, devices and improvements which tend to reduce costs of\\nconstruction, installation and maintenance without substantially\\naffecting reasonable requirements for the health, safety and security of\\nthe occupants or users of dwellings.\\n  3. Every rule or regulation or modification, amendment or repeal of a\\nrule or regulation shall, immediately after adoption, be certified by\\nthe commission and transmitted to the secretary of state for filing in\\nthe office of the department of state. Upon such filing, the rule or\\nregulation or modification, amendment or repeal of a rule or regulation,\\nshall have the force and effect of law. The commission shall cause\\ncopies thereof to be sent to the appropriate department or departments\\nof all municipalities having jurisdiction over multiple dwellings\\ntherein which are affected thereby.\\n  4. The commission shall invite the cooperation and advice of fire\\ndepartments and organizations in connection with the promulgation of\\nrules and regulations relating to fire protection and fire prevention.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "327",
              "title" : "Saving clauses",
              "docType" : "SECTION",
              "docLevelId" : "327",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 123,
              "repealedDate" : null,
              "fromSection" : "327",
              "toSection" : "327",
              "text" : "  § 327. Saving clauses. The provisions of this chapter shall supersede\\nany local law, ordinance, resolution or regulation of municipalities to\\nwhich this chapter is applicable, but shall not affect or impair any act\\ndone, offense committed or right accruing, accrued or acquired, or\\nliability, penalty, forfeiture or punishment incurred or imposed prior\\nto the time this chapter takes effect, but the same may be enjoyed,\\nasserted, enforced, prosecuted or inflicted as fully and to the same\\nextent and same manner as if such provisions had not been enacted.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "328",
              "title" : "Effect of invalidity in part",
              "docType" : "SECTION",
              "docLevelId" : "328",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 124,
              "repealedDate" : null,
              "fromSection" : "328",
              "toSection" : "328",
              "text" : "  § 328. Effect of invalidity in part. If any term, part, provision,\\narticle, section, subdivision or paragraph of this chapter shall be held\\nunconstitutional, or ineffective in whole or in part, then to the extent\\nthat it is not unconstitutional or ineffective this chapter and such\\nterm, part, provision, article, section, subdivision or paragraph\\nthereof shall be in full force and effect; and such determination shall\\nnot be deemed to invalidate the remaining terms, parts, provisions,\\narticles, sections, subdivisions or paragraphs thereof.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "329",
              "title" : "Laws superseded",
              "docType" : "SECTION",
              "docLevelId" : "329",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 125,
              "repealedDate" : null,
              "fromSection" : "329",
              "toSection" : "329",
              "text" : "  § 329. Laws superseded. 1. The provisions of this chapter shall\\nsupersede all other state laws and all local laws, ordinances and\\nregulations of municipalities to the extent that such laws, ordinances\\nor regulations are inconsistent with the provisions of this chapter;\\nprovided, however, that the provisions of any other state law or of any\\nlocal law, ordinance or regulation of any municipality, or the\\nsupplementary rules or regulations of any state department having the\\nforce and effect of law, now in effect or hereafter enacted or adopted,\\nwhich are more restrictive than those provided in this chapter, shall\\ngovern during the period in which they are in effect.\\n  2. Upon the adoption by any municipality of any state building\\nconstruction code as to multiple residences pursuant to the provisions\\nof article eighteen of the executive law which code contains provisions\\nrelating to the construction of multiple dwellings to which the\\nprovisions of articles four, five, six and seven of this chapter are\\napplicable in whole or in part, then and in such event, the provisions\\nof such articles four, five, six and seven and the definitions used in\\nconjunction therewith shall become inoperative with respect to the\\nconstruction of such dwellings in any such municipality so long as the\\nstate building construction code is applicable and operative.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            }, {
              "lawId" : "MRE",
              "lawName" : "Multiple Residence",
              "locationId" : "330",
              "title" : "Time of taking effect",
              "docType" : "SECTION",
              "docLevelId" : "330",
              "activeDate" : "2014-09-22",
              "sequenceNo" : 126,
              "repealedDate" : null,
              "fromSection" : "330",
              "toSection" : "330",
              "text" : "  § 330. Time of taking effect. This chapter shall take effect July\\nfirst, nineteen hundred fifty-two.\\n",
              "documents" : {
                "items" : [ ],
                "size" : 0
              },
              "repealed" : false
            } ],
            "size" : 6
          },
          "repealed" : false
        } ],
        "size" : 9
      },
      "repealed" : false
    }
  }
}