{
  "success" : true,
  "message" : "The document structure for EHC law",
  "responseType" : "law-tree",
  "result" : {
    "lawVersion" : {
      "lawId" : "EHC",
      "activeDate" : "2014-09-22"
    },
    "info" : {
      "lawId" : "EHC",
      "name" : "Expanded Health Care Coverage Act 703/88",
      "lawType" : "UNCONSOLIDATED",
      "chapter" : ""
    },
    "publishedDates" : [ "2014-09-22" ],
    "documents" : {
      "lawId" : "EHC",
      "lawName" : "Expanded Health Care Coverage Act 703/88",
      "locationId" : "-ROOT",
      "title" : "Expanded Health Care Coverage Act 703/88",
      "docType" : "CHAPTER",
      "docLevelId" : "ROOT",
      "activeDate" : "2014-09-22",
      "sequenceNo" : 1,
      "repealedDate" : null,
      "fromSection" : "1",
      "toSection" : "4",
      "text" : "",
      "documents" : {
        "items" : [ {
          "lawId" : "EHC",
          "lawName" : "Expanded Health Care Coverage Act 703/88",
          "locationId" : "1",
          "title" : "Legislative findings",
          "docType" : "SECTION",
          "docLevelId" : "1",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 2,
          "repealedDate" : null,
          "fromSection" : "1",
          "toSection" : "1",
          "text" : "                     EXPANDED HEALTH CARE COVERAGE ACT\\n                    OF NINETEEN HUNDRED EIGHTY-EIGHT\\nSection 1. Legislative findings.\\n        2. Short title.\\n        3. Definitions.\\n        4. Regional pilot projects for the uninsured.\\n  Section 1. Legislative findings. The legislature finds that there are\\nmore than two and one-half million residents of the state who have no\\nhealth care coverage. The legislature recognizes that since nineteen\\nhundred eighty the number of state residents without health care\\ncoverage has increased at a rate of one hundred thousand per year, an\\nincrease of more than thirty percent in six years.\\n  The legislature further finds that people without health care coverage\\nhave limited access to primary health care services and tend to defer\\nobtaining medical care, which leads to increased severity of illness and\\nincreased costs when services are utilized. The legislature recognizes\\nthat the lack of health care coverage has serious implications for the\\noverall health status of residents of the state.\\n  The legislature recognizes the need to develop methods of providing\\nhealth care coverage to uninsured individuals and families in order to\\nimprove the health of residents of New York. Therefore, the legislature\\nhereby declares that it is the policy of this state to promote the\\nestablishment of pilot programs to test effective mechanisms to provide\\nhealth care coverage to the uninsured. The legislature further declares\\nthat these pilot programs will provide valuable information for\\ndetermining future methods of providing comprehensive health care\\ncoverage to all New York residents who lack such coverage.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "EHC",
          "lawName" : "Expanded Health Care Coverage Act 703/88",
          "locationId" : "2",
          "title" : "Short title",
          "docType" : "SECTION",
          "docLevelId" : "2",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 3,
          "repealedDate" : null,
          "fromSection" : "2",
          "toSection" : "2",
          "text" : "  ยง 2. Short title. This act shall be known and may be cited as the\\n\"Expanded Health Care Coverage Act of Nineteen Hundred Eighty-eight\".\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "EHC",
          "lawName" : "Expanded Health Care Coverage Act 703/88",
          "locationId" : "3",
          "title" : "Definitions",
          "docType" : "SECTION",
          "docLevelId" : "3",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 4,
          "repealedDate" : null,
          "fromSection" : "3",
          "toSection" : "3",
          "text" : "  ยง 3. Definitions. For the purpose of this act, unless the context\\nclearly requires otherwise:\\n  1. \"Applicant\" means an eligible organization which submits a proposal\\nunder subdivision five of section four of this act.\\n  2. \"Approved organization\" means an eligible organization approved by\\nthe commissioner to conduct either an individual subsidy program or an\\nemployer incentive program, under subdivision five of section four of\\nthis act.\\n  3. \"Commissioner\" means the commissioner of health.\\n  4. \"Eligible organization\" means an organization submitting a proposal\\nto the commissioner under subdivision five of section four of this act.\\nThe organizations which may submit a proposal shall include, but not be\\nlimited to, the following:\\n  (i) a commercial insurer;\\n  (ii) a corporation or health maintenance organization licensed under\\narticle forty-three of the insurance law;\\n  (iii) a health maintenance organization certified under article\\nforty-four of the public health law;\\n  (iv) a comprehensive health services plan operating under regulations\\nof the department of social services or the department of health;\\n  (v) an employer association; or\\n  (vi) a local social services district.\\n  5. \"Employer incentive program\" means a pilot program which assists\\nemployers in providing health care coverage under subdivision three of\\nsection four of this act.\\n  6. \"Incentive payment\" means payments made to an approved organization\\nto reduce the cost of providing health care coverage under the employer\\nincentive program.\\n  7. \"Individual subsidy program\" means a pilot program which shall\\nassist individuals and families in purchasing health care coverage under\\nsubdivision two of section four of this act.\\n  8. \"Regional pilot project\" means a program to test a model providing\\nhealth care coverage under insurance or equivalent coverage mechanisms\\nfor the uninsured and to test negotiated special payment rate\\nmethodologies for inpatient and outpatient services delivered by general\\nhospitals.\\n  9. \"Subcommittee\" means the subcommittee on health insurance\\nestablished pursuant to chapter one hundred twenty-six of the laws of\\nnineteen hundred eighty-one.\\n  10. \"Subsidy payment\" means a payment made to an approved organization\\nto reduce the cost of purchasing health care coverage under the\\nindividual subsidy program.\\n  11. \"Superintendent\" means the superintendent of financial services.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        }, {
          "lawId" : "EHC",
          "lawName" : "Expanded Health Care Coverage Act 703/88",
          "locationId" : "4",
          "title" : "Regional pilot projects for the uninsured",
          "docType" : "SECTION",
          "docLevelId" : "4",
          "activeDate" : "2014-09-22",
          "sequenceNo" : 5,
          "repealedDate" : null,
          "fromSection" : "4",
          "toSection" : "4",
          "text" : "  ยง 4. Regional pilot projects for the uninsured. 1. The commissioner,\\nin consultation with the subcommittee, is authorized to conduct regional\\npilot projects, including one or more individual subsidy programs and\\none or more employer incentive programs. The commissioner shall approve\\nat least one of each program in accordance with subdivision five of this\\nsection. In the absence of applications which meet the approval criteria\\nfor any one model, the commissioner may approve additional programs in\\nthe other program category.\\n  2. (a) An individual subsidy program shall assist individuals and\\nfamilies in purchasing health care coverage under insurance or\\nequivalent coverage mechanisms. In order to be eligible for\\nparticipation in the program, and subject to annual recertification of\\neligibility, individuals and families shall meet the following criteria:\\n  (i) gross household income is at or below two hundred percent of the\\nnon-farm federal poverty level; and\\n  (ii) not receiving medical assistance without taking into account\\ncosts incurred for medical care under the provisions of section three\\nhundred sixty-six of the social services law; and\\n  (iii) ineligible for medicare as defined in subchapter XVIII of the\\nfederal Social Security Act, 42 U.S.C. ยง1395 et seq., and\\n  (iv) do not have equivalent health care coverage under insurance or\\nequivalent coverage mechanisms as defined by the commissioner, in\\nconsultation with the superintendent. Individuals and families having\\nhealth care coverage within the six month period prior to application\\nshall not be eligible for the individual subsidy program. The limitation\\nshall not apply to persons who become ineligible for medical assistance\\nor whose insurance or equivalent coverage is terminated as a result of\\nloss of employment within such period.\\n  (b) If individuals and families receiving benefits under the\\nindividual subsidy program become eligible for medical assistance by\\ntaking into account costs incurred for medical care, social services\\ndistricts may pay all or part of the premium in accordance with\\ndepartment of social services regulations. For the purpose of this\\nparagraph, subsidy payments shall not be available to cover the costs of\\nthe premium.\\n  (c) For the purposes of the individual subsidy program, subsidy\\npayments shall be made, under subdivision eight of this section, to an\\napproved organization for the purpose of reducing premium payments,\\ndeductibles or copayments for participants in the program. The\\ncommissioner may establish and adjust schedules of payments to be made\\nunder this program. In determining such schedules, the costs to be borne\\nby the individual or family shall take into account the household size\\nand gross annual income of the household and such other factors as the\\ncommissioner may deem appropriate.\\n  (d) Notwithstanding the provisions of paragraph (a) of this\\nsubdivision, an individual who meets the criteria as established in\\nsubparagraphs (ii) through (iv) of such paragraph may be enrolled in the\\nindividual subsidy program, provided however, that an approved\\norganization shall not be eligible to receive a subsidy payment for\\nproviding coverage to such an individual. Enrollment of such individuals\\nshall not exceed twenty-five percent of the total enrollment for\\nparticipants in the individual subsidy program.\\n  (e) Applications for enrollment in the individual subsidy program will\\nnot be accepted on and after January first, two thousand one; provided,\\nhowever, individuals and families who are otherwise eligible to receive\\nbenefits under such program and are enrolled prior to January first, two\\nthousand one, may remain enrolled in such program until March\\nthirty-first, two thousand nine.\\n  3. (a) An employer incentive program shall assist employers of twenty\\nor fewer employees in purchasing health care coverage for all full-time\\nemployees and such other employees determined to be qualified for such\\ncoverage by the employer based on employment status. In order to\\nparticipate in the program, an employer shall not have, within the six\\nmonth period prior to application, provided employer-financed group\\nhealth care coverage to any employee associated with the employer's\\nbusiness.\\n  (b) An employer incentive payment shall consist of payments to an\\napproved organization in the amount of no more than fifty percent of the\\npremium costs for group health care coverage for employees and their\\ndependents. Employees shall not be required to make contributions to the\\npayment of premium costs under this program. Premium costs incurred by\\nan employer for group health insurance coverage for officers and\\ndirectors of an employer and others with a proprietary or ownership\\ninterest in the employer may be eligible for an incentive payment to\\noffset premium costs; provided, however, that the gross household income\\nof such officers and directors or others with a propriety or ownership\\ninterest does not exceed the limits provided pursuant to subparagraph\\n(i) of paragraph (a) of subdivision two of this section and provided\\nfurther that one or more employees and their dependents proposed to be\\ncovered by such group health care coverage are unrelated to such\\nofficers, directors or other persons with a propriety or ownership\\ninterest. If an employer participating in an employer incentive program\\nhires more than twenty employees after joining the program, the employer\\nmay continue in the program but the premium costs attributable to the\\nadditional employees or their families shall not be eligible for\\nincentive payments.\\n  (c) Employers may be approved to participate in the program based upon\\nthe average salaries of the employees who are to receive health care\\ncoverage, with those employers with the lowest average employee salaries\\nto be selected first and other employers to be eligible for\\nparticipation as funding will allow.\\n  (d) Notwithstanding the provisions of this subdivision, if the number\\nof employers who meet the criteria established in paragraph (a) of this\\nsubdivision, and who are applying for participation in the employer\\nsubsidy program, exceeds the amount of funds available to an approved\\norganization to provide health care coverage to employers under the\\nprogram, the approved organization may enroll additional employers. The\\napproved organization shall not receive incentive payments for such\\nemployers. Enrollment of such employers shall not exceed twenty-five\\npercent of the total enrollment of employers and their dependents\\nparticipating in the employer incentive program.\\n  (e) Employer incentive programs established pursuant to this section\\nshall expire upon implementation of the New York state small business\\nhealth insurance partnership program in accordance with the provisions\\nof article 9-A of the public health law.\\n  4. The commissioner shall establish guidelines for the submission of\\nproposals by eligible organizations, including, but not limited to, the\\nfollowing components:\\n  (i) standards for premiums, copayments and deductibles which consider\\nthe needs of program participants in obtaining health care;\\n  (ii) insurance or equivalent coverage mechanisms to be utilized under\\nthe project;\\n  (iii) minimum standards for benefits under the requirements of the\\ninsurance law and such additional benefits as may be identified;\\n  (iv) health care provider payment methodologies;\\n  (v) appropriate utilization review and quality assurance mechanisms;\\nand\\n  (vi) such other criteria which may be deemed necessary.\\n  5. (a) A proposal submitted by an eligible organization shall meet the\\nfollowing criteria:\\n  (i) estimate the number of participants who would be eligible for the\\nprogram and the estimated number of actual participants in the program\\nlocation;\\n  (ii) designate the geographic area to be served by the program;\\n  (iii) assure access to and delivery of high quality, appropriate\\nmedical services and include a network of health care providers in\\nsufficient numbers and geographically accessible to service program\\nparticipants;\\n  (iv) describe the procedures for marketing and determining eligibility\\nfor the health care coverage plan in the program location, including the\\ndesignation of other entities which may perform such functions under\\ncontract with the organization;\\n  (v) describe any arrangements for negotiated special payment rate\\nmethodologies for inpatient and outpatient services;\\n  (vi) describe in detail the estimated expenses, including the proposed\\nuse of subsidy or incentive payments, personnel costs and other types of\\nadministrative expenses which will be incurred in the development and\\nimplementation of the program;\\n  (vii) describe the quality assurance mechanisms and utilization review\\nmechanisms to be implemented;\\n  (viii) demonstrate that the applicant has sought public participation\\nand local involvement in the development of the program plan;\\n  (ix) demonstrate the applicant's ability to meet the data analysis and\\nreporting requirements for program evaluation;\\n  (x) describe the extent to which the program may be replicated in\\nother geographic areas or on a statewide basis;\\n  (xi) describe the benefit package to be offered in the program and the\\ncost of such benefit package;\\n  (xii) comply with or demonstrate an acceptable arrangement or contract\\nwith an organization which can meet the requirements of section eleven\\nhundred eighteen and other applicable provisions of the insurance law;\\n  (xiii) demonstrate the financial feasibility of the program;\\n  (xiv) describe the premium, copayments and deductibles to be paid by\\nprogram participants; and\\n  (xv) include any other information the commissioner and the\\nsuperintendent shall deem appropriate.\\n  (b) The commissioner, within forty-five days of receiving a proposal\\nfrom an eligible entity, shall make a determination whether to approve,\\ndisapprove or recommend modification of the proposal. In order for a\\nproposal to be approved by the commissioner, the proposal must also be\\napproved by the superintendent with respect to the provisions of\\nsubparagraphs (xii) through (xiv) of paragraph (a) of this subdivision.\\nUpon receiving a proposal, the commissioner shall provide a copy of the\\nproposal to the chairman of the subcommittee, consult with the\\nsubcommittee and receive its recommendation with regard to such\\napplication.\\n  6. The commissioner, in consultation with the subcommittee, may\\napprove a supplemental grant program, in addition to those programs\\nauthorized under subdivision five of this section, to provide grants for\\npublic education, outreach and marketing of health care coverage\\ntargeted at uninsured individuals and families and employers not\\nproviding coverage to their employees in any geographic area which is\\nnot designated for regional pilot project implementation. Grants may be\\nused for the following:\\n  (i) public education concerning the availability of health care\\ncoverage;\\n  (ii) promotion of community awareness of the benefits of health care\\ncoverage; and\\n  (iii) outreach and direct recruitment of potential enrollees.\\n  7. The commissioner is authorized to approve contracts between an\\napproved organization and any other organization for the purposes\\nincluding, but not limited to, outreach, marketing and eligibility\\ndetermination.\\n  8. The commissioner shall determine the amount of funds to be\\nallocated to an approved organization for the purposes described in\\nsubdivision one of this section from any funds available pursuant to\\nsubparagraph (i) of paragraph (f) of subdivision nineteen of section\\ntwenty-eight hundred seven-c of the public health law.\\n  8-a. The commissioner, in consultation with the superintendent, may\\nadjust subsidy payments and incentive payments for approved programs for\\nany of the following circumstances: (a) for new programs; (b) for new\\ncoverage under existing programs; and (c) to be effective on the next\\nannual renewal date of the affected coverage for existing coverage.\\n  9. Notwithstanding the provisions of paragraph (c) of subdivision two\\nof section two thousand eight hundred seven-c of the public health law,\\napproved organizations may enter into agreements for negotiated payment\\nrate methodologies with general hospitals for inpatient and outpatient\\nhospital services. Such negotiated payment rate methodologies in the\\ncase of inpatient services or outpatient services shall be subject to\\nthe approval of the commissioner, and shall not adversely affect quality\\nof care outcomes or result in the shifting of costs of providing\\nservices to beneficiaries of a program to any other payor.\\n  10. An approved organization shall submit reports to the commissioner\\nin such form and at times as may be required in order to evaluate the\\noperations and results of such program.\\n  11. The commissioner, in consultation with the subcommittee, shall\\nenter into agreements with one or more persons, not-for-profit\\ncorporations, or other organizations, other than a state employee,\\nofficial or agency, for the performance of a comprehensive evaluation of\\nthe implementation and effectiveness of the regional pilot projects\\nauthorized pursuant to this act. The evaluation shall assess factors\\nincluding, but not limited to:\\n  (i) the overall effect of the regional pilot projects on access to and\\nutilization of health care services;\\n  (ii) the impact of the regional pilot projects on the health status of\\nprogram participants;\\n  (iii) the impact of using a negotiated special payment rate\\nmethodology on access to and quality of inpatient and outpatient\\nservices delivered by general hospitals and on the functioning of such\\nhospitals;\\n  (iv) the impact of using alternative insurance, financing, health care\\ndelivery and provider payment models on the costs of health care\\ncoverage;\\n  (v) the impact of the regional pilot projects on the bad debt and\\ncharity care system and on other insurers, employment and health care\\ndelivery systems in the regional pilot project location;\\n  (vi) the feasibility and appropriateness of implementing the regional\\npilot projects in other locations and on a statewide basis; and\\n  (vii) the impact on the regional pilot projects of any adjustment of\\nsubsidy payments or incentive payments.\\n  An evaluation required pursuant to this section shall be submitted to\\nthe governor and the legislature by April 1, 1995.\\n  12. Notwithstanding any inconsistent provision of section 112 or 163\\nof the state finance law or any other law, at the discretion of the\\ncommissioner without a competitive bid or request for proposal process,\\ncontractual arrangements with approved organizations in effect in 1993\\nmay be extended through December 31, 1999 to provide an uninterrupted\\ncontinuation of services and may be amended as may be necessary.\\n",
          "documents" : {
            "items" : [ ],
            "size" : 0
          },
          "repealed" : false
        } ],
        "size" : 4
      },
      "repealed" : false
    }
  }
}