[{"created_utc": 1575240549, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e4p9t4/social_workers_in_chicago_area/", "id": "e4p9t4", "is_self": true, "score": 1, "selftext": "Hey everyone! I’m graduating in May with my Master of Social Work and I’m trying to network with some local social workers. I’m bilingual (Spanish) and have experience in a residential facility, psychiatric hospital and counseling experience with immigrants and refugees.", "title": "Social Workers in Chicago Area"}, {"created_utc": 1575320928, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e55k4x/trustworthy_mechanic_in_lake_county_northern_cook/", "id": "e55k4x", "is_self": true, "score": 1, "selftext": "Hello all! My husband &amp; I recently moved to North Chicagoland (originally from the Detroit area). My husband's car broke down and we are in need of recommendations for a trustworthy mechanic. He has an old Honda Civic with manual transmission and the shifter/clutch doesn't work and need possible replacement. We are near the Lincolnshire / Deerfield area.  \n\n\n\\[ On top of that, the car is broken down in his usual parking space. Does anyone know if roadside assistance would tow it to a mechanic for us, or does that only count when you're not-at-home? Not sure how to get it to the mechanics once we find one. \\]  \n\n\nWe appreciate any and all help!", "title": "Trustworthy Mechanic in Lake County / northern Cook County?"}, {"created_utc": 1575393398, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e5k8k3/is_naperville_doing_the_christkindlmarket_this/", "id": "e5k8k3", "is_self": true, "score": 1, "selftext": "I am coming back to Chicago after moving and was wondering if Naperville was still hosting this event. Thanks in advance! :)", "title": "Is Naperville doing the Christkindlmarket this year?"}, {"created_utc": 1575486094, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e63ypd/new_years_eve_restaurant_reservations/", "id": "e63ypd", "is_self": true, "score": 1, "selftext": "Last New Year's Eve afternoon I was picking up an order at Biaggi's and from the bar I could hear the receptionist answer the phone. In a calm, professional manner she repeatedly told callers there was nothing available for that night. Why in god's name are people trying to make reservations for New Year's Eve on New Year's Eve?!!!  \n\nIf you plan on going out to a restaurant over the holidays, make a reservation now. AND, remember to cancel if your plans change.", "title": "New Year's Eve Restaurant Reservations"}, {"created_utc": 1575503428, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e68bvp/anyone_else_getting_more_frequent_spam_callers_as/", "id": "e68bvp", "is_self": true, "score": 1, "selftext": "The last two weeks I've been getting bombarded with SPAM callers, mainly spoofed numbers similar to the same area code + first 3 digits of my cell #. Just wondering if anyone else in the Chicagoland area is also noticing a rise of SPAM callers once again?", "title": "Anyone else getting more frequent SPAM callers as of recently?"}, {"created_utc": 1575508776, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e69ieu/does_anyone_know_where_to_find_white_carafes/", "id": "e69ieu", "is_self": true, "score": 1, "selftext": "There's been a mixup for an event happening this weekend and I'm looking for some white carafes that look similar to [this](https://www.amazon.com/Winco-Button-Insulated-Beverage-20-Ounce/dp/B003B3T4QE/ref=sxbs_sxwds-stvp?crid=12K2XT2AVKE0C&amp;keywords=white+coffee+thermos&amp;pd_rd_i=B003B3T4QE&amp;pd_rd_r=47c7d350-3b4c-4b03-aef3-c3d2493b1445&amp;pd_rd_w=pjBZV&amp;pd_rd_wg=CTSOX&amp;pf_rd_p=a6d018ad-f20b-46c9-8920-433972c7d9b7&amp;pf_rd_r=KKT04ADDZR2BTA5145NQ&amp;qid=1575508009&amp;sprefix=white+coffee+ther%2Caps%2C159).  The problem we have is that all delivery seems to be coming in Monday at the earliest.  Does anyone know a store near them that would have some stuff like this?  Or a catering company that is willing to make a deal?\n\nAny help is appreciated.", "title": "Does anyone know where to find white carafes?"}, {"created_utc": 1575524223, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e6cpej/does_anyone_sell_cigarettes_here/", "id": "e6cpej", "is_self": true, "score": 1, "selftext": "I’m here for a work get-together to mingle and it’s been a lot of fun. But does anyone sell cigarettes here? I have a friend back at home whim I told I’d bring back some cheap Marlboros. \n\nI went to the cvs / whole foods. Nothing. I’m staying at the Sheraton, is there anywhere near by? I only have 1 day left and we’re busy tomorrow. Thanks", "title": "Does anyone sell cigarettes here?"}, {"created_utc": 1575575358, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e6mh7o/registering_an_out_of_state_vehicle/", "id": "e6mh7o", "is_self": true, "score": 1, "selftext": "I am thinking about buying a Tesla, but from what I understand, Illinois doesn’t give any incentives to purchase an electric vehicle. \n\nIf I were to buy the car out of state, and then bring it over and re-register in Illinois next year, would the state hit me for sales or property tax on the car? Or would I just pay ordinary tax and registration?\n\nI’ve recently relocated in and am having a tough time negotiating all this.", "title": "Registering an Out of State Vehicle"}, {"created_utc": 1575602050, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e6sp7p/donating_unused_babynursing_items/", "id": "e6sp7p", "is_self": true, "score": 1, "selftext": "Does anyone know where I could donate unused baby &amp; breastfeeding/nursing items, in the West suburbs?\n\nI asked at the Health Department but they didn't seem to have an answer. \n\n\nAny leads would be helpful. It's not a ton of stuff, but I'd like someone that needs it to get it.", "title": "Donating Unused Baby/Nursing Items"}, {"created_utc": 1575686393, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e78n6g/red_light_camera_leeway/", "id": "e78n6g", "is_self": true, "score": 1, "selftext": "Today I may have run a red light camera in Palatine, IL.  I was in a rush and the car in front of me might have tried to bait me into it (it worked).  It's my fault.  It appears I technically didn't come to a complete stop.  How much leeway do the police officers give when it comes to red light cameras?  Has anyone had a similar experience and can share the outcome (if any)?\n\n [https://vimeo.com/377920550](https://vimeo.com/377920550)  (action starts at 20 second)", "title": "Red Light Camera Leeway"}, {"created_utc": 1575806813, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e7t07z/best_place_to_buy_childrens_furniture/", "id": "e7t07z", "is_self": true, "score": 1, "selftext": "I have to get a bedroom setup for two 5 year old boys. \n\nCan anyone recommend good places to buy reasonably priced kids bedroom furniture (other than IKEA)?", "title": "Best place to buy children’s furniture?"}, {"created_utc": 1575832795, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e7y0ms/best_hibachi_grill_in_the_south_west_suburbs/", "id": "e7y0ms", "is_self": true, "score": 1, "selftext": "Looking for a hibachi grill where the chef cooks in front of you.", "title": "Best Hibachi Grill in the south west suburbs?"}, {"created_utc": 1575859591, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e83rtp/driving_without_headlights/", "id": "e83rtp", "is_self": true, "score": 1, "selftext": "Anybody see way to many cars driving without their lights on? I swear lately I see 5 or more cars a night like that.", "title": "Driving without headlights"}, {"created_utc": 1575982213, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e8q7hj/just_who_is_this_opt_out_group/", "id": "e8q7hj", "is_self": true, "score": 1, "selftext": "I notice at all the village / city board meetings for the MJ zoning ordinances the majority of the Opt Out crowd seems to be going from city to city trying to convince governments to opt out.  These people are not typically residents of the city in question.  For whatever reason, a lot of them seems to be asian people.  You can see examples in this article but they were at every meeting.  [https://www.dailyherald.com/news/20191209/palatine-votes-to-allow-marijuana-businesses-in-town](https://www.dailyherald.com/news/20191209/palatine-votes-to-allow-marijuana-businesses-in-town)\n\nWho are these people?  What is their Agenda?  Why are they so focused on this issue?  Its been my experience that various \"anti\" groups are usually part of something bigger and are not self funded.  Who is the money behind them?  I would like to see some investigative journalism here.", "title": "Just who is this OPT OUT Group?"}, {"created_utc": 1575991302, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e8rxgh/is_there_any_reason_not_to_move_to_brookfield/", "id": "e8rxgh", "is_self": true, "score": 1, "selftext": "Title pretty much says it all. Wife and I live in Aurora, found an apartment for $725 on craigslist at Burlington and Vernon.  Restaurants and pizza within pretty short distance, along with cool stuff like Waterworks(a buddy has done bar bingo there) and Galloping Ghost. Is there anything I'm missing? No kids so no concern there.", "title": "Is there any reason not to move to Brookfield?"}, {"created_utc": 1576012694, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e8wwf7/recommendation_for_wheel_alignment_in_western/", "id": "e8wwf7", "is_self": true, "score": 1, "selftext": "Please recommend a good shop for wheel alignment in Western suburbs. I'm not sure if it's a specialization or any shop can do it. Thanks.", "title": "Recommendation for wheel alignment in Western suburbs?"}, {"created_utc": 1576019151, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e8yde8/have_you_seen_a_winged_humanoid_huge_batwinged/", "id": "e8yde8", "is_self": true, "score": 1, "selftext": "Have you seen a winged humanoid / huge bat-winged entity? Serious inquiry.\n\nHave you had a sighting of a winged humanoid or huge bat-like creature in Chicagoland, as well as Illinois, Wisconsin or Indiana? The entity has also been referred to as the 'Chicago Mothman' &amp; 'Chicago Man-Bat.' The average description is of a dark winged human-sized entity. Some have been said to have bright red eyes. The sightings have been documented and posted on an interactive map at [http://bit.ly/2qDMxFq](http://bit.ly/2qDMxFq) and chronicled at [http://bit.ly/2RAho0O](http://bit.ly/2RAho0O) \\- Please feel free to contact me at [lonstrickler@phantomsandmonsters.com](mailto:lonstrickler@phantomsandmonsters.com) \\- your anonymity is guaranteed. Our investigative group is conducting a serious examination of his phenomenon. We are merely seeking the truth and wish to determine what eyewitnesses have been encountering. Your cooperation is truly appreciated. You can call me directly at 410-241-5974 as well. Thanks...Lon Strickler", "title": "Have you seen a winged humanoid / huge bat-winged entity? Serious inquiry."}, {"created_utc": 1576021061, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e8ys09/anyone_wanna_to_to_chuck_e_cheese_w_me/", "id": "e8ys09", "is_self": true, "score": 1, "selftext": "I'm a college age male. Got a coupon on TMobile Tuesday where if I buy $5 worth of tokens I get a free pizza. \n\nAnyone wanna go w me? I don't wanna go alone lol. Let's eat some pizza and drink some beer and chill. Hmu :)", "title": "Anyone wanna to to Chuck e cheese w me?"}, {"created_utc": 1576031691, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e90x0z/bored_on_winter_break_can_someone_hmu/", "id": "e90x0z", "is_self": true, "score": 1, "selftext": "I'm a male college student. Early 20's. Single. In the Chicago suburbs. On winter break. I'm pretty lonely tbh. \n\nIs there anyone else on winter break with no plans that would like to get to know each other? Spend some time together? Pm me. I do have anxiety", "title": "Bored on winter break. Can someone hmu?"}, {"created_utc": 1576084813, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e99z7k/best_place_to_buy_fresh_cookies/", "id": "e99z7k", "is_self": true, "score": 1, "selftext": "I’m supposed to make cookies for a work Christmas party but I’m honestly too lazy. Anyone know of any bakeries near the O’Hare suburbs that bake fresh cookies? I’m trying to avoid buying the ones from Jewel if I can.", "title": "Best place to buy fresh cookies?"}, {"created_utc": 1576114901, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e9gtk8/i_have_a_unique_situation_and_need_your_advice/", "id": "e9gtk8", "is_self": true, "score": 1, "selftext": "So here's my situation, hopefully you can help.   \n  \n- I'm 30 years old, single, and have a work-from-home remote job. I will be making about $45k/year    \n \n- My mom is disabled, though she is able to work Uber part time.  \n \n- I will be paying the rent, she will help with most of the bills (food, internet, etc) \n  \n- I don't have a car, though my mom does \n   \n \nSo this will be a temporary stay, my 'dream' is to ultimately buy a place as close to downtown as I can afford so I can pay down a mortgage instead of throw away money on rent. That being said, my goal is really to do things like:  \n \n- Explore the city. I obviously can't afford a place downtown (with my mom as my roommate), so I'm hoping I can find a community where I can walk to a train/subway station  \n \n- Safe. Outsiders hear a lot about the dangers of Chicago so I don't want to sacrifice safety, especially with my mother. \n  \n- This last one is not a need but a want, so not important, but a community with a higher arab community would be great for my mom.  \n \n  \nIn terms of my budget on rent, I'm hoping I can spend at least half my paycheck or less, that would be ideal, but I would be willing to sacrifice more depending on the community I can get. \n   \nJust want your suggestions and advice I'll do the homework of looking into the communities but would love if you can give some ideas that I can explore.  \n \nThank you so, so much. Chicago seems equal parts big &amp; scary and big &amp; amazing.", "title": "I have a unique situation and need your advice. What are some nice, reasonably priced places that one can rent for a few months (say, 3-4)? I have a unique situation where I will be moving in with my mom and she will be staying with me. I just need a temporary place until I can explore the city."}, {"created_utc": 1576205195, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e9xx65/a_friend_needs_a_dog_walker_in_palatine_on_very/", "id": "e9xx65", "is_self": true, "score": 1, "selftext": "I have a friend in Palatine who needs a dog walker by tomorrow because she’s going out of town on business on very short notice. If anyone has any recommendations would be great", "title": "A friend needs a dog walker in Palatine on very short notice."}, {"created_utc": 1576206645, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/e9y7po/tracks_open_to_public_innear_new_lenox/", "id": "e9y7po", "is_self": true, "score": 1, "selftext": "Hey there, \nI’m visiting New Lenox Dec 27-30th, and I’m looking for any running tracks that are open to the public (ideally a standard 400m track). Does anybody know of any in/near New Lenox? I’m in Houston and lots of the public high schools near me have open tracks, but I’m not sure if it’s the same up there and which schools to go to.", "title": "Tracks open to public in/near New Lenox?"}, {"created_utc": 1576249591, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ea53vn/threat_at_st_viator_high_school_in_ah/", "id": "ea53vn", "is_self": true, "score": 1, "selftext": "Last I heard was students being sent home due to angry social media posts by a student.", "title": "Threat at St. Viator high school in AH."}, {"created_utc": 1576276185, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eab0o4/nostalgic_supper_clubs_around_the_burbs/", "id": "eab0o4", "is_self": true, "score": 1, "selftext": "Where are the nostalgic supper clubs around the burbs? Family owned, good steak, and nothing modern.", "title": "Nostalgic Supper Clubs Around the Burbs"}, {"created_utc": 1576302183, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eafxpu/looking_for_a_dart_league_in_the_nw_burbs/", "id": "eafxpu", "is_self": true, "score": 1, "selftext": "In the Palatine/Arlington Heights/Rolling Meadows area. Can be steel tipped or electric. Thanks!", "title": "Looking for a dart league in the NW burbs."}, {"created_utc": 1576375999, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eat09w/does_chicago_have_its_own_silicon_valley_what/", "id": "eat09w", "is_self": true, "score": 1, "selftext": "I'm not even sure how to describe this, but since I'll be new in the city as a not-so-young-but-still-kinda-young 30-something, I was hoping to see where my fellow tech geek/board game folk/gaming folks hang out? Not sure if a community like this even exists but the fact that it's Chicago means it might.\n  \nI'm single, so don't care about schools or raising a family yet, but definitely looking to see if there's a neighborhood where I can meet new, geeky/nerdy friends.", "title": "Does Chicago have its own \"silicon valley\"? What neighborhoods do my fellow nerds live in?"}, {"created_utc": 1576404235, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eaxb2l/vernon_hills_mall_castle/", "id": "eaxb2l", "is_self": true, "score": 1, "selftext": "A while back I made a post about a video store inside the Vernon Hills mall which was Suncoast video. I was hit with a lot of nostalgia a foggy memories since I used to live near Chicago, but I also remember a castle inside the mall.\n\nI was around 6-7 when I last saw it but I swear there used to be a big castle in the middle of the mall where kids could play in. I have only been able to find one picture of this castle so I’m going to assume it’s no longer there.\n\nDoes anyone else remember this? I thought it was so cool.", "title": "Vernon Hills Mall Castle"}, {"created_utc": 1576476435, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ebb7l0/wheeling_safety_and_convenience/", "id": "ebb7l0", "is_self": true, "score": 1, "selftext": "We are looking to rent in the area formed by RT 83 (to the west), Lake-Cook Road (north), Dundee (south), Milwaukee Ave (east). \n\nUnfortunately we are not in state now and won't get a chance to drive around to get a feel ourselves. We don't have kids.\n\n- How's this area in general for safety?\n\n- Is the area pretty convenient in terms of grocery / restaurants / shopping?\n\nThanks!!", "title": "Wheeling safety and convenience?"}, {"created_utc": 1576504080, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ebfcg2/is_it_weird_to_tip_a_barber_before_they_finish/", "id": "ebfcg2", "is_self": true, "score": 1, "selftext": "Theres a place that does $5 haircuts. I want to make sure the barber does a good job \n\nWould it be weird if I paid $15 ($5 plus $10 tip) before they even start cutting the hair?\n\nSort of like an incentive for them to pay more attention to detail and take their time.", "title": "Is it weird to tip a barber before they finish the cut?"}, {"created_utc": 1576522148, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ebj9wi/best_place_to_watch_a_bears_game_in_north_suburbs/", "id": "ebj9wi", "is_self": true, "score": 1, "selftext": "Just moved into the city. Looking for a good sports bar in the North Suburbs for this week’s Sunday night game. \n\nAny recommendations?", "title": "Best place to watch a Bears game in North Suburbs?"}, {"created_utc": 1576533239, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ebltzv/does_anyone_have_experience_building_a_home_with/", "id": "ebltzv", "is_self": true, "score": 1, "selftext": "anyone have any experience with M/I builders? putting up a new development neighborhood near me and my parents are looking into building with them. thanks for any and all feedback.", "title": "Does anyone have experience building a home with M/I homes?"}, {"created_utc": 1576539076, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ebn5yq/good_bicycle_shop_in_the_aurora_area/", "id": "ebn5yq", "is_self": true, "score": 1, "selftext": "I have a folding bike that I haven't used in about a year and a half.  I want to get it looked at in the spring for brakes and a tune up. I liked the bike shop in downtown Wheaton but if there's a good place closer I'm all ears.", "title": "Good bicycle shop in the Aurora area?"}, {"created_utc": 1576543957, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ebo7y1/suggestions_for_air_conditioning_companies/", "id": "ebo7y1", "is_self": true, "score": 1, "selftext": "Hey folks; pretty self explanatory inquiry- any companies you have had solid/terrible times with getting air conditioning set up in your home(s)?", "title": "Suggestions for Air Conditioning Companies?"}, {"created_utc": 1576546697, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ebosf6/does_anyone_have_recommendations_for_christmas/", "id": "ebosf6", "is_self": true, "score": 1, "selftext": "Looking for neighborhoods or streets that have a coordinated  Christmas light show (preferably ones that allow me to stay warm in the car) near the NW suburbs! Any suggestions would be greatly appreciated!", "title": "Does anyone have recommendations for Christmas lights shows near Northwest suburbs?"}, {"created_utc": 1576552179, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ebpxka/where_can_i_buy_womens_work_boots/", "id": "ebpxka", "is_self": true, "score": 1, "selftext": "Most places like bass pro, cabellas, red wing... they have hiking style boots, but where can I find legit working boots in women’s sizes in store? If it helps, I work for a tree service company so I’m outdoors all day long and I climb trees.", "title": "Where can I buy women’s work boots?"}, {"created_utc": 1576691426, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ecfy0i/anyone_know_of_volunteer_opportunities_this_week/", "id": "ecfy0i", "is_self": true, "score": 1, "selftext": "Have the time, looking to do some good.", "title": "Anyone know of volunteer opportunities this week or next week?"}, {"created_utc": 1576704251, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ecivif/rv_sought_for_1_night_wont_get_used/", "id": "ecivif", "is_self": true, "score": 1, "selftext": "So we are having a private holiday party w a Chevy Chase Christmas Vacation theme. Thought it could be fun to have a RV in the driveway.  Won't be used. Just a prop. \n\nWould pay for gas and up to $150 to park it overnight. Just need it there from 6-10pm on Saturday evening.  Anyone in the area want to make a few bucks?", "title": "RV sought for 1 night... Won't get used"}, {"created_utc": 1576750880, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ecrdn1/anyone_looking_for_friends/", "id": "ecrdn1", "is_self": true, "score": 1, "selftext": "Anyone in the area looking for friends message me", "title": "Anyone looking for friends"}, {"created_utc": 1576827803, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ed70jb/suggestions_for_nye_in_the_suburbs/", "id": "ed70jb", "is_self": true, "score": 1, "selftext": "so half of the group is 21/half is 20... any suggestions for a restaurant/bar/grill/event that is hosting something we could all enjoy?", "title": "suggestions for NYE in the suburbs?"}, {"created_utc": 1576859553, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/edcfrv/how_to_apply_for_a_foid_card/", "id": "edcfrv", "is_self": true, "score": 1, "selftext": "I applied when I was age 19 (about two years ago)\nAnd they denied my application because I was under the age of 21 at the time and wasn't able to get parents signature. I created an account on the Illinois State Police website and submitted the application online\n\nAnyways, I'm 21 now and want to reapply.\n\nShould I submit a new application? Or do an \"appeal\"? \n\nThe website isn't even letting me submit a new application. \n\nPlus I keep fucking calling the Illinois State Police and they never answer. Even though I called them during their business hours. \n\nWhat should I do? Is there any other way I can reapply? I really need advice.", "title": "How to apply for a foid card?"}, {"created_utc": 1576864876, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eddllq/updated_chicago_unemployment_figures_released/", "id": "eddllq", "is_self": true, "score": 1, "selftext": "[Official unemployment figures for the Chicago economy](https://www.bls.gov/eag/eag.il_chicago_md.htm) were updated today. Numbers for October have been finalized and preliminary figures for November have now been made available.\n\n\n**October**\n\nThe unemployment rate increased to 3.4% in October. 7,000 positions were lost, and 900 workers left the labor force causing the unemployment rate increase. Nonfarm payrolls increased by 32,400. No individual sector saw significant employment changes.\n\n\n**November** (preliminary)\n\nThe unemployment rate fell to 3.1% in November. 2,000 positions were lost, but 12,100 workers exiting the labor force caused the unemployment rate to decrease. The overall Nonfarm Payrolls figure did not change significantly. No individual sector saw significant employment changes.\n\n\n^*Chicago_Statistics ^is ^a ^public ^service ^account ^committed ^to ^making ^/r/ChicagoSuburbs ^a ^better ^informed ^community.", "title": "Updated Chicago Unemployment Figures | released December 20, 2019"}, {"created_utc": 1576902886, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/edlbcp/plastic_surgeon_in_the_suburbs/", "id": "edlbcp", "is_self": true, "score": 1, "selftext": "My wife has been talking alot lately about getting a breast augmentation. Making me very happy of course. But we have no idea where to go or what to do. Figured Reddit might be able to point us in the right direction for a good plastic surgeon in the area? Chicago Western suburbs if possible. Thank you!", "title": "Plastic Surgeon in the suburbs?"}, {"created_utc": 1576904142, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/edljha/a_nice_bar_in_nw_suburbs/", "id": "edljha", "is_self": true, "score": 1, "selftext": "Throwaway account because my main one has some personal info. \n\nI don't go out often so I don't know any places. \nI am looking for a finer bar where I can go and have a drink alone while dressed nicely(-ish?) (a celebration of an occasion - with myself). So not some sketchy place and not one where people are in hoodies. \n\nLocation: Arlington Heights, Mount Prospect, Wheeling area. \n\nAny input is appreciated, thank you.", "title": "A nice bar in NW suburbs?"}, {"created_utc": 1576924962, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/edojq2/psa_you_are_breaking_the_law_by_blocking_traffic/", "id": "edojq2", "is_self": true, "score": 1, "selftext": "You are a horrible, horrible person if you sit in the left lane while people aggressively pass you. For the love of all this holy, MOVE OVER!", "title": "PSA: You are breaking the law by blocking traffic in the left lane."}, {"created_utc": 1576925187, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/edokpn/suggestions_for_absinthe_retailers_in_the_nnw/", "id": "edokpn", "is_self": true, "score": 1, "selftext": "Looking for a retailer with a wide selection of absinthes. It looks like Binny's carries a few decent brands if you call ahead to order, but is there anywhere else? The shipping costs alone on this stuff make it cheaper to try and buy local.", "title": "Suggestions for absinthe retailers in the N/NW suburbs?"}, {"created_utc": 1576957402, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/educ5r/offering_pet_sitting_and_dog_walking_services/", "id": "educ5r", "is_self": true, "score": 1, "selftext": "Hello! \n\nI offer pet sitting (drop-in home visits to feed, let out, give medication to, check-on, etc.) and dog walking services through Rover.com (website or phone app). \n\nI am a certified dog trainer with many years of pet caregiving experience working in various areas of this field from animals shelters to veterinary hospitals and I am trained in pet first aid and CPR as well. I am comfortable working with all animals!\n\nIf you have pets (or know people who do and would like to share this with them), are in the Chicagoland area, and are interested in booking my services, I am including in this post my coupon code for a free first booking with Rover!\n\nPlease head to my profile to learn more and use my coupon code below:\n\nMy Rover.com profile: https://www.rover.com/sit/rebecf12798/e\nCoupon code: REBECF63792\n\nPlease feel free message me if you have any questions!\n\nThank you! I look forward to meeting you and your pets!", "title": "Offering Pet Sitting and Dog Walking Services"}, {"created_utc": 1576997166, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ee1t65/requesting_a_map_of_chicago_and_its_suburbs_with/", "id": "ee1t65", "is_self": true, "score": 1, "selftext": "Hi guys\n\n  \n\n\nCouldn't find this by searching on the internet, so I thought you guys can probably help me.\n\n  \n\n\nI need a map that shows the borders of Chicago city and all the suburbs around it in the metro area.\n\n  \n\n\nThankk you!", "title": "Requesting a map of Chicago and its suburbs with borderlines"}, {"created_utc": 1577094244, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eeik22/has_anyone_ever_used_a_property_tax_consultants/", "id": "eeik22", "is_self": true, "score": 1, "selftext": "I keep getting these notices from real estate lawyers and of course they all say they can reduce my property taxes. If that were true, why don't I hear about the success stories more often?", "title": "Has anyone ever used a property tax consultants with any success?"}, {"created_utc": 1577124166, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eeo24o/any_women_in_will_county_wanna_sit_on_my_face/", "id": "eeo24o", "is_self": true, "score": 1, "selftext": "Bonus points if you’ll fart. Dm me. Not joking", "title": "Any women in Will County wanna sit on my face?"}, {"created_utc": 1577137324, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eer2gh/random_chicago_tribune_deliveries_not_a/", "id": "eer2gh", "is_self": true, "score": 1, "selftext": "We've been getting the Trib on our driveway every Sunday since Thanksgiving. We even got a NY Times as well. Some of our neighbors are getting them too. Anybody else seeing this?", "title": "Random Chicago Tribune deliveries. Not a subscription holder"}, {"created_utc": 1577156101, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eev1nx/adult_pianomusic_teacher_recommendations/", "id": "eev1nx", "is_self": true, "score": 1, "selftext": "I took about a year of lessons while I lived in Tacoma last year. Now that I’m back home and settled in I want to get back into piano and music classes. Does anyone have any recommendations for a good private instructor?", "title": "Adult Piano/Music Teacher recommendations?"}, {"created_utc": 1577193153, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ef16xa/anyone_willing_to_pick_up_a_bottle_of_bourbon_in/", "id": "ef16xa", "is_self": true, "score": 1, "selftext": "Hi all,\n\nPlease let me know if this isnt allowed!\n\nSo in a bit of poor planning I've overextended myself today and wont have the time to drive into the city to pick up an xmas gift I was planning to get. Was wondering if anyone would be interested in picking up a specific bottle of bourbon from andersonville wine and spirits in Chicago and dropping it off to me in Naperville for $20? \n\nIf so, post here or shoot me a PM! I'd really appreciate it! :)", "title": "Anyone willing to pick up a bottle of bourbon in Chicago and drop in off in Naperville by 1pm this afternoon for $20?"}, {"created_utc": 1577229821, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ef8qt1/yaaay_52_degrees_this_is_awesome/", "id": "ef8qt1", "is_self": true, "score": 1, "selftext": "This weeks gonna be so pleasant ! Yay!!!", "title": "Yaaay! 52 degrees this is awesome!"}, {"created_utc": 1577246495, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/efboye/if_you_were_single_and_wanted_to_experience/", "id": "efboye", "is_self": true, "score": 1, "selftext": "Just want to hear your thoughts.", "title": "If you were single and wanted to experience downtown Chicago, which suburbs would you look into and which would you avoid? Is it as simple as living near the L train?"}, {"created_utc": 1577290439, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/efi8ce/the_dogs_previously_known_as_jrs_hot_dogs/", "id": "efi8ce", "is_self": true, "score": 1, "selftext": "Im reserving this thread for the creating of a map that points out all the places you can still get a JR's hot dog on the south side. \n\nPlease feel free to post locations that fit this criteria so I can add them to the map", "title": "The dogs previously known as Jr's Hot dogs. Locations using a different name still serving the best cheese dog."}, {"created_utc": 1577314708, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/efn4uo/boredom_in_the_suburbs/", "id": "efn4uo", "is_self": true, "score": 1, "selftext": "I'm in from out-of-town for 10 days staying in the far suburbs with an older aunt.  She is super sweet and spoils me with great food and she has sweet pets.\n\nI'm very ADHD with a lot of energy... I need a lot of stimulation. There is so much love here, and I am grateful, but this is not a great match. I'm really bored. I'm in a place where I don't know anyone, and there really isn't any way to meet other people here. I feel like I'm in isolation here. Even her street is a dead-end street, you never see anyone outside, no families just small apartments with mostly seniors.\n\nI usually get to spend time during the holidays with my younger cousins (kids, teens, 20s, early 30s) who are always busy and active, take me out with them, and there's constant back-and-forth banter... I love that and miss it bad. The companionship and they're super curious about my life and vice versa.  Video games with each other, hoops, wrestling and goofing around or just talking about life. It's very social and high key when I'm with them, no matter where we go or what we do.\n\nI feel guilty about feeling down this Christmas, and I know it shows. I really just need to find stuff to do so I can be in a better mood when I'm around my aunt. I feel like she could think I'm ungrateful or that she's done someone wrong. She already got frustrated with me and asked if \"I expect the world to entertain me.\" She thinks her quiet corner of the world is just perfect and can't understand why I would not feel the same way.\n\nI've tried going out to bars by myself and that is just no fun, also I'm not a drinker (as in 1 drink is enough.) Bars are fine with friends, but not solo. I've tried other solo excursions and just feel worse. Doing things by myself for the whole holiday season just isn't appealing. I am not great at approaching people and starting a conversation.\n\nA pleasant week for my aunt involves the grocery store, church, volunteering at her church, sitting at the library, taking the recycling to the drop-off center, and watching TV each night. It's insanely boring for me. Plus, she's very independent and doesn't need or want help shopping, cooking, cleaning, etc. I just have nothing useful or interesting to do.\n\nAny ideas? I'm within 80 minutes of Chicago downtown and within an hour of a lot of suburbs. I like sports in general, playing pool, pickup basketball (not good though), conversations about tech and news and sports. I'm game for anything where I could meet people who want to meet people, if that makes sense. I feel like I'm searching aimlessly and can \"try\" driving to all sorts of places, but holiday week hours are unpredictable and there's no guarantee it'll be worth the trip. I'm probably looking at 45-90 minutes of drive time, and my budget is limited, so I feel like I need to make good choices and not just be aimless about picking places to go.\n\nThanks!", "title": "Boredom in the suburbs"}, {"created_utc": 1577388421, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/efzp0l/anyone_interested_in_splitting_a_grassfedpasture/", "id": "efzp0l", "is_self": true, "score": 1, "selftext": "I have currently been sold on all the  benefits of consuming grass fed/pasture cow beef over what is typically  available in the store. It is a much more humane way to raise an animal  than commercial feed lots. Downside is of course it's quite expensive.  That being said if you split it with people it can be cheaper. When you  do this, you get a full spectrum of beef cuts, steaks, ground beef ect.\n\nThere's a ton of different farms you can choose from on this website: [http://www.eatwild.com/products/illinois.html](http://www.eatwild.com/products/illinois.html)\n\nExample calculations (from [https://www.allgrassfarms.com/](https://www.allgrassfarms.com/), the first farm on the list):\n\n**Quarter cow cost after all processing:**\n\nTotal estimated cost:  150 lbs. hanging weight x $4.50/lb = $675 + $125 processing = $800 for \\~100 lbs of take home meat, or **$8.00 per pound.**\n\n**Half cow cost after all processing:**\n\nTotal estimated cost:  300 lbs. hanging weight x $4.50 lb = $1350 + $225 processing = $1575 for \\~200 lbs of take home meat, or **$7.88 per pound.**\n\nExact  costs scale with how much actual beef is weighed out and this is just  one farm - there are others where the pricing per lb difference is much  steeper between quarter, half, and whole cow. Message me!", "title": "Anyone interested in splitting a grass-fed/pasture raised cow from a local Illinois farm?"}, {"created_utc": 1577470764, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/egeo9n/visiting_chicago/", "id": "egeo9n", "is_self": true, "score": 1, "selftext": "Planning on visiting Chicago in February. Do the downtown sidewalks get very icy? If so, what type of winter boots for women do you recommend? Thank you! &lt;3", "title": "Visiting Chicago"}, {"created_utc": 1577477813, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/egg8v4/need_ideas_asap_traveling_tomorrow/", "id": "egg8v4", "is_self": true, "score": 1, "selftext": "Hi me and my girlfriend have a 3 day trip to Chicago from the 28th to 30th. We are hoping some locals could point out things of interest.\n\nHere is what we have planned so far (and please feel free to add your favorites):\n\n* Millennium Park (see the Bean etc)\n* Navy Pier (heard it's a great place for Chicago Skyline pictures)\n* Watching a Chicago Bulls game at United Center\n* Checking out Galloping Ghost Arcade in Brookfield (heard it's pretty cool with all you can play)\n* Zoolights at Lincoln Park Zoo (Heard it's amazing and it's free)\n* Christkindlmarket if it's still open\n\nWe love doing tourist stuff, seeing scenery, taking pics, so please let me know other cool events.\n\nRestaurant ideas are also appreciated: We are actually looking for places to eat too. We love authentic Asian food.\n\n* Royal Buffet in Hoffman Estates\n* Happy Lamb Hot Pot in Naperville\n* SushiNaper in Naperville\n\nWe love Asian (BBQ, sushi, authentic foods) etc.  so please suggest.\n\nAlso, feel free to suggest dessert places like crepes, ice cream, waffle cream etc..\n\nThank you guys! Appreciate ideas!", "title": "Need ideas ASAP - traveling tomorrow"}, {"created_utc": 1577479744, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eggoga/has_anyone_ordered_a_suckling_pig_in_the/", "id": "eggoga", "is_self": true, "score": 1, "selftext": "We have never ordered one for the burbs and have no idea where to start.  If anyone has a recommendation we’d love to hear it! Any ethnic preparation would be welcome!", "title": "Has anyone ordered a suckling pig in the northwest burbs?"}, {"created_utc": 1577482186, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/egh7pz/brunch_ideas/", "id": "egh7pz", "is_self": true, "score": 1, "selftext": "Anyone knows of a nice place to have brunch on a Saturday? I’ll be in the Bartlett area but I’m also going by Oak Park.", "title": "Brunch ideas"}, {"created_utc": 1577496349, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/egk43w/nye_locations_with_live_music/", "id": "egk43w", "is_self": true, "score": 1, "selftext": "We are looking for someplace to go for NYE that’ll have live music, preferably rock. Any suggestions?", "title": "NYE: Locations with live music?"}, {"created_utc": 1577508939, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/egmfkv/can_anyone_help_my_mom_walk_our_dog/", "id": "egmfkv", "is_self": true, "score": 1, "selftext": "Hi folks,\n\nDue to some unfortunate circumstances my mom can't really see. She's lost her home and I live in the city and cant be there as needed and the dog needs a short walk. I can venmo if you can help her. \n\nHit me up, we can go from there.", "title": "Can anyone help my mom walk our dog?"}, {"created_utc": 1577548563, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/egsak3/i_have_a_spare_ticket_to_tonights_chicago_steel/", "id": "egsak3", "is_self": true, "score": 1, "selftext": "I have a spare ticket for tonight's Steel hockey game, my coworker backed out at the last second. The steel attack twice from that side of the arena.", "title": "I have a spare ticket to tonight's Chicago Steel hockey game in Geneva, first row at the glass, any takers?"}, {"created_utc": 1577550246, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/egsmrn/30_rec_basketball_in_sw_suburbs/", "id": "egsmrn", "is_self": true, "score": 1, "selftext": "Hi neighbors. I recently moved to the southwest suburbs and I’m struggling to find a steady game, particularly with the colder weather. Any tips on where to find a 30 and over basketball league or good open gym? Thanks for the help!", "title": "30+ Rec Basketball in SW Suburbs"}, {"created_utc": 1577561951, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/egv3wl/does_anyone_in_the_chicagoland_area_have_a_male/", "id": "egv3wl", "is_self": true, "score": 1, "selftext": "My family has a female Scottish fold/English shorthair mix. She's had 2 litters previously and is a very healty/beautiful cat. My siblings and I want kittens but my parents want to spay her before she goes into heat anymore. So would anyone have a male cat that they would like kittens for?", "title": "Does anyone in the Chicagoland area have a Male cat they would like to breed?"}, {"created_utc": 1577564877, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/egvr92/naperville_land_of_plausible_deniability/", "id": "egvr92", "is_self": true, "score": 1, "selftext": "Naperville has banned recreational marijuana sales, but an Aurora dispensary is poised to open right across the street\nhttps://www.chicagotribune.com/suburbs/naperville-sun/ct-nvs-naperville-reaction-mayor-police-aurora-pot-dispensary-st-20191227-rhxjgcyburabjjovec3gcnlt2q-story.html", "title": "Naperville: Land of plausible deniability"}, {"created_utc": 1577581719, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/egz9kx/best_bras_plus_size_n_or_nw_burbs/", "id": "egz9kx", "is_self": true, "score": 1, "selftext": "Where would you go in the suburbs, ideally North or NW suburbs but willing to drive for this, to get really good and comfortable plus-size bras?\n\nI've been losing weight -- still a ways to go -- but I'm out of my old bras and need some new ones, and I'm not quite into straight sizes yet! But I've moved since I last bought plus-size bras. Where should I go?", "title": "Best bras? Plus size? N or NW burbs"}, {"created_utc": 1577661836, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ehdd8s/appealing_property_tax_assessment_to_state_due_to/", "id": "ehdd8s", "is_self": true, "score": 1, "selftext": "Has anyone appealed their county level property tax assessment to the state level using the “recent sale” argument? How far back does the state consider a “recent sale”? I’m assessed 10% above my actual sale price from fall of 2017 and am wondering if they’ll consider this recent enough. County said they only consider prior year sales “at their level” go figure.", "title": "Appealing property tax assessment to state due to recent sale?"}, {"created_utc": 1577732850, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ehqexk/selling_antiques/", "id": "ehqexk", "is_self": true, "score": 1, "selftext": "My dad passed away and I have a bunch of antiques from his home. I’m looking for somewhere to sell them, like a consignment type place, preferably in the NW burbs. I don’t really know their value, so somewhere that wouldn’t rip me off would be appreciated. Thanks in advance for any suggestions.", "title": "Selling antiques"}, {"created_utc": 1577745962, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ehtj20/help_2_teachers_moving_to_the_area_how_hard_is/", "id": "ehtj20", "is_self": true, "score": 1, "selftext": "My SO and I are both teachers in North Carolina. She's from Woodridge and wants to return home to be closer to friends and, if honest, the salaries are much higher than here too. We'd be looking to live/teach somewhere in the southwest suburbs I believe. \n\nShe just earned a masters, we have 7 and 8 years experience. She teaches science, I teach social studies, both high school. \n\nHow hard is it to find jobs in this area for people like us? I only have a bachelors since I grew up in NC and right now, this state doesnt pay extra for a masters. Growing up here, I had several teachers who came here to get a few years experience before moving back to NY, PA. wherever. \n\nAny input anyone may have or where I could post this for better input is appreciated!", "title": "Help: 2 teachers moving to the area, how hard is finding a job?"}, {"created_utc": 1577754696, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ehvfmj/maybe_a_stretch_but_in_search_of_comforting/", "id": "ehvfmj", "is_self": true, "score": 1, "selftext": "I don't know if this would be a better post for the suburbs or the city, but I'm looking for an FM station that has a relaxing station to listen to. Usually 10PM onwards. I distinctly remember as a kid falling asleep every Saturday as we headed out of the city back home to a relaxing woman's voice who talked about the politics and news locally, but I can't remember for the life of me what it is. I would like to find something to help me fall asleep to. Any suggestions are welcome!", "title": "Maybe a stretch, but in search of comforting late-night radio shows."}, {"created_utc": 1577888365, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eiirvb/stuff_thats_open_in_the_burbs_today/", "id": "eiirvb", "is_self": true, "score": 1, "selftext": "Our wifi is out, so sitting at home isn’t as exciting as I’d imagined it would be. Are there any things to do that are open? We like things like Dave &amp; Buster’s (which actually might be open?) or the zoo. I spend a lot of my free time thrift shopping but the stores are going to be closed. We have our meals planned so that’s covered, just.... something to do. \n\nWe’re in Warrenville but wouldn’t mind driving— even an hour or two— but with a light preference to avoid downtown.", "title": "Stuff that’s open in the burbs today?"}, {"created_utc": 1577897524, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eikf5n/dispensary_report/", "id": "eikf5n", "is_self": true, "score": 1, "selftext": "Anyone out today buying sticky icky? Can anyone report in on what it's like? I'm in west burbs, and just wondering if going today is even worth considering.\n\nFor anyone looking for the nearest dispensary, the trib has a nice map: https://www.chicagotribune.com/marijuana/illinois/ct-viz-map-of-recreational-marijuana-dispensaries-20191215-bmr5h7p755gmlfvvd36ojtctfe-htmlstory.html", "title": "Dispensary Report?"}, {"created_utc": 1577906217, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eimbdz/i_am_officially_a_law_abiding_citizen_today/", "id": "eimbdz", "is_self": true, "score": 1, "selftext": "Haven't been one of those since 8th grade. I love marijuana!!!", "title": "I am officially a law abiding citizen today."}, {"created_utc": 1577925680, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eiqj9w/west_suburb_botox/", "id": "eiqj9w", "is_self": true, "score": 1, "selftext": "Any recommendations for Botox in the west suburbs? Bonus points if you have prices. Thanks!!", "title": "West suburb Botox"}, {"created_utc": 1577980432, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eizwvh/how_are_the_weed_shops_today/", "id": "eizwvh", "is_self": true, "score": 1, "selftext": "I'm thinking of stopping by VeriLife in either North Aurora or Romeoville today...anyone know if the lines are still insane? Been to either one yet?", "title": "How are the weed shops today?"}, {"created_utc": 1578005906, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ej5w6h/has_anyone_else_been_talked_down_to_from_people/", "id": "ej5w6h", "is_self": true, "score": 36, "selftext": "Because it's happened to me a few times now. Like you must be some weirdo recluse to live in the burbs. Don't get me wrong the Chicago has a lot going for it but I think there are downsides to it too.", "title": "Has anyone else been talked down to from people that live in the city?"}, {"created_utc": 1578058002, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ejfdry/is_this_a_real_traffic_camera_violation/", "id": "ejfdry", "is_self": true, "score": 22, "selftext": "#EDIT#: This is now more of a warning to not be fooled by an email like this. After more investigation the link in the PDF that was attached is to a phishing site.\n\nI got this email today.\n\n\"Dear heavy_retirement,\n\nAttached is a citation for a traffic violation involving your vehicle, recorded by traffic camera in Schaumburg, IL. Please respond according to the instructions in the attached document.\n\nDetails of your violation are listed below: \nCode 16, Section 7 Failure to Yield in a Construction Zone\t$120.00\nCourt costs and processing fees\t$25.79\nTotal Citation Amount\t$145.79\n\nYou have the right to appeal this citation. If you wish to appeal, you may do so by following the attached instructions (PDF).\n\nDPT TSPT CITATION 3117201544\n\nPlease do not respond to this email, as it is an unmonitored address. \"\n\nIt's really well done and seems to come from \"trafficcameraviolations@idot.gov\". However there are some red flags for me: idot.gov is not a real site, why is the citation for \"failure to yield\" ( I would think it would be speeding), why is the amount so small (I thought minimum was $375 in a construction zone), since when does IDOT send out the violations (I got one before for a red light in Schaumburg and it came from the company that runs the camera), and then the PDF is not really a PDF (it has a link inside it to something else that I didn't click). Also, why would it come to my work email? I use a different one for all my personal business.\n\nAnyone else gotten one of these?", "title": "Is this a real traffic camera violation?"}, {"created_utc": 1578084426, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ejlhcy/good_hiking_trails_in_southwestern_dupage_county/", "id": "ejlhcy", "is_self": true, "score": 27, "selftext": "Thinking of hitting up a trail this weekend or maybe later on in the spring as the weather gets nicer.  I used to work right next to Hidden Lake on the border of Downers Grove/Glen Ellyn but I work off 59/Ferry now.  Thinking of Waterfall Glen but any other ideas?", "title": "Good hiking trails in southwestern DuPage county?"}, {"created_utc": 1578152501, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ejy3as/which_aldi_in_near_western_suburbs/", "id": "ejy3as", "is_self": true, "score": 10, "selftext": "I always see comments raving about Aldi, but the one by me is pretty bare-bones and doesn’t have much produce or meat. Which Aldis are you going to?", "title": "Which Aldi in Near Western Suburbs?"}, {"created_utc": 1578251218, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ekhegy/public_landing_restaurant_in_lockport_il/", "id": "ekhegy", "is_self": true, "score": 1, "selftext": "We are considering having our wedding reception at the Public Landing in Lockport IL. We are expecting about 120 guests in the upstairs banquet room. Any feedback or comments? TIA!", "title": "Public Landing Restaurant in Lockport IL"}, {"created_utc": 1578328071, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ekwcyf/looking_for_mmj_doctor/", "id": "ekwcyf", "is_self": true, "score": 1, "selftext": "Hi all,\n\nI'm looking for a doctor that will help me with the process of applying for my medical marijuana card in the Lake County area. Finding info on what docs will do this has been a bit fuzzy, google hasn't helped a ton. The condition I have was recently added in August so I'd like to explore this option, hoping to hear from some people that have personal experiences. The doctor doesn't need to be in Lake County, I'm willing to drive to get it done.\n\nThanks for any help.", "title": "Looking for MMJ doctor"}, {"created_utc": 1578329131, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ekwloe/mundelein_marijuana/", "id": "ekwloe", "is_self": true, "score": 1, "selftext": "I wanted to see if anyone had been by there today. What are lines like? Has anyone been to any other dispensaries lately?", "title": "Mundelein Marijuana"}, {"created_utc": 1578365483, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/el51ys/how_bad_is_waukegan/", "id": "el51ys", "is_self": true, "score": 1, "selftext": "I recently drove through Waukegan. I'm from the West burbs of Chicago. I was super surprised. It looked like a really bad town. Homeless people, reckless drivers, ppl blasting music from their cars, loitering, etc...\nIt honestly reminded me of the south side of Chicago.", "title": "How bad is Waukegan?"}, {"created_utc": 1578429000, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/elh7ru/isp_reviews/", "id": "elh7ru", "is_self": true, "score": 1, "selftext": "Hi everyone - I'm moving to North Plainfield next month and was wondering what people around there are doing for Internet. Looking at AT&amp;T so far - any thoughts?", "title": "ISP reviews"}, {"created_utc": 1578450394, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/elm464/metra_parking_at_university_park/", "id": "elm464", "is_self": true, "score": 1, "selftext": "Anyone commute to the city using the Metra at UP? I don’t see a monthly parking pass anywhere on the Metra, does that seriously mean I’ll have to cough up $1.50 in change a day?\n\nAm I just blind or is there another way to pay using debit?", "title": "Metra parking at University Park"}, {"created_utc": 1578535088, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/em2s6m/looking_to_rent_a_room_in_the_west_suburbs_near/", "id": "em2s6m", "is_self": true, "score": 1, "selftext": "Hello! I’m looking for an apartment to rent with a roommate, preferably west or north of O’Hare. Some towns I am considering are Bensenville, Elk Grove, Elmhurst, Des Plaines, Rosemont, and other neighboring towns. Ideally I’d like to spend less than $700. I’m 25 and female, only looking for female roommates. Let me know if you have any leads! Thanks!", "title": "Looking to rent a room in the west suburbs near O’Hare"}, {"created_utc": 1578611906, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/emhvff/stolen_car_alert/", "id": "emhvff", "is_self": true, "score": 1, "selftext": "One of my old coworkers had her car stolen from St. Charles in December (the 20th, if I’m not mistaken). It is a light blue Infiniti G37 hardtop convertible. Apparently, the thief never took the IPass out of it. Last night it was in Rockford, but frequently is driven on the 390 extension. This car has been used in multiple robberies in Fox Mill recently. Please keep an eye open if you take those routes.", "title": "Stolen car alert"}, {"created_utc": 1578617422, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/emj43f/reputable_mechanic_around_northwest_suburbs/", "id": "emj43f", "is_self": true, "score": 1, "selftext": "Moved to the area not long ago and am looking for a good mechanic who can help with basic maintenance/upkeep (oil changes, tire rotations, alignment, engine diagnostics, brake pads, battery testing, etc.) [This thread](https://old.reddit.com/r/ChicagoSuburbs/comments/d14gec/reputable_mechanic_around_northwest_chicago/) was very helpful but wanted to see if anyone else had some recommendations to look into.\n\nThanks very much in advance!", "title": "Reputable Mechanic around Northwest Suburbs"}, {"created_utc": 1578626994, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eml5k8/japanese_barber/", "id": "eml5k8", "is_self": true, "score": 1, "selftext": "Anyone have a recommendation for a Japanese barber in Chicagoland? Someone who specializes in Asian men’s hair, maybe around Arlington Heights or Palatine area?", "title": "Japanese barber"}, {"created_utc": 1578672857, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/emt3ed/if_you_were_wondering_why_the_metra_west_line_was/", "id": "emt3ed", "is_self": true, "score": 1, "selftext": " [https://www.dailyherald.com/news/20200110/metra-up-west-trains-running-again-after-crash-in-lombard](https://www.dailyherald.com/news/20200110/metra-up-west-trains-running-again-after-crash-in-lombard)", "title": "If you were wondering why the Metra West Line was having delays..."}, {"created_utc": 1578798909, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eni1tq/anyone_know_where_to_get_free_chicago_auto_show/", "id": "eni1tq", "is_self": true, "score": 1, "selftext": "For years my dad has been getting free tickets from a car dealership, I'm not sure which one but I want to say Ford or Chevy? He passed this last year and we can't find anything anywhere about anyone giving away auto show tickets. Anyone know how he was getting them, or is it too soon to be looking? He was not associated with any dealership, as a customer or as a employee so I know it wasn't through any special connection.", "title": "Anyone know where to get free Chicago Auto Show tickets?"}, {"created_utc": 1578819561, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/enlaxm/wanted_your_advice_on_whether_im_going_about_this/", "id": "enlaxm", "is_self": true, "score": 1, "selftext": "Just to summarize my situation right now:\n- Early 30's, currently live in Canada  \n- Remote (work-from-home) job     \n- I have a Visa and can work in either country (in case anyone was curious)\n- Salary about $45k USD   \n- Single, no children   \n\nMy eventual goal down the road is to:\n- Live downtown or close to in a neighborhood I like (either on long-term rent or purchase)\n- Meet new people   \n- Give up my car  \n     \n \nGiven that info, I think I have two small advantages despite my low pay ($3000/month after taxes). One, I can work remote and am not locked into a certain area where I need to be near an office. The other, is I have a friend (from Michigan) who would like to tag along for a few months since they work uber and want a change of scenary. They would cover the bills (internet, food), and I will cover the rent. They're a bit disabled so can't work long hours, but it does give me an opportunity to room with someone who has a vehicle and can help with a few expenses, at least for a few months until they move back.  \n  \nOkay, so beyond that, my questions to you people are:\n \n1) Would it be smart to seek a short-term rental using something like AirBnb even though it might cost a bit more? If so, how much do you think I should pay max?  \n  \n2) Is AirBnb the best way of securing such a thing or are there any sites/resources you'd suggest? Is hiring an agent a bad idea to find something for me if nothing good comes up on AirBnb?   \n  \n3) If my goal is to explore neighborhoods, how far outside of downtown should I go? Yes my friend has a vehicle but I'd really like to get use to taking the subway and moving/exploring the city alone when they're not available. I guess another way of asking this is, given my pay and my desire to explore neighborhoods until I find one I'd like to live in long-temr, which neighborhoods or suburbs would you recommend I explore?  \n \n4) Is there any other advice or suggestions you can give? You can be brutally honest, tell me if I'm doing something right or if anything here sounds stupid.", "title": "Wanted your advice on whether I'm going about this right. Would moving to Chi, in the burbs, on a short-term rental while exploring neighborhoods for a long-term deal a good idea?"}, {"created_utc": 1578868058, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/enummw/are_there_any_decent_community_clubs/", "id": "enummw", "is_self": true, "score": 1, "selftext": "I'm having trouble finding local groups that get together in public club for things like games or fitness as an example\nPreferably around oakbrook terrace or surrounding suburbs", "title": "Are there any decent community clubs"}, {"created_utc": 1578878333, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/enwvpk/looking_for_a_place_that_does_korean_facials/", "id": "enwvpk", "is_self": true, "score": 1, "selftext": "Hi I’ve been recently looking for a place that does Korean facials. Does anyone know a place?", "title": "Looking for a place that does Korean facials."}, {"created_utc": 1578941661, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eo8fj3/question_about_palatine_schools_stuart_paddock/", "id": "eo8fj3", "is_self": true, "score": 1, "selftext": "We found a house we love in Palatine but it's location feeds into the 3 schools in the title - does anyone in here have any experience with them? We're a little worried since they're not rated very well compared to nearby elementary/jr high/high schools, but it's hard to tell just based on ratings/rankings online.", "title": "Question about Palatine Schools - Stuart Paddock, Walter Sundling, Palatine High School"}, {"created_utc": 1578969579, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eoex0c/anyone_remember_presidents_choice/", "id": "eoex0c", "is_self": true, "score": 1, "selftext": "It's a Canadian food brand that used to be sold at Jewel (not sure where if other local chains).  They had some great stuff, I really miss their salsas and apparently the chocolate chip cookies were quite popular.  Wish they'd bring it back to the States!", "title": "Anyone remember President's Choice?"}, {"created_utc": 1579058265, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eowjq5/moving_to_chicago_suburbs_need_to_know_about_good/", "id": "eowjq5", "is_self": true, "score": 1, "selftext": "Hi, our family is thinking of moving to the DuPage county area and we have a toddler who will be starting preschool soon. I want to know what are some of the best elementary schools and what towns are they located in. We're looking to put down roots and don't want to be stuck in a bad school district.", "title": "Moving to Chicago suburbs, need to know about good schools"}, {"created_utc": 1579058851, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eowo8m/any_good_places_to_take_puppy/", "id": "eowo8m", "is_self": true, "score": 1, "selftext": "I'm from mchenry illinois and have a 10 week old maltipoo. I want to socialize him more now that hes had his 2nd vaccine. Any recommendations on puppy socials or places I can take my puppy. I'm hoping to find classes where he can interact with other puppies close to his age", "title": "Any good places to take puppy."}, {"created_utc": 1579110776, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ep5mvt/what_are_the_best_area_rummage_sales/", "id": "ep5mvt", "is_self": true, "score": 1, "selftext": "I love great deals and buying things used, but I have more luck coming across good stuff at rummage sales than thrift stores. I frequent [Oak Park's Economy Shop](http://www.economyshop.org/) which is only open a few days a month. A coworker told me about [North Shore Chicago Rummage](http://northshorerummage.blogspot.com/), which keeps a schedule of all of the sales throughout the year up North and I plan on using it this year once they update it. Does anybody know of any other good places like the Economy Shop, other good resources for finding Church and Rummage sales in the area, or just good specific sales that you've been to?\n\nI'm particularly interested in the West and Northwest suburbs, but please share any in your area. Thanks!", "title": "What are the best area rummage sales?"}, {"created_utc": 1579151706, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/epermm/missing_dog_help_find_xena_for_a_13_yo_boy/", "id": "epermm", "is_self": true, "score": 1, "selftext": "&amp;#x200B;\n\n[Xena went missing around 2 weeks ago near South Barrington. Owner is a 13 year old boy fighting stage 4 Ewing's Sarcoma who just underwent a very invasive surgery. Please share so we can reunite them! Xena's breed can travel up to 50 miles in one day. You you spot her, please don't call her or chase. You can contact the phone numbers in the article below. Professional dog tracker has been hired. Since there haven't been sightings since the 5th, there's a chance that someone found her and took her so she could be anywhere. Please read more info here: ](https://preview.redd.it/esid6m36q2b41.png?width=232&amp;format=png&amp;auto=webp&amp;s=cc61a353dd70990a2465ba757c2f3a228528b5f8)\n\n[https://chicago.cbslocal.com/2020/01/14/missing-dog-xena-jack-martin/](https://chicago.cbslocal.com/2020/01/14/missing-dog-xena-jack-martin/)", "title": "Missing Dog - Help find Xena for a 13 yo boy fighting Cancer!"}, {"created_utc": 1579199041, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/epn9w2/why_are_there_so_many_florida_plates_in_the/", "id": "epn9w2", "is_self": true, "score": 1, "selftext": "I've been commuting around the Chicago suburbs as well as the city for my job for the last 18 months. I realized there are *so* many Florida license plates I see every single day. More than Wisconsin, Indiana, Iowa, Missouri, Michigan. I'm on the road for most of my workday. I'm in different areas nearly everyday. I'd say I see 3-6 Florida license plates a day. Most of the time it's the *only* out-of-state plate I see a day. \n\nWhat's the deal? When I get to rural Illinois I stop seeing them completely. Are there just a ton of Floridians that live here?", "title": "Why are there so many Florida plates in the Chicago burbs?"}, {"created_utc": 1579218052, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eprten/looking_for_a_town_to_live_in_the_suburbs/", "id": "eprten", "is_self": true, "score": 1, "selftext": "I’m currently a college student in Wisconsin looking to move to Chicago suburbs after I graduate in May. I’m from Tennessee though. It’s a huge move but it’s for career(graphic designer) and environmental(love the area) purposes. \n\nThere are TONS of towns in the suburbs though and would like some recommendations. Here are some things I’m looking for for the ideal town:\n\n-Preferably a place with a reasonable amount of young adults like myself\n-Not a town too far out of the city...like 40 miles at most from the core of Chicago (I am also not looking into living in the city!!)\n-Diversity somewhat matters\n-A place with things to do for a young adult\n-A place that is reasonably densely populated (not a ghost town)\n\nFor reference, I’m from Murfreesboro, Tennessee. Love the place and there’s things to do but just growing too fast for it’s pace and tired of living there.", "title": "Looking for a town to live in the suburbs"}, {"created_utc": 1579235946, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/epvihc/whats_happening_to_the_sears_in_woodfield/", "id": "epvihc", "is_self": true, "score": 1, "selftext": "Just wondering if there was any information about what was happening to the Sears store in Woodfield. We went there last night and it was like it had been half emptied. \n\nIs there any official news? Are the shutting down?", "title": "What’s happening to the Sears in Woodfield"}, {"created_utc": 1579451509, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eqyfuq/where_to_donate_craft_supplies_arts_charities/", "id": "eqyfuq", "is_self": true, "score": 1, "selftext": "Hello, \n\nI'm looking to donate a few large boxes of fabric to a good home. I'd like to see first if there are any arts charities in the area that could use some nice art supplies. I'd love suggestions, thanks!", "title": "Where to donate craft supplies (arts charities?)"}, {"created_utc": 1579457005, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eqzpou/suburb_suggestions/", "id": "eqzpou", "is_self": true, "score": 1, "selftext": "My boyfriend works a 9-5 job in Schaumburg and currently lives in Naperville, he loathes the commute (roughly an hour each way, sometimes more). He’s looking to move closer to work, think Woodfield mall area. Schaumburg is awfully expensive. Are there any closer areas that would allow for a shorter commute and be affordable? Ideally somewhere in between the two towns. He’s looking to move into an apartment by himself or rent a room somewhere.", "title": "Suburb Suggestions?"}, {"created_utc": 1579468996, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/er2jos/i_heard_if_you_want_to_find_the_best_deals_on/", "id": "er2jos", "is_self": true, "score": 1, "selftext": "Like the ones for Lakeview, Edgewater, Logan Square, Rogers Park, Edison Park, etc?", "title": "I heard if you want to find the best deals on apartments to find \"the local newspaper in the neighborhood you're looking"}, {"created_utc": 1579487500, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/er6lml/free_museum_day/", "id": "er6lml", "is_self": true, "score": 1, "selftext": "Tomorrow for MLK day it’s free admission for all IL residents at the Adler Planetarium, Chicago history museum, field museum, museum of science and  industry, and the shedd aquarium.", "title": "Free Museum Day"}, {"created_utc": 1579570007, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ern9zx/favorite_karaoke_spot_in_the_suburbs/", "id": "ern9zx", "is_self": true, "score": 1, "selftext": "I’ve tried Forest Park a couple of times and wasn’t impressed. Anyone know any other good karaoke spots and if so what days of the week?", "title": "Favorite Karaoke Spot in the Suburbs?"}, {"created_utc": 1579581612, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/erpkyp/for_someone_starting_from_complete_scratch/", "id": "erpkyp", "is_self": true, "score": 1, "selftext": "I'm 31/M  and for the last decade have really become reclusive.  Mostly just go to work, come home, and sit on the computer all night.\n\nI live in the O'Hare/Rosemont area.\n\nI'm tired of wasting my life, and need to change or else my 30's will also be nothing but regret.\n\nI literally have zero idea what to do.  Like if you held a gun to my head and told me I had to go out and do a social activity tomorrow night, I would have no clue where to go and what to do.\n\nMy main hobby is playing guitar and making beats.  Other then that it's sitting around on reddit and watching netflix.\n\nThis seems like it will be 10x harder since I have no friend group to lean on.", "title": "For someone starting from complete scratch socially, what are some activities to meet people in the chicago burbs?"}, {"created_utc": 1579620689, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/erw5o1/thoughts_on_metra_commuting/", "id": "erw5o1", "is_self": true, "score": 1, "selftext": "Hi all,\n\n&amp;#x200B;\n\nI'm in the job market and I've always lived/worked in the burbs.  Now that I'm closer to the city (Lombard) than ever before, the thought of commuting downtown isn't as daunting as when I lived in McHenry County.  I've heard bad things about the Metra and all that.  Is it as bad as it sounds?  What's it like trying to catch a 4:45 PM train home?  Will I be crying/puking by day 3?   I've considered driving but I don't see that as too logical.  Is the cost of a Metra pass ($182/month, plus parking) worth not using a car daily?\n\n&amp;#x200B;\n\nThanks!", "title": "Thoughts on Metra commuting"}, {"created_utc": 1579659769, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/es5cau/taking_metra_from_suburbs_to_chicago_vs_driving/", "id": "es5cau", "is_self": true, "score": 1, "selftext": "I am temporarily located in Winfield (just west of Wheaton) and working on the South/Southwest side of Chicago. Normally, I drive to work, leaving between 5:45-6am and getting there around 7ish, more or less.....takes a tad over an hour. The most direct commute distance is 30 miles.\n\nI'm a bit nervous about being on time for work with Thursday/Friday's forecast, where it may be snowing 1-3 inches overnight and in the morning. I'm wondering....will driving 30 miles (a direct route) be doable to get to work on time, say if I leave earlier like 5ish? I need to be there by 8 at the latest. Or is Metra reliable in the snow? I can take the earliest Metra train, which gets me to the city just after 6am, and take the Orange Line. But if Metra often gets snow delays, it might just be better to drive.\n\nI'd love to hear your experiences of suburbs to city commutes in the winter. I do leave generally decently early to where traffic is only just beginning, so that might bode well for car, but maybe the plows won't be out too much. I drive an older Honda Civic, so it's not great in snow either.", "title": "Taking Metra from suburbs to Chicago vs. driving in snowy conditions....which is better?"}, {"created_utc": 1579720115, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/esgjhe/introducing_new_unmoderated_chicago_region/", "id": "esgjhe", "is_self": true, "score": 1, "selftext": "Come check it out \n\nr/chicago_illinois", "title": "Introducing new unmoderated Chicago region subreddit: r/chicago_illinois"}, {"created_utc": 1579774696, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/esr60s/recreational_basketball_near_skokie_area/", "id": "esr60s", "is_self": true, "score": 1, "selftext": "Hey neighbors, I’m currently living in Brazil, but probably moving to the north burbs in the next couple of weeks, where can I find a place that offers some recreational basketball, especially now with the colder weather?", "title": "Recreational Basketball near Skokie area"}, {"created_utc": 1579782146, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/essc4j/large_ibeams_transported_south_on_i290ei355s/", "id": "essc4j", "is_self": true, "score": 1, "selftext": "This month, on two occasions I've seen a semi-truck with a police escort carrying an enormous I-Beam southbound on I290(east) and I355. The beams themselves had to be 10 feet tall and 3 semis long. I've seen one as far south as Woodridge. Does anyone know what the heck they're building that needs such large beams?", "title": "Large I-Beams transported south on I290E/I355S"}, {"created_utc": 1579888873, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ete052/updated_chicago_unemployment_figures_released/", "id": "ete052", "is_self": true, "score": 1, "selftext": "[Official unemployment figures for the Chicago economy](https://www.bls.gov/eag/eag.il_chicago_md.htm) were updated today. Numbers for November have been finalized and preliminary figures for December have now been made available.\n\n\n**November**\n\nThe unemployment rate fell to 3.1% in November. 2,100 positions were lost, but 12,100 workers exiting the labor force caused the unemployment rate to decrease. The overall Nonfarm Payrolls figure did not change significantly. No individual sector saw significant employment changes.\n\n\n**December** (preliminary)\n\nThe unemployment rate fell to 2.8% in December. 20,800 positions were lost, but 33,600 workers exiting the labor force caused the unemployment rate to decrease. The overall Nonfarm Payrolls figure did not change significantly. No individual sector saw significant employment changes.\n\n\n^*Chicago_Statistics ^is ^a ^public ^service ^account ^committed ^to ^making ^/r/ChicagoSuburbs ^a ^better ^informed ^community.", "title": "Updated Chicago Unemployment Figures | released January 24, 2020"}, {"created_utc": 1579918191, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/etklcp/anybody_know_whats_going_on_at_arlington_heights/", "id": "etklcp", "is_self": true, "score": 1, "selftext": "Police have been there for hours", "title": "Anybody know whats going on at Arlington Heights Rd and Hintz?"}, {"created_utc": 1579934792, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/etnfmm/amita_st_alexis_medical_center_has_confirmed_case/", "id": "etnfmm", "is_self": true, "score": 1, "selftext": "Chicago Coronavirus Patient Receiving Treatment at Hoffman Estates Hospital\nhttps://www.nbcchicago.com/news/local/chicago-coronavirus-patient-receiving-treatment-at-hoffman-estates/2207002/", "title": "AMITA St. Alexis Medical Center has confirmed case of Coronavirus."}, {"created_utc": 1579934797, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/etnfnd/amita_st_alexis_medical_center_has_confirmed_case/", "id": "etnfnd", "is_self": true, "score": 1, "selftext": "Chicago Coronavirus Patient Receiving Treatment at Hoffman Estates Hospital\nhttps://www.nbcchicago.com/news/local/chicago-coronavirus-patient-receiving-treatment-at-hoffman-estates/2207002/", "title": "AMITA St. Alexis Medical Center has confirmed case of Coronavirus."}, {"created_utc": 1579967494, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/etscrs/home_theater_install/", "id": "etscrs", "is_self": true, "score": 1, "selftext": "Does anyone have a recommendation for someone to install in-wall and in-ceiling speakers out here in the burbs?", "title": "Home Theater Install?"}, {"created_utc": 1580004670, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eu0izs/have_you_seen_a_pair_of_keys_at_an_aldis_in/", "id": "eu0izs", "is_self": true, "score": 1, "selftext": "Seriously have been losing my head today and I believe I dropped my keys either inside an Aldis in Fullerton or by the Taco Bell parking lot. It has a blue curly cord wristband with an xsport tag and a purple and blue key. If anybody has spotted it please message me! Thank you!!", "title": "Have you seen a pair of keys at an Aldi’s in Fullerton?"}, {"created_utc": 1580063050, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/euagr4/wanted_adult_baseball_players_northwest_suburbs/", "id": "euagr4", "is_self": true, "score": 1, "selftext": "This is my first reddit post but I coach a men’s baseball team on a Sunday league. It’s a fun team of young 20-30 year old guys some older then 35 but I’m currently looking to add a few more guys. Our teams home field is in Carpentersville Illinois but we play in the surrounding suburbs also. I’d love to add a few pitchers to our team but will be open to other position players. \n\nWe play 2 games every Sunday and start in April/May end in October so we play a lot of baseball and it’s not expensive either most likely $100-$150 for uniform and registration total and weekly umpire money which amounts to $5 a head.", "title": "Wanted: Adult baseball players northwest suburbs of Illinois"}, {"created_utc": 1580073656, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eud5fb/bulk_garbage/", "id": "eud5fb", "is_self": true, "score": 1, "selftext": "Anyone know where I can throw out some bulk items? Mattress, old table, boxes/containers, etc. \n\nI’m around the Route 59 station.", "title": "Bulk garbage?"}, {"created_utc": 1580081306, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/euf113/is_there_a_place_in_the_burbs_that_i_could_take/", "id": "euf113", "is_self": true, "score": 1, "selftext": "After 15 years of near everyday use, the bar that holds the buckle onto the leather loop finally broke. The local jeweler said they could not fix it as it's stainless steel. Thanks!", "title": "Is there a place in the burbs that i could take my broken belt buckle to be repaired?"}, {"created_utc": 1580150869, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eusbij/midway_airport_parking/", "id": "eusbij", "is_self": true, "score": 1, "selftext": "I’m a typically solo flyer, and have usually just been dropped off at Midway. I’m wondering if anyone has suggestions for parking a car from a Saturday through Friday. Groupon has a one week deal for $52 right now, a shuttle company that says it’s a five minute drive to the airport. A good deal, but I’m not quite sure.. sometimes the third party places offsite are a little sketchy.", "title": "Midway airport parking"}, {"created_utc": 1580151143, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/euse1u/kegs_of_beer_in_stock_near_grayslake/", "id": "euse1u", "is_self": true, "score": 1, "selftext": "I'm looking to find a place where I can walk in and buy 1/4 barrel or 1/6 barrel kegs. From what I can tell, most places don't have much in stock (if anything at all). Binny's appears to be special order only. \n\nAny ideas?\n\nThanks!", "title": "Kegs of beer in stock near Grayslake?"}, {"created_utc": 1580157123, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eutwdn/real_id_at_sos_in_western_burbs/", "id": "eutwdn", "is_self": true, "score": 1, "selftext": "Has anyone attempted to get their Real ID in the western suburbs?  Are lines still crazy long?  Any location better than others? Haven't heard anything in awhile...", "title": "Real ID at SOS in Western Burbs"}, {"created_utc": 1580177479, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/euytme/is_it_possible_to_travel_between_millennium/", "id": "euytme", "is_self": true, "score": 1, "selftext": "Im looking into traveling from chicago to joliet on metra. I'll be close to millennium station, so is it possible to buy one ticket from millennium station to joliet and simply transfer to the rock island line at blue island? or would i have to purchase separate tickets for each leg?", "title": "Is it possible to travel between millennium station and joliet on one ticket?"}, {"created_utc": 1580190007, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ev1b3h/does_anyone_know_if_calumet_park_speed_cameras/", "id": "ev1b3h", "is_self": true, "score": 1, "selftext": "I’m pretty sure I was going ~41/35 in a “safety zone”,  which I’ve heard is a $35 fine in Calumet Park, but I’m worried because I was driving a company rental car and I really don’t want my boss to have to pay (even though I would pay through him),  because I already put a dent in the bumper on Friday.", "title": "Does anyone know if Calumet Park speed cameras give warnings?"}, {"created_utc": 1580220971, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ev64js/marriage_license/", "id": "ev64js", "is_self": true, "score": 1, "selftext": "My fiancee and I live in Cook county we're getting married in DuPage county a friend of ours is going to be the officiant. Does anyone know if it matters what county you get the marriage license from?", "title": "Marriage License"}, {"created_utc": 1580227782, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ev7fdq/moving_to_lombard_soon/", "id": "ev7fdq", "is_self": true, "score": 1, "selftext": "I'm in the process of closing on a townhome in Lombard. The low home prices and good accessibility to Naperville/Chicago/Ohare is what sold me. Any local recommendations? Good handyman? Favorite restaurants? Hidden gems? Have the property taxes been increasing every year for everyone? Any concern there? Schools seems decent/average I suppose?", "title": "Moving to Lombard Soon"}, {"created_utc": 1580240593, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/evaep7/thoughts_on_bolingbrook_housing_market/", "id": "evaep7", "is_self": true, "score": 2, "selftext": "\n\nJust wondering if anyone can share their insight on why Bolingbrook seems to have such a higher density of homes for sale vs. other cities in the area.\n\n\nSpecifically, we've been looking near the I-355/I-88 interchange (Glen Ellyn, Lombard, Wheaton, Downer's Grove, Oak Brook, Lisle, Westmont, Darien, Woodridge, Bolingbrook) for a single-family home, 2+ bath, 2-car garage in the $200k-$300k range, nothing crazy...\n\n\nWhat we've noticed is that there seems to be a really high density of homes for sale in Bolingbrook compared to all of those other areas I listed above. \n\n\nWe see that school ratings aren't stellar compared to surrounding areas, and crime rates seemed a bit higher in the most recent few years. Taxes are high in some areas of the community, but many are still reasonable (&lt; $7000/yr). \n\n\nBut driving around the city, it seems to be pretty fresh, clean, and not severely outdated or crowded. I get it may not be as affluent as some of the towns from the list (e.g. Oak Brook), but it doesn't seem as old and crowded as others either (e.g. Lombard).\n\n\nJust wondering if anyone lives (or recently lived) there and has any opinion on the housing market here, or if someone has bought recently and encountered a similar experience?", "title": "Thoughts on Bolingbrook housing market?"}, {"created_utc": 1580241934, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/evaqcy/moving_to_southwest_suburbs/", "id": "evaqcy", "is_self": true, "score": 2, "selftext": "I plan on moving to Orland Park within the next month. I’m moving from Kankakee, which is like 40 mins south, and have a decent amount saved to get my own apartment. I want to have more opportunities near me and experience the city life :/\n\nThis is my first time moving by myself tho. I’m only 20 and I already work full time but I’m looking for a full time job in Orland. I plan on going to Moraine Valley in August maybe. Are there any safe/good neighborhoods with cheap apartments for rent and what are some things I should know about Orland Park? I be there time from time and I think it’s a cool place to live in", "title": "Moving to southwest suburbs"}, {"created_utc": 1580260983, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/evffw9/artist_seeking_models/", "id": "evffw9", "is_self": true, "score": 0, "selftext": "Hi,\nI am an artist and have a private studio space available to me.  Seeking models (M or F) to model nude for drawing.  No experience necessary.  If you have questions just send me a chat request!\n\nLook forward to hearing from you.", "title": "Artist seeking models"}, {"created_utc": 1580261891, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/evfn4u/looking_for_housing_in_evanston_illinois/", "id": "evfn4u", "is_self": true, "score": 1, "selftext": "Hi all,My sister and her husband are relocating to Evanston, Illinois in the next few months. They are trying to \"move smart\" and research more about neighborhoods before they take the plunge on an apartment.\n\nThey are late 20's closing in on 30's, young professionals. They work a lot. While they do enjoy the occasional night out (brewery, concerts, etc) it is not a must to be near by. My brother in law is hoping to be close to a metro stop considering he will be commuting to downtown Chicago 5 days a week. The top of their budget is $1850.\n\nTaking any and all suggestions! Appreciate the help. Thanks!", "title": "Looking for housing in Evanston, Illinois"}, {"created_utc": 1580264665, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/evg8uo/local_prewedding_party_venue_wnw_suburbs/", "id": "evg8uo", "is_self": true, "score": 1, "selftext": "Hi all,\n\nMy fiance and I are going to have a destination wedding next April. We have a lot of family and friends who we are inviting, but know won't be able to go for various reasons.  \n\nWe want to have a local, casual celebration either before or after the actual wedding for those who can't go.  Honestly... This is mostly for our mom's as we are more than happy with a small destination wedding.\n\nWith that said, does anyone have any recommendations on venues to check out? Below is a \"wish list\" , but we are more than open to any suggestions of places that you like!\n\n- 150 to 200 people\n- open bar... We would love to have it at a bar / brewery\n- we are fine paying for food there or doing outside catering, really not picky.\n-We have family spread all around Chicagoland, but W/NW suburbs would be the most central.  If you know of a place not fitting this we'll still consider it!\n\nThank you in advance for any help!", "title": "Local \"Pre-Wedding\" Party Venue - W/NW suburbs"}, {"created_utc": 1580271089, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/evhkqk/where_to_swim_in_the_nw_burbs_des_plaines_area/", "id": "evhkqk", "is_self": true, "score": 1, "selftext": "Hi there, I would like to join a gym with an indoor pool, or a community/rec center in my area but I don't know where the best one is. My SO and I commute to Chicago on the Metra between Chicago OTC and Des Plaines and I'm looking for somewhere that's good, preferably cheaper, and close to where I live. Please also feel free to share any referral links for memberships if you have them!\n\nThank you.", "title": "Where to swim in the NW burbs (Des Plaines area)"}, {"created_utc": 1580359256, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/evzv6t/real_estate_chicago/", "id": "evzv6t", "is_self": true, "score": 1, "selftext": "Relatively new to chicago from Australia. I have to questions.\n1.\tWhat are the new growth suburbs to purchase a house in your opionion.\n2.\tAnyone know of masters water polo clubs around wicker park area", "title": "Real estate Chicago"}, {"created_utc": 1580401384, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ew7wh6/shen_jian_bao_in_chicagoland/", "id": "ew7wh6", "is_self": true, "score": 1, "selftext": "In Seattle, Portland, NYC and other cities I've visited in my travels I've always loved to visit informal little food stands/trucks that serve these delicious shen jian bao. The only place I know of that serves these in Chicago is the Lao Sze Chuan on North Michigan, but that's too formal and expensive of a place to go for just that. Is there any other place out in the suburbs which serves a decent jian bao? https://redhousespice.com/pan-fried-pork-buns/\nI also tried Moon Palace in Chinatown which was a bust.  Place is more or less a PF Changs - you won't see any actual Chinese people eating there.\n\nMaybe Katy's Dumplings in Westmont?", "title": "Shen Jian Bao in Chicagoland?"}, {"created_utc": 1580418738, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ewce1b/28f_looking_for_friends_to_party_on_saturday_night/", "id": "ewce1b", "is_self": true, "score": 1, "selftext": "28/F Looking to make friends who would like to go clubbing/similar events on saturday nights. I live near Vernon hills, it has been really difficult for me to make friends around here. When possible I go to Drink club in  Schaumburg or sometimes downtown if the weather is not too bad.\n\nDM me if anyone is interested!", "title": "28/F looking for friends to party on Saturday night"}, {"created_utc": 1580497073, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ewt2k7/i_dont_know_about_you_guys_but/", "id": "ewt2k7", "is_self": true, "score": 1, "selftext": "Just came by Woodfield Mall and it feels really weird not seeing Rainforest Cafe there anymore. I never got to eat there but I remember going up to the crocodile and believing it would actually eat my penny.", "title": "I don’t know about you guys but..."}, {"created_utc": 1580498471, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ewteuf/good_kcchiefs_bars_to_watch_the_superbowl_in_the/", "id": "ewteuf", "is_self": true, "score": 1, "selftext": "I just moved to the suburbs a few months ago, A few friends and I are big chiefs fans, and want to go somewhere to watch the big game on Sunday. We want to avoid the city, and stay in the suburbs. Any good spots you can recommend for chiefs fans?", "title": "Good KC/Chiefs bars to watch the superbowl in the suburbs?"}, {"created_utc": 1580516334, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ewxpvx/anyone_remember_a_mall_tour_that_disney_put_on_in/", "id": "ewxpvx", "is_self": true, "score": 1, "selftext": "This randomly came up in conversation with a friend the other day, and neither of us can remember for the life of us. The tour was fine, but the thing that's really sticking with us is that the mall had a really rad comic book store that's probably long gone.", "title": "Anyone remember a mall tour that Disney put on in the 90s for the movie Hercules? What Chicagoland mall did that tour stop at?"}, {"created_utc": 1580599863, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/exepe9/attention_to_my_fellow_busty_ladies_please_tell/", "id": "exepe9", "is_self": true, "score": 1, "selftext": "Hi ladies! \n\nI live in the Schaumburg area and haven’t been able to find any lingerie stores locally that can accommodate non-traditional sizes. I’m getting married next month and ive run into a wall. \n\nI have a difficult body type so I really want to try things on first as opposed to online, but I have an annoyingly absurd bra size and a regular pant size, so places like Victoria secret aren’t options :/\n\nIf anyone has ANY recommendations, that would be SO helpful! I’d rather not go downtown but I’m open to driving to other burbs. Thank you in advance, my full-breasted sexy sistas!", "title": "Attention to my fellow busty ladies: PLEASE tell me if you’ve found a lingerie store locally!! (NW burbs) SOS, wedding next month! 👙👡🙆‍♀️"}, {"created_utc": 1580611440, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/exhj6o/hello_rchicagosuburbs/", "id": "exhj6o", "is_self": true, "score": 1, "selftext": "Looking at potential suburbs to move too after graduation of college with the Fiancé. \n\nI lived in Franklin Park pretty much my whole life and she lived near Harlem and Irving. We are thinking Elmhurst and are kind of stuck at other suburbs any suggestions to look at? We are in agreement wanting small town charm but relatively close to the city. \n\nJust came across Riverside any thoughts on Riverside also? Thanks.", "title": "Hello r/ChicagoSuburbs"}, {"created_utc": 1580624267, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/exk77d/are_stopovers_allowed_with_one_way_tickets_on_the/", "id": "exk77d", "is_self": true, "score": 1, "selftext": "I'll be visiting Chicago soon and would like to ride South Shore Line to Michigan City, as that is one of the last remaining sections of Street running Interurban rail in the country. I would also like to check out Dune park though. Would I be allowed to get a one-way ticket from Chicago to Michigan City and make a stop at Dune Park? Or I have to get two separate one way tickets?", "title": "Are stopovers allowed with one way tickets on the South Shore Line?"}, {"created_utc": 1580654850, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/expemb/looking_for_friends/", "id": "expemb", "is_self": true, "score": 1, "selftext": "Hello All! \n\nI am looking for a friend while I travel to your beautiful city Feb5th - Feb10th. So far I had planned to do everything on my own but if anyone is free on any days please let me know!", "title": "Looking for Friends"}, {"created_utc": 1580662836, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/exrcc9/gurnee_cbd_store_a_front_for_illegal_salesbusted/", "id": "exrcc9", "is_self": true, "score": 1, "selftext": " [https://chicago.cbslocal.com/2020/02/01/four-arrested-after-tip-about-illegal-sales-employees-with-weapons-at-gurnee-cbd-store/?fbclid=IwAR0M6dhMJZ6PDjPunPfV0TyNdSlSNcdfyU8sPUPHF1P7wm4gDGKJU6ycn\\_8](https://chicago.cbslocal.com/2020/02/01/four-arrested-after-tip-about-illegal-sales-employees-with-weapons-at-gurnee-cbd-store/?fbclid=IwAR0M6dhMJZ6PDjPunPfV0TyNdSlSNcdfyU8sPUPHF1P7wm4gDGKJU6ycn_8)", "title": "Gurnee CBD store a front for illegal sales,busted."}, {"created_utc": 1580663277, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/exrga3/foodies_and_home_chefs_where_do_you_go_for_fresh/", "id": "exrga3", "is_self": true, "score": 1, "selftext": "The offerings at the grocery stores close to me feel sad, so I'm wondering if there are places around for higher quality produce?", "title": "Foodies and home chefs: where do you go for fresh produce?"}, {"created_utc": 1580695166, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/exzge2/new_victory_auto_wreckers_commercial/", "id": "exzge2", "is_self": true, "score": 1, "selftext": "Maybe I'm way out of the loop but I was surprised to see a \"new\" Victory Auto Wreckers commercial during the Superbowl.  Anyone else catch that?", "title": "New Victory Auto Wreckers commercial?"}, {"created_utc": 1580720283, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ey4biv/whats_there_to_do_in_the_skokie_area/", "id": "ey4biv", "is_self": true, "score": 1, "selftext": "I've lived in Skokie for a while, but usually spend most of my time in the city since that's where most of my responsibilities lie. I've never really had the chance to explore Skokie to the fullest besides the occasional restaurant downtown or the (obvious) Old Orchard Mall. So what is there to do in this town that may be considered underrated or easily overlooked? I'm a college student but I do enjoy a wide variety of activities, mostly finding cool places to eat or historical tidbits. Any suggestions?", "title": "What's there to do in the Skokie area?"}, {"created_utc": 1580768409, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eyf5yq/evanstonskokie_ccsd_65_students_being_taught_that/", "id": "eyf5yq", "is_self": true, "score": 1, "selftext": "This is a fact being put forth in the Evanston schools as part of their Black Lives Matter curriculum this week.  How is this being tolerated?", "title": "Evanston/Skokie CCSD 65 Students Being Taught That White Cops Shoot Black People For No Reason"}, {"created_utc": 1580775167, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eygvvy/barrington_reputation/", "id": "eygvvy", "is_self": true, "score": 1, "selftext": "Can anyone give me an overview of what Barrington, IL is like? Just looking for a general Barrington rep from people who are from Chicagoland. I live in Chicago and am from the East Coast so I have never heard of Barrington. I recently met someone from Barrington and wanted to know more about what people from the Chicago suburbs say about Barrington.", "title": "Barrington reputation?"}, {"created_utc": 1580776860, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eyha7j/what_is_your_opinion_on_glendale_heights/", "id": "eyha7j", "is_self": true, "score": 1, "selftext": "I moved here almost a year ago with my mom, newborn sister and dog. It was sudden, and never got to know the opinions here. I moved from dekalb, from which I had moved to from Carol Stream. What should I do here to get to know more. Already been to Camera Park and Glenside library", "title": "What is your opinion on Glendale Heights?"}, {"created_utc": 1580841494, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eyuo9k/looking_for_adult_baseball_softball_league_causal/", "id": "eyuo9k", "is_self": true, "score": 1, "selftext": "Super into baseball and want to start playing in a casual league. Have played in some adult softball leagues in the past.. located in Rolling Meadows area and was curious if anyone had any leads! \n\nFelt inspired by my friend in Pittsburg's league here  – [No coaches, No Umpires](https://instagram.com/pounderspgh?igshid=luzlji8slcsb) .. would love to find a group like this!", "title": "Looking For: Adult baseball / softball league – causal, dads, 25-35+ age range"}, {"created_utc": 1580911565, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/eza1bf/looking_for_volunteer_soup_kitchens/", "id": "eza1bf", "is_self": true, "score": 1, "selftext": "Just recently moved to the west subburbs and looking for soup kitchens (or similar) to volunteer at. I've already found some other volunteer opportunities through Giving DuPage, but haven't found/seen anything related to soup kitchens yet. Thanks for any information in advance!", "title": "Looking for Volunteer Soup Kitchens"}, {"created_utc": 1580997930, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ezst2a/offline_long_grove_ildd_5e_dm_looking_for_4/", "id": "ezst2a", "is_self": true, "score": 1, "selftext": "I would prefer a group of 4 players that are already friends or two groups of 2. Looking to play twice a month on Saturday or Sunday afternoon/evening.", "title": "[Offline] [Long Grove, IL][D&amp;D 5e] [DM looking for 4 players for a Homebrew game]"}, {"created_utc": 1581012533, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ezw94q/thoughts_on_libertyville/", "id": "ezw94q", "is_self": true, "score": 1, "selftext": "We’re looking at purchasing a home and are considering Libertyville. We’re both 30 and going to start a family soon &amp; live in NW burbs right now.\n\nWhat are the pros/cons of Libertyville?\nWhat’s the downtown like?\nWhat’s there to do in the area? \nThoughts on the schools? (I know they’re well rated according to the Illinois Report Card, but I would love to hear any personal experiences people have had)\n\nAny other thoughts you have and can share, I really appreciate! Thank you!", "title": "Thoughts on Libertyville?"}, {"created_utc": 1581024967, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ezzknz/local_scrapyards/", "id": "ezzknz", "is_self": true, "score": 1, "selftext": "Not sure if this is a thing, but are there any local scrapyards in the area that allow you to scavenge/forage for stuff yourself, or is this something they all do?", "title": "Local Scrapyards"}, {"created_utc": 1581032362, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f01fc7/solid_accountant_recommendations/", "id": "f01fc7", "is_self": true, "score": 1, "selftext": "I have some somewhat complicated taxes that need filing as well as previous years I'd like to review (because I don't feel my last guy did that great a job). I'm really looking for someone knowledgeable who'll be able to leverage the tax code to my benefit, not just someone who will phone it in.\n\nPlease share your recommendations!", "title": "Solid Accountant Recommendations"}, {"created_utc": 1581041905, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f03l4s/moving_to_chicago_help_on_choosing_a_neighborhood/", "id": "f03l4s", "is_self": true, "score": 1, "selftext": "I was recently offered a great job in the area and am looking for any recommendations on a good neighborhood to purchase a house. I’m an LGBTQ person, and I’m currently from a smallish town about an hour an a half from DC. \n\nMy wife and I are the type of folks who are somewhat homebody-ish, but we love to garden and walk our dogs around the neighborhood in the evenings. I’d like to live a bit outside the bustle and want to find a safer burb since we’re new to the area and don’t really know our way around. \n\nI’ve lived in RVA and Cincinnati before, so comparisons to places I know better are definitely welcome.\n\nThanks in advance!", "title": "Moving to Chicago- Help on choosing a neighborhood much appreciated!"}, {"created_utc": 1581177441, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f0te6h/is_there_a_way_to_pay_the_nicor_bill_without/", "id": "f0te6h", "is_self": true, "score": 1, "selftext": "All the options I see on their website cost money.. over the phone, local pay station, western union.  Why do we have to PAY them to take our money?", "title": "Is there a way to pay the Nicor bill without paying fees?"}, {"created_utc": 1581196220, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f0xsmq/dentist_recommendations/", "id": "f0xsmq", "is_self": true, "score": 1, "selftext": "Looking for dentist recommendations in preferably the northwest suburbs! Old dentist retired and was also near Chicago.", "title": "Dentist recommendations?"}, {"created_utc": 1581220098, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f134gv/bodybuilding_gym_recs/", "id": "f134gv", "is_self": true, "score": 1, "selftext": "can anyone point out some gyms to check out in the lombard/addison/elmhurst/melrose/ bensonville region that have a good  atmosphere and variety of equipment including deadlift platforms , maybe a mix of basic powerlifting stuff and plenty of machines? \n\nnot really worried about distance or price but rather a place that is cool with chalk, dropping weights, and not insanely packed", "title": "bodybuilding gym recs"}, {"created_utc": 1581349932, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f1s6zs/to_any_male_under_30_who_drives_a_honda_accord/", "id": "f1s6zs", "is_self": true, "score": 1, "selftext": "Please relax and let me merge. It does not help the flow of traffic to speed up and try to prevent me from merging. Please wait your turn at a four way stop. Please just relax", "title": "To any male under 30 who drives a Honda Accord, Chevy cruze, or especially a civic..."}, {"created_utc": 1581476310, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f2ka9y/dentist_recommendations_in_lislenaperville_area/", "id": "f2ka9y", "is_self": true, "score": 1, "selftext": "I need to find a new dentist. One that is open Saturdays and/or Fridays. Any recommendations and/or dentists to stay away from?", "title": "Dentist recommendations in Lisle/Naperville area"}, {"created_utc": 1581532855, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f2vtqy/restaurant_suggestions/", "id": "f2vtqy", "is_self": true, "score": 1, "selftext": "Boyfriend and I will be in area this weekend.  Just looking for a place with decent food at a decent price for a Saturday night.  Not looking to do anything too crazy.  Thanks.", "title": "Restaurant suggestions - Mundelein/Libertyville/Vernon Hills area?"}, {"created_utc": 1581547836, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f2zqpo/anyone_know_whats_being_built/", "id": "f2zqpo", "is_self": true, "score": 1, "selftext": "Anyone know what’s going on just on the corner of Salem and West of Golf in Schaumburg near the Patel Bros. Store?", "title": "Anyone know what’s being built?"}, {"created_utc": 1581605324, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f3b0vg/snow_blowingshoveling_etiquette/", "id": "f3b0vg", "is_self": true, "score": 1, "selftext": "I was just wondering when it is acceptable to start snow blowing/shoveling in the morning (especially on weekdays). I know some people have to leave fairly early in the morning for work (5AM or earlier) and if it snowed overnight, is it acceptable to snow blow/shovel before leaving for work?", "title": "Snow blowing/shoveling etiquette"}, {"created_utc": 1581652743, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f3mije/do_you_go_at_automatic_car_washes/", "id": "f3mije", "is_self": true, "score": 1, "selftext": "I thought you weren't supposed to tip \n\nI'm talking about the $3-5 car washes that are at gas stations. Or Jet Brite. \n\nI recently went to the car wash by Butterfield and rt 53. They charge $5. It's an automatic car wash but they had a car wash attendant there who wiped my car after it was washed.\n\nAnd I didn't know if I should tip him or not. \n\nI usually go to jet Brite and I never ever see ppl tip there.", "title": "Do you go at automatic car washes?"}, {"created_utc": 1581652765, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f3miqg/do_you_tip_at_automatic_car_washes/", "id": "f3miqg", "is_self": true, "score": 1, "selftext": "I thought you weren't supposed to tip \n\nI'm talking about the $3-5 car washes that are at gas stations. Or Jet Brite. \n\nI recently went to the car wash by Butterfield and rt 53. They charge $5. It's an automatic car wash but they had a car wash attendant there who wiped my car after it was washed.\n\nAnd I didn't know if I should tip him or not. \n\nI usually go to jet Brite and I never ever see ppl tip there.", "title": "Do you tip at automatic car washes?"}, {"created_utc": 1581695748, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f3u41k/motorists_of_the_suburbs/", "id": "f3u41k", "is_self": true, "score": 1, "selftext": "Why, oh why do you not move up on left turns at intersections? Why do you sit behind the line and then not complete a turn on yellow? Please explain your mentality on this behavior.", "title": "Motorists of the suburbs…"}, {"created_utc": 1581703265, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f3vz6z/michael_jordan_no_12_and_valentines_day_a_love/", "id": "f3vz6z", "is_self": true, "score": 1, "selftext": "Valentine's Day is supposed to be a day of love, compassion and selflessness. On Feb.14, 1990, a day where many indulged in romantic evenings, an angry Michael Jordan wasn't with the shits. The root of Jordan's disdain came pre-tip-off, as someone stole his iconic No. 23 jersey. Valentine's Day is supposed to be a day of love, compassion and selflessness. [https://4ormypeople.com/athletics/2020/2/14/valentines-day-mj-an-orlando-love-story](https://4ormypeople.com/athletics/2020/2/14/valentines-day-mj-an-orlando-love-story)", "title": "Michael Jordan, No. 12 and Valentine's Day: A Love Story"}, {"created_utc": 1581761450, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f47ku9/fangalangus_island_at_hollywood_park_in_crestwood/", "id": "f47ku9", "is_self": true, "score": 1, "selftext": "90’s kid and (former) south suburbanite here. \n\nWhile I’m sure a lot of us remember playing mini golf, eating terrible pizza that only a kid could love and playing endless arcade games at Hollywood Park in Crestwood, who else raced straight for the Fangalangus Island play land in the back?\n\nThis place was the dreamiest and yet spookiest play land I’ve ever seen. Discovery Zone or Leaps N’ Bounds couldn’t even hold a candle to Fangalangus Island’s LED star-lit dark caves, wrecked pirate ship with plastic ball-shooting cannons and that funky jungle music with monkey sounds and drums that perfectly accompanied the play land’s rainforest theme. You could climb through tunnels that led from the fake, giant trees into the top of the pirate ship and then slide down into the big blue ocean ball pit. \n\nAnd ffs, that talking tree with the moving mouth and eyes called Treeman Capote, lol. \n\nI’ve tried to find pictures or stories of this place online, but have never been able to find anything. I cannot be the only one who was obsessed with this place as a kid!", "title": "Fangalangus Island at Hollywood Park in Crestwood"}, {"created_utc": 1581781158, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f4b00w/average_utility_cost/", "id": "f4b00w", "is_self": true, "score": 1, "selftext": "Ok folks, so I am moving to the area from a warmer climate. I did a search trying to find how much utilities would run for a 1 bedroom where nothing was covered. I noticed a lot of places include heat and water. \n\nFor those who have heat included-does that mean you have no control over temperature?\n\nFor those who pay their own utility bill, are you usually looking at $200+ in the winter?\n\nAre there any places to avoid in the addison, villa park, bensonville region? I am trying to budget around $1100.\n\nI really appreciate all the insight!", "title": "average utility cost"}, {"created_utc": 1581829186, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f4lvok/shower_water_filter/", "id": "f4lvok", "is_self": true, "score": 1, "selftext": "I’ve been looking at water filters on Amazon but every option seems to have mixed reviews depending on the location of the buyer. I figured I’d see if anyone in nearby suburbs uses one that they would really recommend. I have no issue going out to the stores and picking one up either. Any help is much appreciated!", "title": "Shower water filter?"}, {"created_utc": 1581875548, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f4u6nf/easy_access_to_3000/", "id": "f4u6nf", "is_self": true, "score": 1, "selftext": "First of all, let us introduce ourselves. We are a clothing company from China, we sell products on the Internet, and now we need some real photos as feedback for our products, that is to find many western  faces to try on our clothes.Please contact me", "title": "Easy access to $3000"}, {"created_utc": 1581882620, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f4w162/posting_here_since_the_rchicago_bot_hates_me/", "id": "f4w162", "is_self": true, "score": 1, "selftext": "I need to take the orange line from Midway to downtown tomorrow. I downloaded the Ventra app, but it seems to only allow me to buy Metra tix. I believe I need a CTA ticket? I added value to the Ventra card (which I guess comes in the mail in 10days)...so what should I do for tomorrow? I don't have a card in hand to tap at the station. And if I did, how does the conductor know I've paid? \n\nI've tried finding YouTube videos or other FAQ's but I must be overthinking this whole damn thing.", "title": "Posting here since the r/chicago bot hates me: Probably a very dumb question, but the Ventra app has me confused."}, {"created_utc": 1581895520, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f4z8ip/moving_to_il_from_ca/", "id": "f4z8ip", "is_self": true, "score": 1, "selftext": "I may be taking a job as a Dog trainer at a well established facility in Geneva, IL. I'm looking for as many pit bull friendly resources as possible. I have three dogs, one which is a pit type, well trained, crate trained, dogs who are titled in multiple sports. I am a professional with over 10 years of experience and my dogs will be able to come to work with me from time to time. Along with rental insurance my dogs have always had their own liability insurance. \n\nI have contacted a few real estate agents, started networking with people in the dog sport community,  networking with pitbull rescues here in my area in case they know anyone. At this point no stone unturned.  \n\n\nThank you for taking the time to read this post.", "title": "Moving to IL from CA"}, {"created_utc": 1581904229, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f514cn/i_got_a_job_offer_in_merango_illinois_what_are/", "id": "f514cn", "is_self": true, "score": 1, "selftext": "What are some places with a decent number of younger people and social events?", "title": "I got a job offer in merango Illinois, what are some places I could move too in the area that are good for someone in their 20s?"}, {"created_utc": 1581966143, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f5dobl/professional_cleaner/", "id": "f5dobl", "is_self": true, "score": 1, "selftext": "Im a professional cleaner im 29 latino 210lb 5'11...i want to offer my services but naked i have pics i can clean whatever you want i hope someone reply i can do house cleaning window cleaning garage cleaning or just help you around the house if you want you can touch me o more 😉😉😝😝😜😜😜😙😙😗😗😚😚😘😘", "title": "Professional cleaner"}, {"created_utc": 1581967096, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f5dxea/should_i_rent_an_apartment_or_a_house_actual/", "id": "f5dxea", "is_self": true, "score": 1, "selftext": "I’m planning on moving in with my girlfriend and we’ll be getting either an apartment or a house. I’m looking at areas that fall in between Northbrook and Glen Ellyn, but Naperville, Lombard , Bartlett etc. work too.\n\nWhat is the actual cost of renting say a 2 bedroom house? How much does the electricity, water etc. and other bills run?\n\nWould appreciate any and all input", "title": "Should I rent an apartment or a house? Actual costs of living in your suburbs?"}, {"created_utc": 1581979674, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f5ha5h/transportation_to_downtown_chicago/", "id": "f5ha5h", "is_self": true, "score": 1, "selftext": "Hi guys! I recently got a job at Cook County Hospital downtown but I would like to live in the suburbs around Des Plaines. I would prefer to use public transportation so I mapped out a route to take the metra to Ogilvie Station and then get on the L which I've never ridden. What is the best way to go about paying for this transportation? I have the ventra app but is it really about 7$ a ride? Also, does it cost to park at the Des Plaines station? I just want to know an estimate of what this is going to cost me each day if anyone knows. Thanks, much appreciated! Laura", "title": "Transportation to downtown Chicago"}, {"created_utc": 1581982402, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f5hylt/young_couple_with_two_young_sons_considering/", "id": "f5hylt", "is_self": true, "score": 1, "selftext": "Hey everyone! \n\nMy husband and I are parents to two young boys and now understand the appeal of the burbs! We live on the NW side of the city right now and have heard great things about Niles, Evanston, and Glenview. \n\nOur hope is to purchase a home in the north suburbs but our budget is a little tight (no more than $2000/mo) because I stay at home with our kids. We don’t want to live TOO far from the city—20-30 min from the northern neighborhoods is kind of what we had in mind. We would love to be in an area with good schools, amenities, and ethnic diversity but don’t really know where to consider. \n\nWould love your input, and thanks so much!", "title": "Young couple with two young sons considering which NW Suburb to move to and would love your advice!"}, {"created_utc": 1582008283, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f5nmut/college_student_looking_for_car_for_sale/", "id": "f5nmut", "is_self": true, "score": 1, "selftext": "Im a college student just starting a partime job and im going to need a car to get around. Is there anyone in the chicago suburbs selling used cars that are good for a college student", "title": "College student looking for car for sale"}, {"created_utc": 1582022360, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f5pwsl/thanks_for_buying_me_dinner_at_browns/", "id": "f5pwsl", "is_self": true, "score": 1, "selftext": "Thanks to the woman in the black SUV who bought my 8-piece chicken and 3 sides tonight.\n\nI had first gone to White Fence Farm to find them closed, then drove all the way to Popeye's in Lisle but didn't get anything there.\n\nWhen you cut in front of me at the Brown's drive-thru it was the cherry on top of what had turned into a crappy quest for chicken.\n\nWas pleasantly surprised to learn you had paid for my order because you felt bad about cutting me off. My husband and I enjoyed our free dinner. Hope you enjoyed yours too.", "title": "Thanks for buying me dinner at Brown's :)"}, {"created_utc": 1582153338, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f6j563/considering_move_to_lake_blufflibertyville/", "id": "f6j563", "is_self": true, "score": 1, "selftext": "We're a couple in our late 20s/early 30s thinking of moving a bit father north to be close to my husband's job.  I found some nice places in Lake Bluff but the neighborhood had a vibe that was a bit more north shore.  I don't want our future children thinking of wealth as the norm. Does anyone know if there is a lot of keeping up with the Jones in that area? If it matters we would probably buy a house around $500k. We aren't poor but would rather put money towards investments than keeping up with our neighbors. We're also thinking of Libertyville but it seems like the edge of civilization to me. Any insights are welcome.", "title": "Considering move to Lake Bluff/Libertyville"}, {"created_utc": 1582212589, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f6uoay/anyone_get_their_real_id_lately/", "id": "f6uoay", "is_self": true, "score": 1, "selftext": "How brutal was it? I'm close to the Lake Zurich, Waukegan, and Deerfield Secretary of State, anybody know which locations might be quicker?", "title": "Anyone get their Real ID lately?"}, {"created_utc": 1582249553, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f73r2b/weird_request_but_can_somebody_show_me_a_picture/", "id": "f73r2b", "is_self": true, "score": 1, "selftext": "I just need to see what your price of gas is shown as. In California (where I live) it is shown as 3.299 per gallon. Does Illinois charge 9/10s of a cent as part of the tax too or would it just be 3.29?", "title": "Weird request, but can somebody show me a picture of a gas station receipt?"}, {"created_utc": 1582378177, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f7sj6q/best_companies_in_the_nw/", "id": "f7sj6q", "is_self": true, "score": 1, "selftext": "Hi, I’m starting to look for a new job in talent acquisition and I want to targeting reaching out to companies that are wonderful places to work. I know a lot of the downtown ones but bc I live in the NW suburbs I was curious on which companies are great out here. Any suggestions would be helpful!", "title": "Best companies in the NW"}, {"created_utc": 1582401203, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f7xrj2/nice_work_soldier_deployed_6k_miles_away_and_bust/", "id": "f7xrj2", "is_self": true, "score": 1, "selftext": " \n\n## [Police: Two men arrested after soldier in Iraq views burglary at Park Ridge home via doorbell camera](https://www.chicagotribune.com/suburbs/park-ridge/ct-prh-soldier-reports-burglary-tl-0227-20200222-b2aab4mlojckdes3kg5xlnvle4-story.html)\n\n📷[Chicago Tribune](https://www.chicagotribune.com/suburbs/park-ridge/ct-prh-soldier-reports-burglary-tl-0227-20200222-b2aab4mlojckdes3kg5xlnvle4-story.html)|1 hour agoA solider deployed to Iraq helped **Park** **Ridge** police officers nab two **burglary** suspects in his hometown, even though he was more than 6,000 miles away at the time, police said. According to **Park** **Ridge** police, the department received a call early Friday morning from a man who said he was a solider serving in Iraq and had just viewed a possible ...", "title": "Nice work soldier! Deployed 6k miles away and bust thieves in Park Ridge"}, {"created_utc": 1582404899, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f7yo8a/best_bbq_in_the_northwest_suburbs/", "id": "f7yo8a", "is_self": true, "score": 1, "selftext": "Hi - I have a HUGE milestone coming up that I want to celebrate and I want BBQ.  Can you please list your favorite BBQ joints in the NW suburbs?\n\nThanks!", "title": "Best BBQ in the Northwest suburbs"}, {"created_utc": 1582410817, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f802ws/out_of_curiosity_has_anyone_ever_gotten_a_ticket/", "id": "f802ws", "is_self": true, "score": 1, "selftext": "Just drove home to Bannockburn from Wisconsin, had the cruise on 90 while everyone was passing me, some people easily over 120mph. Never seen it quite this fast before, so just wondering is there actually any enforcement or can you pretty much just get away with how ever fast you want to go on it? Tri-state through Lake County has to be one of the fastest highways in the country.", "title": "Out of curiosity, has anyone ever gotten a ticket on the Tri-State for speeding before?"}, {"created_utc": 1582484474, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f8dykd/suburb_recommendation/", "id": "f8dykd", "is_self": true, "score": 2, "selftext": "Hey, everyone. I'd appreciate suggestions on a good suburb to work and live in. I am setting up to graduate in May and am interested in moving up closer to Chicago. I've always wanted to live closer to a large city, but want to make sure that the suburb that I choose is both affordable while having easy, quick access to transit into the city.\n\nFor a little background, my occupation typically makes between $30-$40 an hour in the Chicago area. I'll be the primary breadwinner and will have one family member/roommate that will be coming along with me; they've only worked entry-level minimum wage jobs and we're not anticipating on them having a job secured until after we move and they're able to apply to places. They will have a little savings in order to help pay until then, but I'm looking for housing that we'd be able to coast on with my budget alone if possible. An affordable and safe suburb with a large young, diverse community would be ideal, with plenty to do to keep us fed and entertained. House rentals are preferred over apartment, but both are being considered.\n\nI'd like to find a suburb that isn't too far out from the city (30 minutes or so?) and with accessible transit into it because we'd love to able to go into the city on a weekend or something for a festival or show or any other activities available.\n\nThe only suburb I've looked into so far is Tinley Park but would rather see suggestions from people who have a better idea of all different options.", "title": "Suburb Recommendation"}, {"created_utc": 1582569203, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f8vpjl/stores_that_sell_pink_vests/", "id": "f8vpjl", "is_self": true, "score": 1, "selftext": "I’m looking for somewhere in person where I can buy a pink vest for a special occasion. I’d be looking to buy and not rent it! I’m located near Algonquin.", "title": "Stores that sell pink vests?"}, {"created_utc": 1582570546, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f8w28o/train_vs_vehicle_arlington_heights/", "id": "f8w28o", "is_self": true, "score": 1, "selftext": " [https://chicago.cbslocal.com/2020/02/24/metra-train-hits-suv-arlington-heights-union-pacific-northwest-line/?fbclid=IwAR0YtE7-98TCLcoyv5-OWcXl-fS1zYekNo4tbq7pM-vN411c\\_af0Srvtd0k](https://chicago.cbslocal.com/2020/02/24/metra-train-hits-suv-arlington-heights-union-pacific-northwest-line/?fbclid=IwAR0YtE7-98TCLcoyv5-OWcXl-fS1zYekNo4tbq7pM-vN411c_af0Srvtd0k)", "title": "Train vs vehicle Arlington Heights"}, {"created_utc": 1582576168, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f8xk7z/small_business_lawyers/", "id": "f8xk7z", "is_self": true, "score": 1, "selftext": "[https://johnfbakerlaw.com/](https://johnfbakerlaw.com/)", "title": "Small Business Lawyers"}, {"created_utc": 1582596513, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f92pi8/wedding_venue_in_west_suburbs/", "id": "f92pi8", "is_self": true, "score": 1, "selftext": "Looking for a wedding venue (and caterer) that can host \\~150 people for an indoor reception in the Naperville area next Spring. My target budget for the venue is $3k and total budget is under $10k. Don't mind if the venue has their own kitchen and bar or if they require outside catering.", "title": "Wedding venue in west suburbs"}, {"created_utc": 1582635906, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f99ynv/lombard_area_metra_parking_advice/", "id": "f99ynv", "is_self": true, "score": 1, "selftext": "Hello\n\nI got a job offer for a company about 5 min walk from both train stations downtown. Issue is I live in Lombard (near Yorktown mall). Anyone have advice on which metra is easiest, least busy, best parking options, most express in and out? \n\nParking is probably my main concern due to added cost.  Is villa park my best option?", "title": "Lombard area metra parking -advice?"}, {"created_utc": 1582734629, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f9vtwi/fun_date_ideasplaces_to_eat/", "id": "f9vtwi", "is_self": true, "score": 1, "selftext": "For my birthday my gift is dates for every weekend for the month of March my choice. What are some of your go tos? Open to a wide arrange of things. We’re Western Suburb based.", "title": "Fun date ideas/places to eat"}, {"created_utc": 1582739697, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f9x61p/looking_for_roomroommate_in_southwestwest_suburbs/", "id": "f9x61p", "is_self": true, "score": 1, "selftext": "Hello! I'm a 23 year old woman looking for either a room for rent or a roommate to help me split costs for a place in either the southwest or west suburbs. Some areas I'm interested in include Joliet, Bolingbrook, Romeoville, and Lockport though I'm open to other areas.\n\nI want to move to shorten my commute to school and my jobs to within 30 minutes of Romeoville (I work and go to school in Romeoville but am commuting almost an hour to get there) and am looking to move some time in March though I'm open to a later time. My budget for a room is $400-$650 a month (whether renting or splitting with a roommate).\n\nFeel free to comment on this post or dm me if you have any other questions or leads. Thanks!", "title": "Looking for room/roommate in southwest/west suburbs of Chicago"}, {"created_utc": 1582742157, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/f9xtg5/realistic_reverse_commute_times_to_berywn/", "id": "f9xtg5", "is_self": true, "score": 1, "selftext": "Anyone have an estimate of realistic commute time from one of the hipper neighborhoods (Wicker Park, Lincoln Park, etc.) to Berwyn? How much does it tend to vary? Google has given estimates of 20-40 minutes but from what I have heard I fear it is actually longer", "title": "Realistic Reverse Commute Times to Berywn?"}, {"created_utc": 1582753633, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fa0xaa/small_business_lawyers/", "id": "fa0xaa", "is_self": true, "score": 1, "selftext": "[https://johnfbakerlaw.com/](https://johnfbakerlaw.com/)", "title": "Small Business Lawyers"}, {"created_utc": 1582761681, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fa305v/need_a_pizza_recommendation_quick/", "id": "fa305v", "is_self": true, "score": 1, "selftext": "Wife wants to go for pizza and beer. We’re near Naperville Wheaton border. Where should we go?", "title": "Need a Pizza recommendation QUICK"}, {"created_utc": 1582764133, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fa3knz/any_adult_field_hockey_leagues_in_the_west_or/", "id": "fa3knz", "is_self": true, "score": 1, "selftext": "Looking for an adult field hockey league. I live in Aurora but starting Monday I will work in Westmont so West or southwest suburbs will do", "title": "Any adult field hockey leagues in the west or southwest suburbs?"}, {"created_utc": 1582781555, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fa7b8a/marriage_license_without_security/", "id": "fa7b8a", "is_self": true, "score": 1, "selftext": "I posed this question in the weekly /r/Chicago discussion thread but I thought I would ask here too since I'm in the suburbs and there may be an answer to be had outside the city.\n\nLooking at obtaining a marriage license in the next couple days and trying to figure out if there are any Vital Records offices that are accessible without needing to clear a security checkpoint or submit to screening.\n\nI found [this post](https://www.reddit.com/r/chicago/comments/1esc6m/marriage_and_civil_unions_court_and_electronics/ca3fhi4) which suggests that the lower level of the Daley Center is a possibility but that section is crossed out. Not sure if that's because they realized it wasn't pertinent to OP's question or because it was inaccurate though.\n\nBecause I know people are going to ask, no I don't carry a gun, no I don't plan on doing anything nefarious. I just am highly privacy conscious and would prefer not to have to interact with any security personnel when visiting the courthouse (or whatever office we end up going to) as a non-offender for reasons unrelated to civil or criminal proceedings. \n\nAny way to get ready to get hitched without dealing with security?", "title": "Marriage license without security?"}, {"created_utc": 1582793277, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fa98y8/need_help_finding_an_area_between_lincoln_park/", "id": "fa98y8", "is_self": true, "score": 1, "selftext": "So my boyfriend and I currently live in Lincoln Park, but he works in Naperville and commutes everyday. It’s been pretty rough on him since the drive has been like 1 hour 20 both ways on average, so he loses a lot of his free time. Because of this, we were planning on moving to Naperville after our lease is up in August. However, I just got offered a promotion at my job in the city. I work in the restaurant industry, so it’s not like it’s anything too big or fancy but it does come with a raise, and I honestly like my job pretty decently. \n\nAfter getting this news, we’ve been talking about changing our plans and moving somewhere else instead. So now we’re on the lookout for a place in between Naperville and the city, specifically Lincoln Park area. I don’t know the area super well since we moved here just 6 months ago, and I’m in need of some help. We only have one car, so preferably wherever we move should have an easy/relatively quick transit to the city. I also work late occasionally (until 1-2am some nights) so I would need to be able to get home safely too.  We’re also open to possibly getting another car if we absolutely need to, but we’re both pretty fresh out of college so we’re a little short on money right now. \n\nWe really just need a place where we can both get to our jobs relatively quickly and easily. How screwed am I?", "title": "Need help finding an area between Lincoln Park and Naperville"}, {"created_utc": 1582812400, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fackbr/low_carb_keto_pizza/", "id": "fackbr", "is_self": true, "score": 1, "selftext": "Visiting my mom this weekend in Glen Ellyn. Anyone know if any local places do a keto or low carb pizza crust in the area?  I know about Lou’s but was curious about other options.  Thanks!", "title": "Low carb/ keto pizza?"}, {"created_utc": 1582818320, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fadyf2/refi_question/", "id": "fadyf2", "is_self": true, "score": 1, "selftext": "Anyone know what kind of fees, local taxes go into re-financing a mortgage?\n\n&amp;#x200B;\n\nUnderstand there are lender, appraisal etc.  Anything specific to Illinois?", "title": "Refi Question"}, {"created_utc": 1582821340, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/faeq54/recs_for_a_couple_moving_to_the_suburbs_from_a/", "id": "faeq54", "is_self": true, "score": 1, "selftext": "Hi! My boyfriend and I are moving to the Chicago ‘burbs in the next few months. For work and commuting reasons, we’d need to live in Northbrook or Glenview. Does anyone have any recs on either area? What’s housing like and are there things to do? Thanks!", "title": "Recs for a couple moving to the suburbs from a different state"}, {"created_utc": 1582854837, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fan3h4/miracle_on_hale_people_of_wheaton_what_is/", "id": "fan3h4", "is_self": true, "score": 1, "selftext": "(Not the Wheaton Theatre Company) the empty theater has been under renovation for years now. There's been fundraisers for it, there's a board that runs it, even some private events there. So why hasnt it been completed yet? Who are the people that are responsible? Will we ever see movies in it?", "title": "'Miracle on Hale'? People of Wheaton: What is Happening With Your Theater?"}, {"created_utc": 1582862426, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/faorhk/any_good_recommendations_for_cheap_auto_insurance/", "id": "faorhk", "is_self": true, "score": 1, "selftext": "I have a car thats driven 2 times per week tops but dont want to be scammed by some obscure insurance company. currently paying $120 a month.", "title": "Any good recommendations for cheap auto insurance for barely driven car?"}, {"created_utc": 1583001346, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fbgur5/western_suburbs_self_defense_classes/", "id": "fbgur5", "is_self": true, "score": 1, "selftext": "I’ve always been interested in self defense classes, but never gotten around to it. Although now, with an uptick in overall hate crimes &amp; Coronavirus giving the unspoken green light on increased aggression towards Asians I think it’s time. Are there any in the Western burbs for both men and women that are recommended?\n\nMuch thanks!\n\nP.S. I know it’s only a small handful of people that will do this but PSA: I know seeing an Asian person IRL out and about will spark your memory, but at least wait until we’re out of earshot to bring up the your thoughts about the coronavirus. Costco was lots of fun Friday, I sparked a few convos 🤦🏻‍♀️", "title": "Western suburbs self defense classes?"}, {"created_utc": 1583009084, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fbisc4/alanis_morissette_tickets_hollywood_casino/", "id": "fbisc4", "is_self": true, "score": 1, "selftext": "I have two general admission tickets for sale.\n\nhttps://preview.redd.it/0cfsi9d2dxj41.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=f9f17017146c316870a02f1bce26822d5561e8e3", "title": "Alanis Morissette Tickets - Hollywood Casino Amphitheatre - Tinley Park"}, {"created_utc": 1583010091, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fbj0oi/incubus_and_311_tickets_hollywood_casino/", "id": "fbj0oi", "is_self": true, "score": 1, "selftext": "I have two general admission tickets for sale. \n\nhttps://preview.redd.it/ygekyhg6gxj41.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;s=8c3a6c0b551790f6c4954715488673a1d1c87c53", "title": "Incubus and 311 Tickets - Hollywood Casino Amphitheatre - Tinley Park"}, {"created_utc": 1583022493, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fblvsk/where_to_dispose_of_a_juul_ecigarette_with_a/", "id": "fblvsk", "is_self": true, "score": 1, "selftext": "Not my Juul, btw. I found it while picking up trash on a walk. [I posted it](https://www.reddit.com/r/TrashTag/comments/fblkyx/i_didnt_set_out_to_pick_up_trash_on_my_walk_but_i/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) on r/TrashTag bc I found a real fun variety of trash and I’d like to think some tweens had a rockin’ party spread out over four miles.", "title": "Where to dispose of a Juul (e-cigarette with a rechargeable lithium polymer battery)? Preferably in the Western suburbs"}, {"created_utc": 1583090125, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fbyy13/new_to_elgin_area_any_reccomendations_of_things/", "id": "fbyy13", "is_self": true, "score": 1, "selftext": "24 just moved to the Elgin from Toronto from my work, hobbies are powerlifting , D&amp;D and pretty open to anything. What kind of activities do you guys like that are around the Elgin area? Any meetup groups that are active?", "title": "New to Elgin area, any reccomendations of things to do for someone in their mid 20s?"}, {"created_utc": 1583091605, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fbzbzf/teen_driver_license_process_in_illinois/", "id": "fbzbzf", "is_self": true, "score": 1, "selftext": "My son got his Learner's Permit when he was 15 from his old high school. He switched high school last year within Illinois but his new school district does not have driver's ed. Now he is 17.5 years old. His learner's permit will expire this summer. Someone told me IL has a rule that teenagers older than 17 years and 3 months don't have to take the state approved driver education classes, is that only for obtaining a permit? What are these online driver ed classes that are on the DMV page now? What are the next steps to get his DL?", "title": "Teen Driver License process in Illinois"}, {"created_utc": 1583178277, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fchoop/recommendations_for_concrete_jacking_in/", "id": "fchoop", "is_self": true, "score": 1, "selftext": "Looking to have the concrete floor in my garage jacked. Preferably polyurethane jacking.\n\nJust wondering if anyone has any experience with any companies in the area for this service, and curious of your opinion and cost for the service you had done?", "title": "Recommendations for concrete jacking in Chicagoland"}, {"created_utc": 1583245199, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fcv7u1/a_colleague_just_told_he_he_had_a_brother_who/", "id": "fcv7u1", "is_self": true, "score": 1, "selftext": "I had never heard of it. Turns out it is 50 miles southeast of Joliet.\n\n[https://goo.gl/maps/jcdrvBFf32cEeKVT7](https://goo.gl/maps/jcdrvBFf32cEeKVT7)\n\nWe don't live in the area anymore, but I thought this was funny.", "title": "A colleague just told he he had a brother who lives in \"the burbs\" outside Chicago. I asked where and he said \"A town called Munster."}, {"created_utc": 1583278715, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fd3spj/divorce_lawyer_recs/", "id": "fd3spj", "is_self": true, "score": 1, "selftext": "Not even sure how to go about this, I figure yelp isn’t the way to go though. \n\nSuggestions for divorce lawyers in North or Northwest suburbs? We don’t have a house or kids and just have a joint bank account. Don’t want to spend a ton of money on this and want it to be quick.\n\nThank you for your suggestions.", "title": "Divorce lawyer recs?"}, {"created_utc": 1583282958, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fd4rjn/20_cent_steakburgers_and_fries_right_now_from/", "id": "fd4rjn", "is_self": true, "score": 1, "selftext": "I just got 5", "title": "20 cent steakburgers and fries right now from Steak n Shake on Uber eats"}, {"created_utc": 1583293712, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fd74zc/niles_leaning_tower_getting_ready_for_post/", "id": "fd74zc", "is_self": true, "score": 1, "selftext": " [https://www.journal-topics.com/articles/niles-leaning-tower-bells-ready-to-ring-grand-opening-eyed-for-june/?fbclid=IwAR2CY8mX9aBZa0CeVfxQ4sVKBokM-xdkiW2Xaf9Mnh6E\\_zXK\\_pAQza2x6NU](https://www.journal-topics.com/articles/niles-leaning-tower-bells-ready-to-ring-grand-opening-eyed-for-june/?fbclid=IwAR2CY8mX9aBZa0CeVfxQ4sVKBokM-xdkiW2Xaf9Mnh6E_zXK_pAQza2x6NU)", "title": "Niles Leaning Tower getting ready for post renovations re-opening"}, {"created_utc": 1583426623, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fdxzfi/trails_and_access_roads_at_several_northwest/", "id": "fdxzfi", "is_self": true, "score": 1, "selftext": " \n\nTrails and access roads at several Northwest suburban sites in the Forest Preserves of Cook County will receive trail and access road improvements in the next two years, officials announced.\n\nThe access road and parking upgrades include: 165 Algonquin Road near Barrington Hills -- $570,000 for design and improvements; Campground Road Woods near Des Plaines -- $264,450 for design and improvements; Northwestern Woods near Des Plaines -- $214,800 for design and improvements; Axehead Lake near Des Plaines -- $343,600 for improvements; Busse Lake Boating Center No. 17 near Elk Grove Village -- $399,800 for improvements; and Ned Brown Meadow near Elk Grove Village -- $945,000 for design and improvements.\n\n \n\nPlanned trail improvements include: Deer Grove No. 1 to cul-de-sac near Palatine -- $13,300 for design; Paul Douglas Trail near Hoffman Estates -- $250,000 for improvements.\n\nIn all, more than 55 preserves will receive upgrades through a $25 million intergovernmental agreement between the Cook County Department of Transportation and Highways and forest preserve district.", "title": "Trails and access roads at several Northwest suburban sites to receive improvements."}, {"created_utc": 1583500833, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/feddb7/cubs_white_sox_season_previews/", "id": "feddb7", "is_self": true, "score": 1, "selftext": "Baseball fans on both sides of town can find my pollyannish White Sox season preview tucked below a less optimistic scouting report for this year's Cubs. I didn't pick the headline but I did pick the team for over 90 wins. \n\nhttp://www.banishedtothepen.com/season-preview-series-2020-pt-2-bos-chc-chw/", "title": "Cubs &amp; White Sox Season Previews"}, {"created_utc": 1583501344, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fedh0b/does_anyone_have_a_window_guy_they_recommend/", "id": "fedh0b", "is_self": true, "score": 1, "selftext": "I have to replace two windows in a house I’m purchasing in aurora and would like to know\nIf anyone has anyone they recommend.", "title": "Does anyone have a window guy they recommend?"}, {"created_utc": 1583515809, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fegvei/woodridge_considering_buying_a_home/", "id": "fegvei", "is_self": true, "score": 1, "selftext": "My wife and I (early 30s) are thinking of buying a home in Woodridge, specifically north of 75th street.  We currently don't have kids, but we will in the future.  I work in Naperville and my wife works both in Naperville and La Grange, so it seems like a good option geographically.  Homes we're looking at are in the $300s...most are older, but decent square footage (2000-2500sqft).  \n\nAnyone have any familiarity with the area?  Pros/cons?  Thanks!", "title": "Woodridge - Considering buying a home"}, {"created_utc": 1583551977, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fepg5p/i_hate_this_real_id_crap/", "id": "fepg5p", "is_self": true, "score": 1, "selftext": "\nSo today I was at o’hare with my father, waiting in line for security.  There was a couple in front of us speaking French, When it was going to be their turn to have their IDs checked and tickets scribbled on, I noticed they pulled out Quebec drivers licenses.  Turns out they were French Canadians.  TSA guy doesn’t say anything, just puts them under his black light, scribbles on their tickets and wishes them a good flight, like anyone else.  Well now it’s my father’s turn, he goes up, hands over his IL license and the guy immediately goes “Sir this isn’t a REAL ID, after September this license is going to be invalid and you won’t be able to use it blah blah blah” so I ask the guy about the quebecois couple he just checked, and he said that Canadians will be okay to use their licenses but all us AMERICANS WILL HAVE TO GET NEW IDs! That is total BS that Canadian drivers licenses which obviously don’t participate in REAL ID will continue to be accepted, but Americans with US DLs without the stupid yellow star risk being refused for their flights.  What kind of bullshit is that?! I have 0 problems with Canadians being able to use their license down here, what I do have an issue wirh is the hypocrisy that they’ll accept foreign DLs over American DLs without the stupid star after October.", "title": "I hate this REAL ID crap!"}, {"created_utc": 1583562025, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fer9xm/any_indians_here_by_chance_that_can_recommend/", "id": "fer9xm", "is_self": true, "score": 1, "selftext": "Is it weird to ask for Indians opinions on Indian food? I don't know but I'm going to anyway. Once upon a time I had some butter chicken at Mast Masala in Hanover Park that blew my mind. It was beyond good. But sadly the restaurant changed hands and it was never the same again. \n\nI'm hoping somebody might be able to guide me to a dish at a place they know that can equally blow my mind. I love spicy, but I don't love seafood that much. I'd love to hear some recommendations. Please and thank you. \n\nAlso, any good thali places? I love trying an assortment of things.", "title": "Any Indians here by chance that can recommend some great Indian food? Preferably near Southwest burbs."}, {"created_utc": 1583599523, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fexnxc/for_anyone_interested_in_local_updates_regarding/", "id": "fexnxc", "is_self": true, "score": 1, "selftext": "Just want to make a quick PSA. We have a sub set up specifically to track outbreaks and information regarding Illinois at r/coronavirusillinois\n\nA lot of what’s going on over there is filtering stuff from the National r/coronavirus group and sharing information regarding school closings, testing sites, and stores/what’s in stock.\n\nThe sub is growing quickly and with CDC testing coming out in the next week or so it might be one you’ll wanna keep up on. \n\nThanks!", "title": "For anyone interested in Local Updates regarding COVID-19/Coronavirus"}, {"created_utc": 1583600400, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fexveh/suburban_dispensary/", "id": "fexveh", "is_self": true, "score": 1, "selftext": "Anyone been to a cannabis dispensary in the NW suburbs? Seems like it’s medical only in every town near me. Still very long lines and low stock?", "title": "Suburban Dispensary"}, {"created_utc": 1583620684, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ff2vcf/looking_for_an_artist_to_do_repaintings/", "id": "ff2vcf", "is_self": true, "score": 1, "selftext": "My brother just inherited two landscape paintings from my grandparents. He is interested in having them repainted. Open to suggestions. \n\n\nhttps://imgur.com/gallery/bKtIHDH", "title": "Looking for an artist to do repaintings"}, {"created_utc": 1583622949, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ff3es9/where_to_get_a_trailer_hitch_installed/", "id": "ff3es9", "is_self": true, "score": 1, "selftext": "I'm looking to get a hitch installed on my Mazda3 (for a bike rack, not towing). I know about rackattack in Skokie, and I'm also considering ordering from etrailer.com and installing it myself. Are there any other places I should consider?", "title": "Where to get a trailer hitch installed?"}, {"created_utc": 1583674387, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ffcl3y/shipping_car_to_seattle_wa_and_need/", "id": "ffcl3y", "is_self": true, "score": 1, "selftext": "My husband and I are moving to the Seattle area at the end of April, and will need to ship my Kia Forte. (We will be driving his car in the move).\nCan anyone recommend a good company in the area to ship my car? We would prefer to keep the cost under $1,000.", "title": "Shipping car to Seattle, WA and need recommendations."}, {"created_utc": 1583682496, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ffearh/options_for_neighbors_dogs_barking/", "id": "ffearh", "is_self": true, "score": 1, "selftext": "My neighbor has two small dogs that bark nonstop.  They have their windows open all the time and whether I'm in my own yard or driveway, I get barked at.  They're rarely home so it's incredibly frustrating.  With warmer weather coming, my two young children will be spending more time outside and it's one thing to bark at me but another to bark nonstop at my kids.  I plan on talking to my neighbor about it one of these days, but challenging when they're rarely home.  Trying to figure out my options here (unincorporated Cook County).  Thanks.", "title": "Options for neighbors dogs barking?"}, {"created_utc": 1583853829, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fgfhb5/sex_tourism_in_the_chicago_suburbs/", "id": "fgfhb5", "is_self": true, "score": 1, "selftext": "I’m gonna be in the north shore Chicago suburbs for the first time this summer visiting family. I was wondering if there are any must-see places for an avid sex tourist. I’m done with touristy stuff so recommend me something only locals know about. I’m renting a car so I can drive pretty much anywhere in the Chicago area if there’s somewhere I should visit outside the north shore. Can you help an avid sex tourist plan a trip to the north shore Chicago suburbs?", "title": "Sex tourism in the Chicago suburbs?"}, {"created_utc": 1583879276, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fgmex8/heli_over_barrington_rt_14_hillside/", "id": "fgmex8", "is_self": true, "score": 1, "selftext": "Anyone know why there was a helicopter hanging out over the west side of Barrington today around lunch time? I stopped at the Ace and he was basically just chilling directly overhead. Of course, because he was overhead, I couldn't make out any markings. \n\n[best side shot I could get](https://preview.redd.it/c952wvle8xl41.png?width=1145&amp;format=png&amp;auto=webp&amp;s=7bd221b0b7582a6763f4424572078baded997711)\n\n&amp;#x200B;\n\n[directly over my head for a few minutes](https://preview.redd.it/krb53oap8xl41.png?width=691&amp;format=png&amp;auto=webp&amp;s=bc8cace4c91c62baa147af7b2a21f3962a9648ca)", "title": "Heli over Barrington/ Rt 14 &amp; Hillside"}, {"created_utc": 1584038442, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fhl72u/car_meets/", "id": "fhl72u", "is_self": true, "score": 1, "selftext": "Any other Genesis Coupe owners? Also who has the plug for the meets ;) hmu", "title": "Car meets?"}, {"created_utc": 1584038947, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fhlc2t/anyone_notice_a_free_for_all_at_stores_today/", "id": "fhlc2t", "is_self": true, "score": 1, "selftext": "I was at Whole Foods in Willmette earlier today, I went into the bathroom to wash my hands and while I was doing that, some guy came in, went into a stall and took the toilet paper roll and walked out.  I noticed most shelves are like half empty if not more, at least 75% of the frozen food is gone.  Everyone’s walking around with massive carts filled to the brim with non perishables.  Saw some lady go to the frozen carrots, just dump the whole shelf in her cart, then walk over to some random frozen dinners, dumped at least 15 in her cart and walked off.  It feels like the whole mood on the coronavirus has changed overnight and people are panicking.  Anyone else notice this today?", "title": "Anyone notice a free for all at stores today?"}, {"created_utc": 1584125809, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fi4qyk/most_dupage_county_schools_closed_through_april/", "id": "fi4qyk", "is_self": true, "score": 1, "selftext": "Just got the news mine and most DuPage county schools are closing through April 6th and doing remote learning, this includes canceling all school activities. Official news outlets I imagine will pick up on the story later but for now, the school has just done announcements about it.", "title": "Most Dupage County Schools closed through April 6th"}, {"created_utc": 1584131825, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fi6dhy/dupage_county_short_on_election_judges_14_polling/", "id": "fi6dhy", "is_self": true, "score": 1, "selftext": "[DuPage County Clerk's Office](https://www.dupageco.org/election/) had a bunch of election judges drop out of the upcoming election on Tuesday, March 17th due to coronavirus concerns.  \n\nIt was severe enough that 14 polling locations have been closed and they're desperately looking for replacement judges.\n\nPay is increased to $200 for the day (6am-7pm). \n\nJudges must be 18 years old &amp; a registered voter in DuPage County.  If you're free on Tuesday &amp; wanna make $200, check out the link at the beginning of my post or call their office at (630) 407-5600.", "title": "DuPage County short on election judges, 14 polling sites relocated &amp; pay increased for election judges."}, {"created_utc": 1584204839, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/filex9/ballroom_dancing_in_northwest_burbs/", "id": "filex9", "is_self": true, "score": 1, "selftext": "Probably not reading the room with all the corona virus posts but once this is all done I would like to take my wife dancing. I can’t find anywhere to just take her dancing without it being an actual dancing school. \n\nAny recommendations? Especially in the Shaumberg area but not limited to it.", "title": "Ballroom dancing in Northwest burbs?"}, {"created_utc": 1584210461, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fimy8x/theres_a_text_flying_that_a_man_pulled_gun_on/", "id": "fimy8x", "is_self": true, "score": 1, "selftext": "I’m working retail in a pharmacy and our manager just told us she got a text message about an incident in north Aurora a man pulled a gun on a shopper...be careful guys.", "title": "There’s a text flying that a man pulled gun on north aurora for toothpaste...Fake or not stay safe guys!"}, {"created_utc": 1584235609, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fitga8/lake_county_waukegan_area/", "id": "fitga8", "is_self": true, "score": 1, "selftext": "Where can we still find hand sanitizer in stock ?", "title": "Lake county Waukegan area"}, {"created_utc": 1584294497, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fj58kc/coronavirus_situation/", "id": "fj58kc", "is_self": true, "score": 1, "selftext": "Hello friends and neighbors. Due to the Coronavirus situation, my company has laid off a good majority of their employees. Myself included. If anyone knows where I can get a job in the mean time, that would be fantastic. I work in tech and aviation. at the point I would be happy to look at jobs in an field. If anyone has leads, I would be forever grateful!", "title": "Coronavirus situation"}, {"created_utc": 1584321731, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fjcjju/the_state_should_reopen_metro_south_hospital_as_a/", "id": "fjcjju", "is_self": true, "score": 1, "selftext": "Staff it will young doctors and nurses that are willing to volunteer from hospitals all over the state.  Bring every ventilator that they can beg, borrow, or steal along the way.", "title": "The state should re-open Metro South hospital as a dedicated COVID-19 hospital."}, {"created_utc": 1584396906, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fjtksv/does_anyone_know_if_gyms_are_closing_or_are_closed/", "id": "fjtksv", "is_self": true, "score": 1, "selftext": "Does anyone know if Gyms are closing or are closed? (Xsport, Anytime Fitness, Planet Fitness, LA Fitness, Life Time Fitness, etc...). I find it odd that schools, libraries, and other institutions &amp; companies are closed but all the gyms I check on Google say \"Open\". 🤔", "title": "Does anyone know if Gyms are closing or are closed?"}, {"created_utc": 1584397360, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fjtp74/is_limiting_the_amount_of_people_that_can_be/", "id": "fjtp74", "is_self": true, "score": 0, "selftext": "Is limiting the amount of people that can be around each other just dragging this out longer?\n\nDon’t get me wrong staying home is great when I decide to do with myself NOT when I’m forced\nWith that being said\nthere are two types of people that I can think of during this time\nThe type that are staying home right now in fear of getting this virus\nAnd the type that are running around living it up because they are either not working or doing things while they can until they are forced to stay home\nThe numbers that I have been following every day Are just a waste of time\n until there’s a place that everyone can go and get tested to know if they’re able to safely move around in public \nOr should be staying at home until they test clear there will not be a slow in the spreading of this at all\nI would like it if I only had to say in my house for 2-4 weeks \nNot 2-4 months", "title": "Is limiting the amount of people that can be around each other just dragging this out longer?"}, {"created_utc": 1584403016, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fjv7t2/does_anyone_know_any_stores_that_have_restocked/", "id": "fjv7t2", "is_self": true, "score": 1, "selftext": "Kind of getting worried in the elmhurst area the shelves haven’t restocked yet in the past 3 days and essentials like milks,vegetables ,water and frozen dinners r nill to nonexistent. I also cannot b driving all over the county’s just to find stuff. Last Thursday I went to  9 stores just to get basic groceries. Pls does anyone know or have a way of finding it whats where?", "title": "Does anyone know any stores that have restocked yet?"}, {"created_utc": 1584405243, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fjvryd/sos_offices_are_closed_yet_we_can_still_vote/", "id": "fjvryd", "is_self": true, "score": 2, "selftext": "All events with more than 50 people are being postponed.\n\nDine-in bans are in place for restaurants and other places serving food/beverages.\n\nNow, all Secretary of State offices are being closed. - https://www.nbcchicago.com/news/local/illinois-secretary-of-state-facilities-to-close-starting-tuesday/2238270/\n\nIf the situation is dire enough to necessitate the closing of government offices, how does the same reasoning not apply to elections? How is it appropriate to not postpone the primaries? This is such a terrible case of voter suppression, even if there wasn't such malicious intent. My mother, for example, has lymphoma and is immunocompromised; do you think she's going to wait in line to vote tomorrow? Nope.\n\nWhat about all of the young people, who could carry the virus while being asymptomatic, increasing the risk of spread?\n\nWhy is this not a bigger issue?", "title": "SOS offices are closed yet we can still vote tomorrow?!?"}, {"created_utc": 1584410523, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fjx2d2/best_place_to_get_kittens/", "id": "fjx2d2", "is_self": true, "score": 1, "selftext": "I'm in Elgin.", "title": "Best place to get kittens?"}, {"created_utc": 1584446710, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fk43bm/if_anyone_is_unable_to_get_to_a_polling_place/", "id": "fk43bm", "is_self": true, "score": 1, "selftext": "Seriously, your vote counts. If you are unable to get to a polling place please contact me and I will take you to vote.", "title": "If anyone is unable to get to a polling place today, I would be more than happy to drive you."}, {"created_utc": 1584457462, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fk6r3u/polling_place_problem_at_forest_park/", "id": "fk6r3u", "is_self": true, "score": 1, "selftext": "There are two election judges working the Proviso 072 polling place in FP. They’re doing their best but I wasn’t able to register today because my license had an old address and they said I needed to drive back out to DuPage to vote. I’m very confused because I voted in Chicago when I lived there last year.\n\nReally though I’m mad at the old people yelling at me for not registering beforehand. They’ll be the same democrats complaining about young people not voting, when I did everything I was told to do and still was unable to vote", "title": "Polling place problem at Forest Park"}, {"created_utc": 1584467699, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fk9pab/sources_for_hyperlocal_news/", "id": "fk9pab", "is_self": true, "score": 1, "selftext": "Just discovered this sub - very useful for general Chicago suburban news.\n\nI'm in Wadsworth (just north of Gurnee). Does anybody have recommendations for other subreddits or sites that are more specific? Is there a Gurnee or Lake County subreddit? \n\nI just signed up for Nextdoor, seems ok but only a few locals plus a lot of ads. Our nearest [Patch.com](https://Patch.com) group seems to be for Grayslake.\n\nThanks for any advice!", "title": "Sources for hyperlocal news?"}, {"created_utc": 1584470503, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fkajyz/any_experience_with_k_hovnanian_homes/", "id": "fkajyz", "is_self": true, "score": 1, "selftext": "Hello, neighbors! We are thinking about purchasing a new construction home through K. Hovnanian. I read that their reliability and quality are region dependent so I thought I'd come here and see if anyone has any experience with them one way or another. \n\n&amp;#x200B;\n\nIf anyone recently bought a new construction house I'd also be interested in hearing any advice or things you wish you'd have thought about/planned for.", "title": "Any Experience with K. Hovnanian Homes?"}, {"created_utc": 1584480650, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fkdifi/if_you_are_hoarding_at_this_time_shame_on_you/", "id": "fkdifi", "is_self": true, "score": 1, "selftext": "Shame on you for hoarding! There are ppl who don’t have enough money ,who have been laid off and people with children and pets. Don’t you understand? What will the person with limited money do when they can’t buy pasta and cracker because you hoarded it all? There are ppl laid off who are working in those stores or are trying to get enough with their unemployment benefits. And you and your selfish ass decide to hoard all the bread and milk, and expose them to more dangerous environments ! There are ppl with pets and kids at home! How are they going to feed them? Where are they going to go? Do you hoarders have any shame ? On this difficult time hoarding anything you can get your hands on is shameful and indecent! Now is the time to get your essentials and stay inside your house. If your neighbor needs something you should share it or help them. Think about for a second. If you keep coming to the store and hoard everything more people will get exposed,more people will panic and more problems will result ! Stop hoarding and take your essential for one week! Not the entire aisle of a store alright?", "title": "If you are hoarding at this time shame on you!"}, {"created_utc": 1584487324, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fkfbrj/fridge_hoarding/", "id": "fkfbrj", "is_self": true, "score": 1, "selftext": "You morons moved from hoarding toilet papers and water, to refrigerators now?", "title": "Fridge hoarding"}, {"created_utc": 1584488492, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fkfmr2/people_posing_as_gov_workers_alert_issued_by_hhpd/", "id": "fkfmr2", "is_self": true, "score": 1, "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/u4r0tmdxjbn41.png?width=960&amp;format=png&amp;auto=webp&amp;s=dcc3064e5e71cf825f019ec95722629927870e27", "title": "People posing as gov workers (Alert issued by HHPD)"}, {"created_utc": 1584505251, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fkjls7/household_items_for_sale_pm_me/", "id": "fkjls7", "is_self": true, "score": 1, "selftext": "Toilet paper rolls: $10 each. \nHand sanitizer (Walmart brand): $20 \nLiquid hand soap: $10\nCotton swabs: $12\nBottled water 24-pack: $10\nShampoo: $15\nTampons: $20\n\n\nBulk discounts available also. I have a huuuge stash of this stuff. Especially toilet paper.", "title": "Household items for sale. PM ME"}, {"created_utc": 1584560856, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fkvtih/what_do_non_vanity_liscence_plate_colors_mean/", "id": "fkvtih", "is_self": true, "score": 1, "selftext": "I've always wondered this. I coulden't find this online. But what do liscence plate colors even mean? Like I know a IL liscence plate with green letter is a IL goverment vehicle. The orange plates are like taxi/ limo.\n\n&amp;#x200B;\n\nBut what does the peach/pinkish colored one mean? Also why do some liscence plate have single letters like \"G S\" as their liscence or simply \"A\".\n\n&amp;#x200B;\n\nIs there any very basic guide to this instead of doing hours of research.", "title": "What do non vanity liscence plate colors mean?"}, {"created_utc": 1584588001, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fl2ztj/the_711_near_me_had_tons_of_water/", "id": "fl2ztj", "is_self": true, "score": 1, "selftext": "If anyone is hurting, the 7/11 on Thorndale and 53 in Itasca just got a water shipment in. They got limits I think so the bullshit hoarders can keep driving.", "title": "The 7/11 near me had tons of water"}, {"created_utc": 1584619326, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fl8wfh/food_banks_need_your_help_now_more_than_ever/", "id": "fl8wfh", "is_self": true, "score": 1, "selftext": "If you're able to spare a few bucks, donating to your local food bank/pantry is extremely helpful. Rescuing food (we drive to local stores to pick up undesirable food/goods) and donations has been incredibly light the last two weeks. A monetary donation goes a long way for the pantry to be able to purchase exactly what they need when they need it. \n\nIf you're off work or school, young, and healthy...please consider volunteering. We've spent days building \"pre-pack\" boxes for clients for curbside service. Most of the volunteers at my particular food bank are elderly, therefore they're incredibly vulnerable and also not nearly as speedy as we need. Demand is increasing daily and we need sharp, quick volunteers to handle this sudden change. \n\n[This is one resource for you. But I suggest checking out your local food pantry/banks for additional information. There is a link in the one I provided where you can enter your zip code for the nearest pantry.](https://solvehungertoday.org/coronavirus/)", "title": "Food banks need your help now more than ever..."}, {"created_utc": 1584626295, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/flafyo/moving_to_il/", "id": "flafyo", "is_self": true, "score": 1, "selftext": "We live in Manhattan and my husband got a job in Dekalb. His future coworkers and friends in IL recommend not to live in Dekalb but the suburbs between Dekalb and Chicago (Aurora,South Elgin). Any suggestions for a town with good schools (we have an infant), a cute downtown area with cafes and an easy commute from Dekalb? Is living in Dekalb a bad idea?", "title": "Moving to IL"}, {"created_utc": 1584632178, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/flbzy2/seeking_help_for_my_grandmother/", "id": "flbzy2", "is_self": true, "score": 1, "selftext": "I was talking to my grandmother this morning over the phone to check up on her, when she told me she plans to go out and do grocery shopping among other errands.\n\nI love my grandmother, but she can be independent to a fault, and this is one of those times.  \nShe is in her mid 80s and has been feeling under the weather for a couple months now (unrelated to COVID-19). Naturally, I am worried. Due to her age and current state of wellbeing, she places her health in a vulnerable position by going out to public areas with a lot of people.\n\nUnfortunately, I don't live close to her, nor do I have a car.\n\nDespite working for a healthcare company and being extremely busy, my uncle (my grandma's son) happily runs errands for her and typically would do so, because they live so close to one another.  \nMy grandmother expressed today that she doesn't want to bother him, and I insisted it is no bother.  \nI was able to inform my uncle, and he is presently on the phone with her to try and talk her out of going out today.\n\nIn my neighborhood, we have a lot of people volunteering to run errands for those who are more susceptible to COVID-19, and this gave me the idea to reach out to this Subreddit.  \nIf anyone lives in the Northern suburbs and is willing to help run errands for my grandmother during the times when my uncle cannot, please direct message me. Thank you for your kindness and time!", "title": "Seeking help for my grandmother"}, {"created_utc": 1584642006, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fleu0i/does_anyone_need_toilet_paper/", "id": "fleu0i", "is_self": true, "score": 1, "selftext": "I know many stores are sold out cause ppl are hording them. If you need some hmu. $5 per roll. Bulk discounts available.", "title": "Does anyone need toilet paper?"}, {"created_utc": 1584650716, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/flhgem/chicagoland_gamers_discord/", "id": "flhgem", "is_self": true, "score": 1, "selftext": "Hey there (gamers), Discord is a chatroom / voice chat / streaming application that is used by millions of people around the world to stay connected daily. During this time where many of us are doing a bit of social isolation, I thought it would be nice for some of us to be able to play some games together with local people and make some friends despite us not being able to go out! I welcome to you join our small but growing community at :   \n\n\n [https://discord.gg/ck4skf6](https://discord.gg/ck4skf6)   \n\n\n(all are welcome but we are specifically a gaming focused group! thanks for your time :D )", "title": "Chicagoland Gamers Discord"}, {"created_utc": 1584714698, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/flvyjo/come_support_local_in_st_charles/", "id": "flvyjo", "is_self": true, "score": 1, "selftext": "For those near the St. Charles area, come support our local businesses! Check out these lists of St. Charles businesses offering take-out and delivery, where you can get gift cards and gift certificates, and listing of jobs in the area. Come out and support local in these tough times!\n\nTake-out and delivery -  [https://www.stcalliance.org/delivery-and-takeout-options](https://www.stcalliance.org/delivery-and-takeout-options) \n\nGift Cards and Certificates -  [https://www.stcalliance.org/gift-cards-and-certificates](https://www.stcalliance.org/gift-cards-and-certificates) \n\nJob Listings -  [https://www.stcalliance.org/jobs-and-employment](https://www.stcalliance.org/jobs-and-employment)", "title": "Come support local in St. Charles!"}, {"created_utc": 1584718917, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/flx3rj/anybody_know_if_due_date_for_property_taxes_in/", "id": "flx3rj", "is_self": true, "score": 1, "selftext": "Anybody know if due date for property taxes in DuPage will be delayed? Considering what's going on, many of us may be short on cash. I heard that income taxes are being delayed by IRS, so maybe the state should start thinking about delaying property taxes.", "title": "Anybody know if due date for property taxes in DuPage will be delayed?"}, {"created_utc": 1584722345, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fly3h3/scenic_places_to_drive_in_northern_plainfield/", "id": "fly3h3", "is_self": true, "score": 1, "selftext": "We just moved to Plainfield (1M from Naperville border) and am thinking about just going for a drive to get out of the house. Is there anything scenic to look at from inside the car?", "title": "Scenic places to drive in Northern Plainfield"}, {"created_utc": 1584727000, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/flzgbh/shelter_in_place_coming_tomorrow/", "id": "flzgbh", "is_self": true, "score": 1, "selftext": "\nGov. Pritzker will soon be announcing a statewide shelter in place order for the state, to start tomorrow, according to the Trib:\n\n\nhttps://www.chicagotribune.com/coronavirus/ct-coronavirus-illinois-shelter-in-place-lockdown-order-20200320-teedakbfw5gvdgmnaxlel54hau-story.html#nt=oft-Double%20Chain~Flex%20Feature~top-news-curated-chain~lockdown-fri-1230p~~1~yes-art~curated~curatedpage", "title": "Shelter in place coming tomorrow"}, {"created_utc": 1584799935, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fmfjqw/home_depotsherwinace_closure/", "id": "fmfjqw", "is_self": true, "score": 1, "selftext": "I’m on track to buying a house in the next two weeks. My plan was to paint before I move in. Do I need to go get paint today or will these places still be open with limited hours. \n\nI don’t want to be someone breaking shut down for the sake of others but once places are open again my job will be swamped and I won’t have time to finish what I need before I move in. I had vacation time set up during this to finish the house and no way they are approving it post shutdown. \n\nTLDR: Pretty much do I go grab paint today or will these places be open with limited hours?", "title": "Home Depot/Sherwin/Ace closure?"}, {"created_utc": 1584803513, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fmgep3/keep_tinder_social_alive/", "id": "fmgep3", "is_self": true, "score": 1, "selftext": "Anyone bored and want to talk to me and my buddy. Lonely times fun guys. It'll help keep our sanity", "title": "Keep tinder social alive"}, {"created_utc": 1584808769, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fmhsc1/morton_arboretum_fee/", "id": "fmhsc1", "is_self": true, "score": 1, "selftext": "Wondering if it’s still full price to take the family to the arboretum for some much needed change of scenery.", "title": "Morton arboretum fee?"}, {"created_utc": 1584839784, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fmr5hy/anyone_else_seeing_weird_lights_in_the_sky_right/", "id": "fmr5hy", "is_self": true, "score": 1, "selftext": "In Lisle area. Not planes. We have a radar app and not showing on there. Go outside and report back.", "title": "Anyone else seeing weird lights in the sky right now (8:15 Saturday night)"}, {"created_utc": 1584840267, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fmr9z3/weird_lights_in_the_sky/", "id": "fmr9z3", "is_self": true, "score": 1, "selftext": "I'm in Lake Forest and I looked northwest and the is a moving line of lights in the sky, so high up they look like satellites. Any idea what this is?", "title": "Weird lights in the sky"}, {"created_utc": 1584843607, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fms3mh/free_wifi_parking_lots/", "id": "fms3mh", "is_self": true, "score": 1, "selftext": "Are there any places where i can do work on my laptop in my car but have access to wifi? I remember reading somewhere some libraries would have wifi in the parking lot but can’t find any info on it anymore.  I’m in grad school but we still have exams and assignments and i need a quiet place (nw suburbs)to do these things.  This past week i struggled getting work done because things are chaotic at home.  I posted this in the chicago subreddit cuz I’m desperate for any suggestions.", "title": "Free wifi parking lots?"}, {"created_utc": 1584863311, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fmw948/fuck_yall_lame_suburb_niggas_yall_aint_got_shit/", "id": "fmw948", "is_self": true, "score": 1, "selftext": "Tf do ya'll do in your boring ass sectioned off areas its boring as shit there and everything looks the same that shit so lame on god I hope all dem cookie cutter ass houses burn down and ya'll get some real houses I dead wish I had da money 2 buy u niggas some new houses that aint bummy cardboard cribs", "title": "Fuck ya'll lame suburb niggas ya'll ain't got shit on the city"}, {"created_utc": 1584874978, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fmy7wz/scottish_guy_where_can_i_grab_a_beer/", "id": "fmy7wz", "is_self": true, "score": 1, "selftext": "Scottish lad travelling to Chicago in August if this all blows over hopefully. Will be in town for a week. \nLooking for some ideas on where is good to go and meet some cool folk. \n\nScottish/Male/34 ✌️👍", "title": "Scottish Guy. Where can I grab a beer ?"}, {"created_utc": 1584883663, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fmzyk8/is_there_ever_a_good_time_to_go_to_the_store/", "id": "fmzyk8", "is_self": true, "score": 1, "selftext": "I don't need much, just milk and some baking things to make my mom's birthday just a little better in the middle of all this chaos. I usually go early, by 6 am but that's not a choice with the new senior hours.", "title": "Is there ever a good time to go to the store anymore?"}, {"created_utc": 1584884914, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fn08kt/closed_daycare_still_charging/", "id": "fn08kt", "is_self": true, "score": 1, "selftext": "Is anyone else experiencing this? Our daycare just sent a message that they're still going to charge normally during their shutdown, with an option for families struggling financially to pay 50%. I love our teachers but historically hate the owner of the place because she is always trying to extort parents. I emailed asking if I can support teachers directly instead of through the daycare itself. Anyone else dealing with this?", "title": "Closed daycare still charging"}, {"created_utc": 1584892866, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fn1vw7/chamber_of_commerce_online_resource_to_support/", "id": "fn1vw7", "is_self": true, "score": 1, "selftext": "[https://orlandparkchamber.org/?fbclid=IwAR3lxhddVoBiZlSn2JnobP8Q8gsYkRFJUv\\_7BGijM8jyWsy7o6s6sITuWp4](https://orlandparkchamber.org/?fbclid=IwAR3lxhddVoBiZlSn2JnobP8Q8gsYkRFJUv_7BGijM8jyWsy7o6s6sITuWp4)", "title": "Chamber of Commerce online resource to support local restaurants (Orland Area)"}, {"created_utc": 1584893397, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fn21c9/where_can_i_donate_books_for_the_military/", "id": "fn21c9", "is_self": true, "score": 1, "selftext": "I don't have the energy to try and sell all my books online, I have a ton of good novels that I'd like to see go to good use.  Where can I donate my books to a legitimate organization that will get books to the military?  Thanks in advance.", "title": "Where can I donate books for the military?"}, {"created_utc": 1584919686, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fn9l1r/shemale_trans_and_cd_clubs_in_the_suburbs/", "id": "fn9l1r", "is_self": true, "score": 1, "selftext": "Looking for a new club to frequent after this whole covid19 thing is done. Been a long time customer of Shannon spears out in melrose but looking for a new crowd. I haven’t been able to find another venue. Any help would be much appreciated!", "title": "Shemale, Trans, and CD clubs in the suburbs"}, {"created_utc": 1584938120, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fndzyb/suburb_choice_advice/", "id": "fndzyb", "is_self": true, "score": 1, "selftext": "Hoping to lean on the collective wisdom of this sub to help us overcome analysis paralysis.  I currently live in an apartment in the loop on the same block as my office, which is an unbeatable commute, but I want to own a house, and that's not going to happen in the loop.  So I'm looking outward to the suburbs and further-out neighborhoods of Chicago. (Obviously all the in-person parts of my search are going to be delayed by Coronavirus.)\n\nI've gotten the advice that a real-estate agent will have a lot of information for us, but also that you should choose your agent based on the town/neighborhood you're moving to, so I guess first we need to choose a suburb/neighborhood.  And for that, I'm hoping to get your ideas and advice.\n\nOur wants, in priority order:\n\n  1. Low crime / safe area.\n  2. Short commute to work (the loop).  The longer the commute, the more I prefer Metra to CTA.  Work is just a couple blocks from Ogilvie, so that's preferred, but Union is not much further.\n  3. Home price. I'm looking in the 250-350k range, reaching as high as 400k for the right place, so a neighborhood where that's realistic for a 2+ bed detached house.\n  4. We want somewhere there's enough space between houses that you don't feel like you're sharing a wall with your neighbor.  I've seen some neighborhoods with beautiful homes but &lt;10ft between the houses, and that's not what we're hoping for.\n  5. Demographics. We're both white and we just want to live somewhere the neighbors won't resent us as gentrifiers.  I've got no aversion at all to living in a diverse place, just don't want to move somewhere I will actually be or be percieved to be the reason folks who used to live there don't anymore.\n  6. We'd like a tall privacy fence around the backyard (dog people), so I guess I just don't want to go anywhere where the HOAs typically micromanage you to the point where you can't do that.\n\nOur current front runner-ish places are Des Plaines, Arlington Heights, and maybe Evanston?  But I'm hoping you all can tell us if we're overlooking a great option or missing some fact about those places?", "title": "Suburb Choice Advice"}, {"created_utc": 1584956861, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fnhba6/moving_from_northern_va/", "id": "fnhba6", "is_self": true, "score": 1, "selftext": "Hello!\n\nWe’ve lived in the DC region for the past 7/8 years and are moving to the Chicago area this summer. My husband grew up in Wilmette and that’s pretty much the only area of Chicago I know, besides Evanston and some touristic areas of the city. \n\nWe want to buy a house soon and are looking in the $650k range. Being in a good school district is important to us and we’d like to be somewhat close to the metra (my husbands office is near Ogilvee sp?). I’m a stay at home mom with a toddler and a newborn and would like to be in a walkable area with good parks and libraries, we’re moving to be closer to family and my in-laws live in the highland park/lake forest area.\n\nWe’re in our early 30s/late 20s and are basically starting from scratch in terms of friends/building a community, even though we have some family around.\n\nSo far we’ve been looking at houses in the Wilmette, Winnetka, Kenilworth, and Glencoe area because that’s kind of what we know (where my husband grew up) and the public schools are rated very high. We’ve found some houses in our range but it hasn’t worked out yet in terms of timing. \n\nI thought I’d ask here for any advice here if there’s any where else we should we looking? Any cute neighborhoods with good schools and young families you know of? Thoughts about suburbs I mentioned? Any information is greatly appreciated! \n\nAs a side note: I’m from south Florida originally and am a bit nervous about the winters already so send positive vibes my way!!", "title": "Moving from Northern VA"}, {"created_utc": 1584997064, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fnrsxx/hoping_to_support_small_restaurant_businesses/", "id": "fnrsxx", "is_self": true, "score": 1, "selftext": "With businesses struggling to stay open with the closed eating in, I’m opening to up my support by ordering pick up from these restaurants. (And maybe find new favorites.) Any recommendations? Palos/ Oak Lawn area would be great.", "title": "Hoping to support small restaurant businesses around me during this... recommendations for SW suburbs around Palos/ Oak Lawn?"}, {"created_utc": 1585003749, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fntroi/looking_for_some_clarity_nonessential_businesses/", "id": "fntroi", "is_self": true, "score": 1, "selftext": "Really simple:  what rights does an employee have if their non-essential business employer still requires them to physically come to work during this lockdown?  \n\nI know one option is to report it to local authorities but that may not be the best option for those who work in a small business environment.", "title": "Looking for some clarity - non-essential businesses and the lockdown"}, {"created_utc": 1585023416, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fnyq3y/report_from_the_aisles_northern_lake_county/", "id": "fnyq3y", "is_self": true, "score": 1, "selftext": "I went to 2 grocery stores today. Thought my experiences might help others who need to go tomorrow and are concerned about finding what they need, crowds, etc. I went about 4pm.\n\nFirst, Butera Market in Lindenhurst:  Pretty well stocked. Produce, deli and meat were fine. Only 2% milk and limited selections in orange juice. Nearly out of refrigerated biscuits (that one struck me as odd.) Fair amount of 24 packs of 500ml bottled water, Piggly Wiggly brand at 3 for $5.87. Not much if any bleach or TP.\n\nHard to tell if social distancing is enforced as there were so few customers in the store, roughly 1 per aisle. I didn't have to wait in line for checkout.\n\nSecond, Aldi in Antioch: Plenty of milk and eggs. Limit 6 milks and 4 eggs, same as it has been since the store opened. Produce was well stocked. Meat and deli products were slightly less plentiful than usual but nowhere near to running out. I saw some TP.\n\nLots of cleaning activity at the store - I watched wiping of checkout area, card reader and front door. From the employees' conversations it seemed like they were making cleaning a priority. There were a few less than usual customers in the store. They seemed to be making a reasonable effort at social distancing. Most customers at Aldi use full size carts so that limits density of checkout line by default. Employees seemed sensitive to need to not let lines build up by opening and closing registers as needed.\n\nGood luck if you need to go out tomorrow! I figure knowing which stores are well stocked may save somebody trips to multiple stores, plus relieve some anxiety.", "title": "Report from the Aisles: Northern Lake County"}, {"created_utc": 1585024619, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fnz0bt/respirators_in_public/", "id": "fnz0bt", "is_self": true, "score": 1, "selftext": "Curious to see if people are seeing people wearing masks or respirators in public yet? I haven't been out to the grocery store for awhile. Wondering what the mood is like out there.", "title": "Respirators in public?"}, {"created_utc": 1585072487, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fo9l9d/connies_pizza_westmont/", "id": "fo9l9d", "is_self": true, "score": 1, "selftext": "Is Connie's Pizza in Westmont gone forever or are they rebuildling?", "title": "Connie's Pizza Westmont"}, {"created_utc": 1585083157, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/focxtu/hate_to_make_a_post_like_this_but_does_anyone/", "id": "focxtu", "is_self": true, "score": 1, "selftext": "Starting to run a little low, just need one package", "title": "Hate to make a post like this, but does anyone know where to buy toilet paper in eastern lake county?"}, {"created_utc": 1585153823, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fota2b/stop_walkingjogging_in_groups/", "id": "fota2b", "is_self": true, "score": 1, "selftext": "What's wrong with y'all? You're supposed to be walking alone during this pandemic, and try to stay away from people 6ft. I have seen so many groups of older/old people walking in groups.", "title": "Stop walking/jogging in groups"}, {"created_utc": 1585191522, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fp3yz4/what_is_the_point_of_the_shelter_in_place_order/", "id": "fp3yz4", "is_self": true, "score": 1, "selftext": "This lockdown feels like such an ineffective half measure. It seems most people still must go to work despite the order. This won’t change much the virus will still spread at a high rate. It is especially troubling for those who have young ones or elderly parents at home as you risk exposing them everyday. I know it’s been said before but these virus has done an excellent job at exposing just how much these companies actually care for their workers. \n\nThose who can work from home count your blessings.", "title": "What is the point of the shelter in place order if most businesses are just going to claim themselves as “essential” anyway?"}, {"created_utc": 1585205577, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fp6x4c/encountered_something_new_today/", "id": "fp6x4c", "is_self": true, "score": 1, "selftext": "Everybody's heard a car stereo, right? Well, today I heard a horse stereo! While bike riding I passed a woman riding a horse with a boombox tied to the saddle. They were cantering &amp; jamming to some música norteña.", "title": "Encountered something new today"}, {"created_utc": 1585255933, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fpjf27/takeout_and_delivery_for_restaurants_in_st_charles/", "id": "fpjf27", "is_self": true, "score": 1, "selftext": "For anyone that wants to do delivery or takeout in the St. Charles area, be sure to check out this list of places that offer takeout and delivery! We have amazing restaurants and more here in St. Charles that provide delicious food that could really use your support. Check out the list here and support local today:\n\n [https://www.stcalliance.org/delivery-and-takeout-options](https://www.stcalliance.org/delivery-and-takeout-options)", "title": "Takeout and Delivery for restaurants in St. Charles"}, {"created_utc": 1585260506, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fpksk9/hospital_workers_whats_the_situation_like/", "id": "fpksk9", "is_self": true, "score": 1, "selftext": "Question for those of you who work in suburban hospitals.  My sister and sister-in-law work in hospitals in NYC and we've read the horror stories there.  Are you experiencing similar issues (shortage of equipment, PPE, beds, staff)?", "title": "Hospital workers - what's the situation like?"}, {"created_utc": 1585278808, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fppltq/have_you_gone_to_senior_hours_at_a_supermarket/", "id": "fppltq", "is_self": true, "score": 1, "selftext": "Wondering if it's more crowded than going later in the day.", "title": "Have you gone to \"Senior Hours\" at a supermarket?"}, {"created_utc": 1585281015, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fpq433/looking_for_a_place_with_sellsspecializes_in/", "id": "fpq433", "is_self": true, "score": 1, "selftext": "I want to stop buying EVOO laced with pomace oil from the supermarkets and invest in high-quality, healthy EVOO. I cook for myself so I would only buy small quantities at a time in order to use them within a few months.  \n\n\nI know we don't live in a region like California where olive groves surround us. But if there are any places you know of where the shopkeepers know their shit and won't give me a strange look when I ask for a \"peppery\" oil, that would be greatly appreciated. Bonus points if they let customers taste the oils before they drop $$ on them.", "title": "Looking for a place with sells/specializes in genuine extra virgin olive oil"}, {"created_utc": 1585328472, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fq0pvk/updated_chicago_unemployment_figures_released/", "id": "fq0pvk", "is_self": true, "score": 2, "selftext": "[Official unemployment figures for the Chicago economy](https://www.bls.gov/eag/eag.il_chicago_md.htm) were updated today. Numbers for January have been finalized and preliminary figures for February have now been made available.\n\n\n**January**\n\nThe unemployment rate increased to 3.6% in January. 61,600 positions were lost, and 36,000 workers left the labor force causing the unemployment rate increase. Nonfarm payrolls fell by 78,400. Labor categories with significant losses include Trade, Transportation, and Utilities falling by 22,800 positions and Professional and Business Services falling by 18,600 positions.\n\n\n**February** (preliminary)\n\nThe unemployment rate fell to 3.4% in February. 45,700 positions were added, with only 39,700 workers entering the labor force causing the unemployment rate decrease. The overall Nonfarm Payrolls figure did not change significantly. No individual sector saw significant employment changes.\n\n\n^*Chicago_Statistics ^is ^a ^public ^service ^account ^committed ^to ^making ^/r/ChicagoSuburbs ^a ^better ^informed ^community.", "title": "Updated Chicago Unemployment Figures | released March 27, 2020"}, {"created_utc": 1585361535, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fqba7g/morton_grove_pequods_yikes/", "id": "fqba7g", "is_self": true, "score": 1, "selftext": "First off, to the (under) staff working tonight: thank you for your hustle and willingness to feed people. I hope all your customers were thankful and calm. I (foolishly) ordered for pickup thinking it would be business as usual and then was hit with the reality we are living in. 16 car wait and the pizza was cold by the time I got home but it was worth it. I hope y’all figure out a better pickup solution for your customers. \n\nSide note, I pray that everyone driving up and working the restaurant is healthy. We were sharing pens, staff speaking into people’s cars, people walking up to the door with questions about their orders....I can’t imagine the stress the staff is currently under and as a customer I definitely felt the anxiety.", "title": "Morton Grove Pequods - Yikes"}, {"created_utc": 1585423713, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fqqpk2/anywhere_selling_flowers/", "id": "fqqpk2", "is_self": true, "score": 1, "selftext": "Does anyone know of anywhere, besides grocery stores, to buy flowers or potted plants? Would like to add some greenery inside my house. The grocery stores I've been to haven't had much of a selection, but I can't think of anything else that is open that sells them.", "title": "Anywhere selling flowers?"}, {"created_utc": 1585445430, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fqx6c5/social_distancing_fail/", "id": "fqx6c5", "is_self": true, "score": 1, "selftext": "I went out to pick up some pizza today, from one of the big national chains. Everywhere I've been to for the past two weeks has been pretty reasonable about social distancing, marking areas on the floor where customers can stand, enforcing the six-foot distance restrictions, except for this place. They have a lobby that's probably big enough to seat about 40 people, yet currently they have the front door gated off with tables making like a 4x6 cage. That would be fine, if they weren't allowing more than one person in at a time, but when I got there I counted at least ten people crammed into this small space waiting for their food. I confronted the manager about this but she basically told me to fuck off and that the health department had already signed off on it, but I'm thinking that's bullshit. Who would I even go to about something like this? There's no way that this is within the guidelines we're under right now.", "title": "Social distancing fail"}, {"created_utc": 1585461942, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fr12z8/help_us_find_a_halfway_point/", "id": "fr12z8", "is_self": true, "score": 1, "selftext": "My partner and I are looking for a place that’s commutable for both of us. One of us works in Pilsen and the other in western Lake County. \n\nWe’re hoping for something that’s an hour or less for each of us. Kid- and dog-friendly also necessary. Bonus points for proximity to good nature, walking, interesting architecture, affordability. We love the vibe of places like Evanston and Elgin. Where would you recommend we look?", "title": "Help us find a halfway point!"}, {"created_utc": 1585488311, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fr5ujb/gardening_guides_for_the_area/", "id": "fr5ujb", "is_self": true, "score": 1, "selftext": "Looking at starting gardening veggies any tips or resources you can share?", "title": "Gardening guides for the area?"}, {"created_utc": 1585519796, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/freeer/rise_in_mundelein/", "id": "freeer", "is_self": true, "score": 2, "selftext": "Any one know how they are handling orders? They can't possibly still have people packed in there like a few weeks ago.  Do you order ahead of time?  Thanks", "title": "Rise in Mundelein"}, {"created_utc": 1585525798, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/frg32v/kane_county_ppe_donations/", "id": "frg32v", "is_self": true, "score": 1, "selftext": "Kane County is accepting donations of Personal Protective Equipment (PPE) to assist in the COVID-19 response. Businesses, medical and nursing schools, nail salons, tattoo parlors and residents can donate unused and unopened Personal Protective Equipment in the parking lot of the Kane County Judicial Center located at 37W777 IL-38, St. Charles, IL 60175. The drop off site will be open on Mondays, Wednesdays and Fridays starting Monday March 30, 2020 through Friday April 17, 2020 from noon until 7:00pm. The drop off site will be staffed by personnel from the Kane County Office of Emergency Management.\n\nIf you have a large amount of items to donate such as a pickup trucks worth or larger, please e-mail us at kanecountyeoc@countyofkane.org Include the quantities of each item you have on hand to donate and your contact information and we will contact you to arrange a drop off date, time, and location.\n\nItems needed include:\n\n• Masks: Surgical, isolation or N-95  \n• Gowns: Isolation and non-surgical  \n• Gloves: Nitrile, sterile, and surgical  \n• Face shields, Goggles, and safety glasses  \n• Hand Sanitizer (any size)  \n• Disinfectant Wipes (any size)\n\nAll items should be in the manufacturer's original packaging and unopened. Unfortunately, we cannot accept open product or homemade items.\n\nAll donations will be distributed to health care and medical facilities, social services and first responders within Kane County.", "title": "Kane County PPE Donations"}, {"created_utc": 1585540260, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/frjq43/lysol_spray/", "id": "frjq43", "is_self": true, "score": 1, "selftext": "Has anyone seen Lysol spray since this whole thing started? I can’t find it anywhere", "title": "Lysol spray"}, {"created_utc": 1585589002, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/frv013/question_about_my_unemployment_insurance/", "id": "frv013", "is_self": true, "score": 1, "selftext": "Hi everyone, about a week ago I activated the IDES debit card that I received after filing for unemployment insurance. I'm a substitute teacher who hasn't been able to work. I'm wondering if anyone knows when my weekly pay will be added to the debit card? \n\nI received a letter in the mail today about filling out an \"academic institution questionnaire\". It was slow to arrive at my residence and arrived today. It says that I had to fill it out and send it back by 3/29. Oh well. I'm wondering if that might affect when or if I'll get paid? The letter says \"If this questionnaire is not signed and returned by 3/29/20 a determination regarding your eligibility for Unemployment Insurance Benefits will be made based on the available information\". \n\nI'm just generally confused about if and when I'll get paid the weekly benefit amount. I've looked at FAQs on the IL revenue site as well as other Key2Benefit FAQs, but they don't say much.", "title": "Question about my Unemployment Insurance Key2Benefits debit card"}, {"created_utc": 1585755421, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ft212p/moving_during_covid19/", "id": "ft212p", "is_self": true, "score": 1, "selftext": "Hey! I’ve recently taken a job offer in the Atlanta area, and I’m scheduled to move into an apartment come Friday. My new job is having me work remote, but I do want to be in the Atlanta area for when everything starts. \n\nDoes anyone have anyone have experience moving during this time? Will I be in trouble driving there with the law?", "title": "Moving During COVID-19"}, {"created_utc": 1585758131, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ft2wb3/unemployment/", "id": "ft2wb3", "is_self": true, "score": 1, "selftext": "Hi, I have a question. I got laid off in December. Do I qualify for unemployment??", "title": "Unemployment"}, {"created_utc": 1585779422, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ft9yc7/any_good_fence_companies_that_can_service_around/", "id": "ft9yc7", "is_self": true, "score": 1, "selftext": "Looking for a legit fencing (wood) company for a standard size lot in the Oak Park area- any suggestions would be much appreciated!", "title": "Any good fence companies that can service around Oak Park?"}, {"created_utc": 1585832331, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ftlvzx/does_anyone_know_any_elderly_who_cannot_shop_for/", "id": "ftlvzx", "is_self": true, "score": 1, "selftext": "I work at jewel mon to Friday and would be willing to pick up a few things and drop them off for no charge (just the cost of the groceries) if someone knows someone who is having a very rough time. Please contact me and let me know id rather not have more people exposed than need be. I can leave groceries on your doorstep or in cooler if you want to place that on doorstep. We can do PayPal or maybe quick pay. As id rather not be handling cash. \n\nHave a great day you guys.", "title": "Does anyone know any Elderly who cannot shop for themselves ?"}, {"created_utc": 1585834818, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ftmi8f/cobra_too_expensive/", "id": "ftmi8f", "is_self": true, "score": 1, "selftext": "Hi folks. My husband lost his job. We're trying to think of health insurance alternatives to COBRA, which is much too expensive. I just learned that Americans won't get a special enrollment period for ACA this year, so we have to get to 2021. These days, that seems like an eternity. And I'm terrified of going without insurance, especially this year.\n\nDoes anyone have personal experience with an insurance broker that they would recommend (or not?). Thanks for your help!", "title": "COBRA = too expensive"}, {"created_utc": 1585849360, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ftqs2u/any_comcast_users_outage_in_bloomingdale/", "id": "ftqs2u", "is_self": true, "score": 1, "selftext": "Been down since 7:42am.  Anyone else having an issue?", "title": "Any Comcast users? Outage in Bloomingdale"}, {"created_utc": 1585850736, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ftr7ip/has_reporting_companies_for_shelter_in_place/", "id": "ftr7ip", "is_self": true, "score": 1, "selftext": "So, that question and if the following situation is even covered. I'm not even sure if this would get covered by it, tbh.\n\nTwo of my friends still work at our old crappy insurance office. It's wholesale insurance aka they're basically the middleman in the commercial insurance market. Their boss/president of the company is requiring 2 employees be physically present in the office every single work day, basically in shifts. Why yes, they can do their entire job from home. Is this violating the executive order? Would reporting it do any good? (Has it done any good???)\n\nI'm just trying to see if there's anything I can do to help them out. It's such bullshit they still have to go in.\n\nThe company itself is just a subsidiary of a really big name in insurance.", "title": "Has reporting companies for Shelter In Place violations actually done anything?"}, {"created_utc": 1585863916, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ftv9hf/looking_for_00_flour/", "id": "ftv9hf", "is_self": true, "score": 1, "selftext": "Anyone know somewhere in the northern burbs that sells 00 flour. I haven’t found it at the Deerfield Whole Foods or Woodmans.", "title": "Looking for 00 flour"}, {"created_utc": 1585868128, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/ftwhr9/semi_truck_parking/", "id": "ftwhr9", "is_self": true, "score": 1, "selftext": "Looking for a place to park my semi mostly on the weekends. Crystal Lake, Cary, Fox River Grove area. Any help would be much appreciated.", "title": "Semi truck parking."}, {"created_utc": 1585937594, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fuddqp/professional_cleaner/", "id": "fuddqp", "is_self": true, "score": 5, "selftext": "Im a profesional cleaning i dont have alot of work so im looking for work so im offer window cleaning gutter cleaning i can also help you clean your house and i can help you with ANYTHING you like ;-) i offer some cleaning and window cleaning inside naked", "title": "Professional cleaner"}, {"created_utc": 1585941178, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fuegzo/any_good_roofers_in_northwest_suburbs/", "id": "fuegzo", "is_self": true, "score": 0, "selftext": "Had some damage from the storm last weekend and was hoping to get a contractor soon.", "title": "Any good roofers in northwest suburbs?"}, {"created_utc": 1585966852, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fulmth/why_are_the_cook_county_forest_preserves_still/", "id": "fulmth", "is_self": true, "score": 1, "selftext": "People have been seen congregating in the forest preserves of Cook County-Unacceptable!! They were seen at all the preserves along Willow Springs Road between La Grange and Orland Park....this needs to stop!!", "title": "Why are the Cook County Forest Preserves still open?!'"}, {"created_utc": 1586015407, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fuvx7s/anyone_got_a_good_backyard_mechanic_in_the_west/", "id": "fuvx7s", "is_self": true, "score": 1, "selftext": "My timing belt on my 2003 Toyota Avalon is due. For the price dealers charge I would try it myself but if I could get a good enough price on it I would rather not do it. Thanks!", "title": "Anyone got a good backyard mechanic in the West burbs near Bolingbrook?"}, {"created_utc": 1586025551, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fuyutx/can_you_sew_butera_market_looking_for_masks_for/", "id": "fuyutx", "is_self": true, "score": 5, "selftext": "Butera Market needs your help. We have been trying to purchase masks for our grocery store employees and are coming up empty handed as hospitals are the priority. If you know how to make fabric masks we would appreciate your assistance. Any kind of mask you can make can be donated at one of our many locations. If you don’t live near a Butera Market, please consider donating to your local grocery store as they undoubtedly need your assistance as well.   \n\n\n[Butera Market Locations](https://buteramarket.com/locations-2/)", "title": "Can you sew? Butera Market looking for masks for the grocery store employees"}, {"created_utc": 1586040807, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fv33c4/coronavirus_testing_in_southwest_suburbs/", "id": "fv33c4", "is_self": true, "score": 1, "selftext": "Hi all. \nI’m from the southwest suburbs and I’m worried about myself / friends or family in the same region having corona. I, personally, don’t have a primary care doctor (and haven’t since I had a pediatrician- blah blah, cost of health insurance, uninsured because of part time work, etc...) and I’m not sure where testing could be done for someone like me, for example? \nI’m worried about places that’ll have high turndowns because someone didn’t travel or whatever stupid ass barriers are in place to test people. \nAre there any clinics set aside for testing that aren’t hospitals (like Christ or LCM) or primary care centers? Maybe urgent care or outpatient?\nJust curious if anyone has heard anything. Thanks!", "title": "Coronavirus testing in Southwest Suburbs?"}, {"created_utc": 1586053373, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fv673g/very_important_where_do_they_have_good_crab/", "id": "fv673g", "is_self": true, "score": 1, "selftext": "I NEED TO KNOW!!!", "title": "Very important: where do they have good crab rangoons in the NW burbs?"}, {"created_utc": 1586106466, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fvh6vh/best_neighborhoods_to_move_in/", "id": "fvh6vh", "is_self": true, "score": 0, "selftext": "So currently my family lives in Berwyn, but our landlord is selling the multi-family home we are currently living in so we are planning to move somewhere else, possibly in Berwyn, but most likely outside the city. My mom is eyeing a townhouse in Summit, but here is the thing:\n\n**I hate Summit.**\n\nI don't know why, I just get a weird feeling whenever we go to the village, it doesn't roll with me the right way. Maybe it's the crime statistics, the village has some above average crime rates.\n\nMaybe it's cause the schools there aren't too great, receiving 5/10 on GreatSchools, where as the schools we go to now are much higher in rating, with Emerson Elementary topping with a 9/10 and Morton West being rated as a top AP school in the US, though Argo Community High School does look pretty good too.\n\nMaybe it's because mom doesn't really consider my opinion or my brother because she is the one who is going to buy the house along with her husband, as many of our friends still live in Berwyn and the surrounding areas, and the camps that we would go to during the summer require us to go the schools districts that certain areas are apart of.\n\nMaybe it's because of the legal problems, because my mother is divorced with dad and they have dual custody, and moving somewhere far from Berwyn would affect our current schedule as we would need to drive much longer to reach Berwyn.\n\nI don't know if asking strangers is the right thing for forming an idea, but what do you think is a great suburb for a middle class family to move into, consider the things I have mentioned.\n\n(Sorry if this sounds too spoiled or something)", "title": "Best neighborhoods to move in???"}, {"created_utc": 1586121315, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fvljv0/hi_all_im_running_a_survey_asking_americans_how/", "id": "fvljv0", "is_self": true, "score": 2, "selftext": "Here's the survey link: [https://forms.gle/RkBqCZdxtmT3asF36](https://forms.gle/RkBqCZdxtmT3asF36)\n\nThanks for participating!", "title": "Hi all! I'm running a survey asking Americans how socially connected they are online across all of their social media channels that they're active on while spending more time at home, and I could use a few more responses from Illinois. Would love your input!"}, {"created_utc": 1586181957, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fvzbzr/why_arent_people_wearing_masks/", "id": "fvzbzr", "is_self": true, "score": 1, "selftext": "I'm I'm the NW suburbs. We have many confirmed cases of COVID-19 in my county. My family took a walk yesterday with our cloth masks on, and the neighbors where staring and pointing like we are crazy! No one else was wearing a mask. Why is this happening? Masks save lives. Is it a stigma? Are people in denial about the seriousness of this pandemic? Are you noticing the same thing in your suburb?", "title": "Why aren't people wearing masks?"}, {"created_utc": 1586183303, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fvzp3a/what_what_is_the_best_alternative_for_ordering/", "id": "fvzp3a", "is_self": true, "score": 1, "selftext": "I'm familiar with Instacart but I don't know if it is the best alternative? Jewel? Mariano's?", "title": "What what is the best alternative for ordering groceries online with or without delivery in the area?"}, {"created_utc": 1586184173, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fvzxel/centennial_beach/", "id": "fvzxel", "is_self": true, "score": 1, "selftext": "What’s the likelihood of it being open- along with other public pools- this summer?", "title": "Centennial Beach?"}, {"created_utc": 1586201187, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fw55wv/non_essential_items_from_amazon/", "id": "fw55wv", "is_self": true, "score": 1, "selftext": "I'm considering ordering some computer hardware from Amazon. Any experiences around here with delivery being delayed? Supposedly \"nonessential\" items are lower priority but the Prime delivery dates still show as 2 or 3 days. If it matters, our stuff comes from the Mundelein delivery hub.", "title": "\"Non essential\" items from Amazon?"}, {"created_utc": 1586203639, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fw5y80/churches_lile_lighthouse_church_of_nations_in/", "id": "fw5y80", "is_self": true, "score": 1, "selftext": "Here is a \\[youtube stream of their \"cyber revival\"\\]([https://www.youtube.com/watch?v=LB3rBU-6jT4](https://www.youtube.com/watch?v=LB3rBU-6jT4)) that they live streamed just 4 days ago. There is 15 people including the band on stage not to mention all of the technical staff producing the video/audio/lighting. These kids dont know any better and their pastor is putting their lives, their families lives, and the Alsip communities lives at risk.\n\nMicrophones are COVERED in spit and they are passing them around to everyone.", "title": "Churches lile Lighthouse Church of Nations in Alsip are violating the laws and endangering lives."}, {"created_utc": 1586232554, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fwdr7c/i_was_wondering_if_someone_could_refer_me_to_a/", "id": "fwdr7c", "is_self": true, "score": 1, "selftext": "Hey, I’m not sure if this is allowed but I’m going to give it a shot.\n\nI’m just drained from all the rejection emails and no call backs after interviews. I know with covid happening it makes it harder but I’m desperate to be out there making money. \n\nI really want to work. If someone could refer me to a good job, I’d be forever thankful. \nMy preferred work locations would be St. Charles, or Schaumburg, or anywhere in between. \nI was hoping to get into an office environment like Paylocity, Chase, Thermo fisher, or something similar as a customer service support. But honestly any work that will give me a live-able wage, I’m open too.\n\nI have a lot of experience as face to face customer service so I’m open to that too. Any help, suggestions, or advice is appreciated. \nMy inbox is open too.", "title": "I was wondering if someone could refer me to a job in the local area?"}, {"created_utc": 1586314887, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fwyimr/opened_windows_today_regrets/", "id": "fwyimr", "is_self": true, "score": 1, "selftext": "We now have the air on to cut the humidity we let in today before the rain.\n\nFriday was nice. :/", "title": "Opened windows today - regrets"}, {"created_utc": 1586359189, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fx8aza/anywhere_or_any_groups_to_practice_spanish_with/", "id": "fx8aza", "is_self": true, "score": 1, "selftext": "So this is my last resort...I've searched high and low for someplace to casually practice Spanish in my area (Aurora/Naperville) and have surprisingly come up with nothing.\n\nA little context: I graduated high school a couple years ago having taken Spanish each year. I scored surprisingly high in reading, writing, and comprehension. My weak spot was always speaking. I also received a Seal of Biliteracy, basically meaning that I was intermediate in Spanish. Then I moved away for college to an area that has no Spanish speakers and no opportunities to practice it. I tried to keep up with practicing on my own but over time I started to lose motivation. I haven't completely forgotten the language at this point but I don't think I could still hold a conversation.\n\nI really, really don't want to forget the language. But I fear that the more time I don't practice it, the higher the chance will be that I forget it. And so I'd really like to find an environment that isn't judgmental and is meant to practice at the level that you're at. I'm not looking for a class, per se. If anyone knows of anything like this, please let me know. I'm willing to drive further than Aurora/Naperville if it means I can actually practice it!", "title": "Anywhere or any groups to practice Spanish with?"}, {"created_utc": 1586400587, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fxkfhl/when_do_you_think_the_secretary_of_state/", "id": "fxkfhl", "is_self": true, "score": 3, "selftext": "My plate sticker expired in Match. Wondering if we will get another extension on renewals.", "title": "When do you think the Secretary of State locations will open again?"}, {"created_utc": 1586452605, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fxwerh/who_has_the_best_pretzel_buns_literally_all_of/", "id": "fxwerh", "is_self": true, "score": 4, "selftext": "I'm also including an [image for reference](https://fastly.4sqi.net/img/general/width960/6330138_Ww-pX8c_KvXxa_wsoMIs6vRsnJwb0zJ2F0DGbB-ncsA.jpg), because I'm not exactly sure how to describe the specific ones I'm talking about, other than *\"They (incl.hamburger/sandwich, brat/sub, and regular soft pretzels) are typically in a basket, in the bakery; also, they don't seem to put nearly as much salt on them as they used to.\"* (It's been a while since I've been there - so, for all I know, they don't even carry them anymore - and I don't know the name of the brand/if there's a brand),\n\nBecause, every time I happen to walk into a new store, I'll check out the fresh pretzel buns from their bakery, and the results are always the same: they taste like \"regular\" bread (e.g. Jewel/Osco's pretzel buns remind me of those huge, individual poppy seed kaiser rolls from the bakery, that my mom would give me to eat while I rode in the shopping cart, because I'd be unable to talk (scream) the entire trip).", "title": "Who has the best pretzel buns? Literally ALL of them taste the same (bland/mediocre), except for ONE from Mariano's (only one that actually tastes like a pretzel)...Btw, does anyone know WHY Mariano's stands out (e.g. made from scratch, different brand, cooking method)?"}, {"created_utc": 1586472858, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fy2jsv/suburbs_near_ohare_with_least_plane_noise/", "id": "fy2jsv", "is_self": true, "score": 1, "selftext": "One of my friends recently got hired as a customs officer at ohare airport, he’s going to be relocating but doesn’t want to live somewhere where there’s constant jet noise, I know that’s been a major issue for a lot of people.  Anyone have any recommendations?", "title": "Suburbs near ohare with least plane noise?"}, {"created_utc": 1586476566, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fy3krr/smokemypoleprotonmailcom/", "id": "fy3krr", "is_self": true, "score": 1, "selftext": "Looking for new friends that can appreciate a tall forty-something expat.  \nTall, blue-eyes, UK/ Australian-like accent. Bonus if you can figure it out.", "title": "Smokemypole@protonmail.com"}, {"created_utc": 1586476654, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fy3lpf/looking_for_italian_sausage_in_the_western_burbs/", "id": "fy3lpf", "is_self": true, "score": 1, "selftext": "I have been looking for some great Italian sausage for a long time. Not the take out kind but the kind that I can cook. Preferably with fennel seed. I don't really love any of the major brand names and the grocery chains that advertise \"homemade\" sausage I think all actually get it from the same supplier. That sausage is bland and generic tasting. I think I need to look at independent grocery stores or butcher shops.  Suggestions anyone?", "title": "Looking for Italian sausage in the western burbs"}, {"created_utc": 1586536029, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fyj2ow/someone_posted_last_week_about_an_available_air/", "id": "fyj2ow", "is_self": true, "score": 1, "selftext": "Whomever posted that, is it still available?", "title": "Someone posted last week about an available Air B&amp;B if anyone is in an unsafe domestic situation. One of my neighbors has a 4-year old and they are waiting to be able to move away."}, {"created_utc": 1586547810, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fyn4on/best_suburbs_for_commuting_into_the_loop/", "id": "fyn4on", "is_self": true, "score": 1, "selftext": " \n\nI was looking into moving to an area with good schools and easy commute into the center of the loop.\n\nI was looking at some areas like Evanston and Lombard but google maps shows that the commute by public transit is 50-65 minutes depending on the date and time. That seems kind of long, is that considered normal for most these areas? Ive heard of so called express trains (that operate at only very specific times) that cut it down to 30 min but not sure where to find more info about them.\n\nIf the express trains do exist, do they run late (7-8pm) for people who work late? Are there any other neighborhoods I should look into?", "title": "Best Suburbs for Commuting into the Loop?"}, {"created_utc": 1586562779, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fys0oq/illinois_covid19_text_alerts/", "id": "fys0oq", "is_self": true, "score": 1, "selftext": "Officials Announce New Number for COVID-19 Text in Illinois\nBeginning Friday, the Health Equity launched COVID-19 text messaging for Illinois. Residents can opt in for text messages by texting COVID (312) 500-3836. For Spanish, text COVIDESP to the same number.", "title": "Illinois COVID-19 Text alerts"}, {"created_utc": 1586562783, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fys0qe/illinois_covid19_text_alerts/", "id": "fys0qe", "is_self": true, "score": 1, "selftext": "Officials Announce New Number for COVID-19 Text in Illinois\nBeginning Friday, the Health Equity launched COVID-19 text messaging for Illinois. Residents can opt in for text messages by texting COVID (312) 500-3836. For Spanish, text COVIDESP to the same number.", "title": "Illinois COVID-19 Text alerts"}, {"created_utc": 1586562788, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fys0sw/illinois_covid19_text_alerts/", "id": "fys0sw", "is_self": true, "score": 1, "selftext": "Officials Announce New Number for COVID-19 Text in Illinois\nBeginning Friday, the Health Equity launched COVID-19 text messaging for Illinois. Residents can opt in for text messages by texting COVID (312) 500-3836. For Spanish, text COVIDESP to the same number.", "title": "Illinois COVID-19 Text alerts"}, {"created_utc": 1586562916, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fys27s/illinois_covid19_text_alerts/", "id": "fys27s", "is_self": true, "score": 1, "selftext": "Officials Announce New Number for COVID-19 Text in Illinois\nBeginning Friday, the Health Equity launched COVID-19 text messaging for Illinois. Residents can opt in for text messages by texting COVID (312) 500-3836. For Spanish, text COVIDESP to the same number. ", "title": "Illinois COVID-19 Text alerts"}, {"created_utc": 1586613771, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fz5vpi/elevators/", "id": "fz5vpi", "is_self": true, "score": 1, "selftext": "So this might be an odd question but what do you guys think about elevators? I live in an big apartment building and I’ve been nervous about elevators during this covid pandemic since it’s such a confined space and no real air circulation. Do you think it would be possible to unknowingly contract covid in an elevator?", "title": "Elevators"}, {"created_utc": 1586617060, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fz6wyh/short_term_leases_in_northernwestern_chicago/", "id": "fz6wyh", "is_self": true, "score": 1, "selftext": "Hello! We were planning on buying a house this summer in the northern suburbs. But due to the covid-19 situation- the market has dried up significantly. \n\nDoes anyone have any leads on short term or month to month rental houses in any of the northern or possibly western suburbs? Any recommendations on where I could start looking to find one?\n\nThank you!", "title": "Short term leases in northern/western chicago suburbs"}, {"created_utc": 1586626894, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fzb3ti/best_place_in_the_nw_suburbs_to_dispose_of_an_old/", "id": "fzb3ti", "is_self": true, "score": 4, "selftext": "The hazardous waste disposal site in Naperville is closed until further notice - where else can I go to dispose of an old propane tank?", "title": "Best place in the NW suburbs to dispose of an old propane tank?"}, {"created_utc": 1586631892, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fzeozi/places_that_take_old_gas/", "id": "fzeozi", "is_self": true, "score": 4, "selftext": "I got about a gallon of old gas to get rid of...anyone know of places near schaumburg that take old gas?", "title": "Places that take old gas?"}, {"created_utc": 1586663177, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fzpg4y/can_i_get_a_foid_card_still/", "id": "fzpg4y", "is_self": true, "score": 0, "selftext": "With all this coronavirus bullshit going on right now and everything closed, is it still possible for me to apply for a foid card? \n\n\nAnd how about purchase ammunition?", "title": "Can I get a foid card still?"}, {"created_utc": 1586698482, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fzwuw4/cubbies_bart_simpson_mashup/", "id": "fzwuw4", "is_self": true, "score": 0, "selftext": " The Boys of Summer had to take a little break for the safety of our planet. What will my Dad do with his free time? Netflix, here we come! #chicago #chicagocubs #thecubs #cubbies #chitown #bartsimpson #baseball #doh \n\n&amp;#x200B;\n\nhttps://preview.redd.it/ddb7jj6p3es41.jpg?width=729&amp;format=pjpg&amp;auto=webp&amp;s=3d91941b315181bde4fecfc4cbffb634490d03b1", "title": "Cubbies Bart Simpson Mashup"}, {"created_utc": 1586708169, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/fzzj3j/artist_communities/", "id": "fzzj3j", "is_self": true, "score": 0, "selftext": " \n\nWhich areas around Chicago are the most artist friendly , affordable (I know, subjective) ,with a higher number of artist residents and  a bohemian vibe?", "title": "Artist Communities"}, {"created_utc": 1586731241, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g06fzy/looking_for_roommates_subleasing_rooms_at_4_bed_2/", "id": "g06fzy", "is_self": true, "score": 0, "selftext": "Photos [here.](https://imgur.com/a/F8NZjOK)\n\nLooking for Roommates for the Summer to sublease rooms! 4 bed 2 bath. 3 rooms available. 2 rooms each $600. 1 room $700. Utilities included. Price negotiable. Can move in May 1st.\n\nSafe and quiet neighborhood in Skokie, IL. 18 to 20 min. from the train on foot. 5 min. drive to CTA train, Old Orchard Mall and Jewels. Rooms are furnished. Spacious kitchen and living room. Covered parking with backyard. Laundry and Dryer in-house.\n\nDM me if interested!", "title": "Looking for Roommates! Subleasing rooms at 4 bed 2 bath house in Skokie."}, {"created_utc": 1586825371, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g0vjve/lombard_downers_grove_roommate_wanted_2bd2bth/", "id": "g0vjve", "is_self": true, "score": 48, "selftext": "LGBT inclusive\n\nHey, I'm a young (nb afab) professional looking for a roommate to share rent costs and move into an apartment together. I'm looking for places in the Downer's Grove/Lombard area, and I currently have my eye on a place that costs max 800 each, utilities included. We'd each have our own room and bath. Living, dining and the kitchen would be shared spaces.\n\nThe apartment I'm looking at currently has a rent special where the first month's rent is discounted and administrative fees waived. I am however looking at other apartments also and would like to consult with my roommate before choosing a place, if it suits them.\n\nI'm looking for a responsible, kind individual to be my roommate. No drama. I have a support animal (large dog, a sweetheart goldendoodle) so you must be okay with living with one. If you have a pet that's cool too, if not no worries, but my dog is a big support for me and therefore is non-negotiable. I've had roommates in the past who weren't so great to him and I'd like to not repeat that. He's trained and gets along with just about everyone. He'll also be starting therapy dog training in the next couple months if that gives you an idea of his temperament.\n\nI keep to myself mostly but don't mind socializing. I'm friendly and responsible. Looking to find someone ASAP so send me a message when you can if you're good with everything above.\n\nEdit: included necessary details", "title": "Lombard / Downer's Grove Roommate wanted 2bd/2bth"}, {"created_utc": 1586828639, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g0wfdz/meijers_shop_and_scan/", "id": "g0wfdz", "is_self": true, "score": 5, "selftext": "Has anyone tried Shop and Scan? I haven't shopped for a month. I'd like to run into Meijer for produce and dairy products. The faster I'm out, the better. If the Shop and Scan works smoothly I think it'll save a few minutes. Thoughts?", "title": "Meijer's Shop and Scan"}, {"created_utc": 1586831804, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g0x8bf/anyone_selling_adderall_nearby/", "id": "g0x8bf", "is_self": true, "score": 0, "selftext": "Just asking", "title": "Anyone selling adderall nearby"}, {"created_utc": 1586911150, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g1hlez/curbside_pickup/", "id": "g1hlez", "is_self": true, "score": 1, "selftext": "Hi! Wondering if anyone knows where I can get a curbside pickup for alcohol (beer, wine, etc) in the dupage county area?", "title": "Curbside pickup"}, {"created_utc": 1586955589, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g1rfrd/new_here_and_i_dont_know_what_to_do_help/", "id": "g1rfrd", "is_self": true, "score": 23, "selftext": "Hi. I'm from the Philippines and I've just moved here with my family and are currently living with my aunt. Finished 4 years of civil engineering there, and thought we could continue schooling here. Didnt realize that school was expensive as hell. So my question is if you guys know the best school to go to moving forward, any scholarships or financial aid i should take, or even if i should focus on college rn or to just get a job. Need help fast. All comments appreciated.", "title": "New here and I don't know what to do. Help?"}, {"created_utc": 1586966166, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g1unsv/red_light_violation/", "id": "g1unsv", "is_self": true, "score": 0, "selftext": "Hey guys I got a red light ticket in my mail last month , although I  contested it, I got another mail of  a Notice of Determination of Liability. Now I do not want to pay the ticket because after reviewing the video,  I can tell for a fact that they are trying to get money out of me. What are the repercussions if I refuse to the this automated red light ticket?? Btw its  from Melrose Park", "title": "Red light violation"}, {"created_utc": 1586970039, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g1vxes/600_weekly_unemployment_money/", "id": "g1vxes", "is_self": true, "score": 0, "selftext": "Hello,\n\nDoes anyone know what day the $600 in extra unemployment became effective? I didn't get it for the week of 3/22-3/28.", "title": "$600 weekly unemployment money"}, {"created_utc": 1586985798, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g212om/best_uses_for_stimulus_to_help_local_businesses/", "id": "g212om", "is_self": true, "score": 1, "selftext": "Are there specific ways you plan to spend your money to help local businesses and citizens stay afloat?  Charities worthy of the funds?\n\nMy family isn't hurting (at least right now) so we want to put the money to work and make the biggest impact.", "title": "Best Uses for Stimulus to Help Local Businesses?"}, {"created_utc": 1586991622, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g22vms/compared_to_nonpandemic_times_do_you_see/", "id": "g22vms", "is_self": true, "score": 0, "selftext": "People who are currently locked down in the suburbs: Compared to non-pandemic times, do you see more/fewer people outside? On the sidewalks? In the parks? \n\nAnd what town are you in?\n\n(I'm wondering if people in other suburbs are having the same experience as I am.)", "title": "Compared to non-pandemic times, do you see more/fewer people outside?"}, {"created_utc": 1587053471, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g2hvd0/evanston_neighborhood_forced_to_smell_factory/", "id": "g2hvd0", "is_self": true, "score": 0, "selftext": "The TapeCoat factory, in Evanston IL, produces asphalt tape, using coal tar pitch applied to a cotton backing, and has been operating in our neighborhood for over a decade. Coal tar pitch has been linked to various cancers and other serious health conditions. In the midst of the COVID-19 pandemic, when residents of Illinois have been ordered to shelter in place, TapeCoat continues to unapologetically subject residents to their emissions.\n\nWe are subjected to the noxious smell of burning tar, rubber, and asphalt at all times of the day. Depending on how the wind blows, the smell is extremely intense to the point residents have to cover their noses and mouths to leave their homes. Residents are waking up with headaches on a daily basis and, at times, a mysterious metallic bad taste in their mouth. Neighbors have experienced mysterious illnesses, such as lung cancer, lesions, and respiratory issues. We are concerned to let our kids play in the backyard or the neighborhood park, kitty-corner from Tapecoat. The common denominator of these concerns is TapeCoat, owned by Chase Corp (NYSE: CCF) which is headquartered in Westwood, MA.\n\nWhile the effects of this process have been a concern for years, we have decided to shine a light on the potential impact of their emissions, in hopes of finally coming to a resolution. The main concern is the emission of asphalt fumes from the coating process. The residents want an answer to when this will end. Delaying this process on Tapecoat’s end is only prolonging the suffering of the residents.\n\nWe are a diverse community - homes filled with families who have spent generations in Evanston, those who have recently moved here with young kids, and every point in between. We are a welcoming community that thrives on being good neighbors, and since our neighborhood is suffering from the actions of your company, we are organizing together. As a neighborhood, we will:\n\n* organize the entire Evanston community to attend City Councils meetings to address their concerns until this is resolved,\n* continue to collect data from neighbors on the time, dates and intensity of offensive, and potentially harmful, odors in the air,\n* expand the scope of our data collection to include any health impacts that may have been caused by these emissions,\n* continue to work with the City of Evanston (IL), the Illinois Environmental Protection Agency, and the Illinois Attorney General’s office to supply this data for their review, and recommend enforcement of IEPA’s Notice of Violation that TapeCoat recieved in Nov 2019, and\n* engage with various community and environmental protection groups to bring this issue further into the public’s view.\n\nFor Chase Corp, TapeCoat may simply be a source of revenue, but for our neighborhood, it is about the health of our kids, parents, and grandparents, who breathe in the after effects of those revenues. We appreciate having a partnership with businesses in our neighborhood, but not at the expense of our health.\n\nSincerely,\n\n***Concerned Neighbors of Smith Park (Evanston, IL)***", "title": "Evanston Neighborhood Forced to Smell Factory Emissions during COVID-19 Shelter in Place"}, {"created_utc": 1587058354, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g2jgu3/my_internship_got_canceled_so_im_wondering_if/", "id": "g2jgu3", "is_self": true, "score": 47, "selftext": " I was supposed to intern at the Kane County Judicial Center with regards to probation/juvenile. There is still a very small chance it might pick back up later in the summer, but I was encouraged to not put all my faith into it and instead look for other opportunities.\n\nMy interest area is forensic psychology, so I am really open to a broad number of settings - law, psychology, psychiatry, social work, social services, state services, non-profits that work with juveniles or adult inmates. If you work for or know of any of these companies/settings that are still willing to take on interns and work with them remotely, I would be ever grateful. I graduate in spring 2021 so I don't really have the option of doing an internship next summer as I'll already have had to accept an offer to graduate school. I probably won't be working this summer either, so full-time would also work!", "title": "My internship got canceled, so I'm wondering if anyone's company is still looking to hire interns to work remotely for the summer."}, {"created_utc": 1587142873, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g35xnx/updated_chicago_unemployment_figures_released/", "id": "g35xnx", "is_self": true, "score": 17, "selftext": "[Official unemployment figures for the Chicago economy](https://www.bls.gov/eag/eag.il_chicago_md.htm) were updated today. Numbers for February have been finalized and preliminary figures for March have now been made available.\n\n\n**February**\n\nThe unemployment rate fell to 3.4% in February. 45,300 positions were added, with only 39,300 workers entering the labor force causing the unemployment rate decrease. The overall Nonfarm Payrolls figure did not change significantly. No individual sector saw significant employment changes.\n\n\n**March** (preliminary)\n\nThe unemployment rate increased to 5.0% in March. 11,600 positions were added, but 75,700 workers entering the labor force caused the unemployment rate to increase. Nonfarm payrolls fell by 19,000. No individual sector saw significant employment changes.\n\n\n^*Chicago_Statistics ^is ^a ^public ^service ^account ^committed ^to ^making ^/r/ChicagoSuburbs ^a ^better ^informed ^community.", "title": "Updated Chicago Unemployment Figures | released April 17, 2020"}, {"created_utc": 1587173614, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g3f1ps/suggestions_small_business_i_could_buy_a_cricut/", "id": "g3f1ps", "is_self": true, "score": 1, "selftext": "Looking for a local business that's not closed! Thanks in advance!", "title": "Suggestions, small business I could buy a Cricut from?"}, {"created_utc": 1587215290, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g3n8k2/sil_has_been_on_unemployment_since_at_least/", "id": "g3n8k2", "is_self": true, "score": 1, "selftext": "Is that normal? Just want to check so she doesn’t falsely rely on the increase in payments in the future. Or get fines for overpayment because she was laid off prior to the pandemic.", "title": "SIL has been on unemployment since at least December, but is getting the covid $600 bonus now totaling $800/ week."}, {"created_utc": 1587230722, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g3ra7i/help_me_find_an_airplane_crash_site/", "id": "g3ra7i", "is_self": true, "score": 10, "selftext": "I have heard that there is an airplane crash site somewhere in Elgin, IL. I have looked for HOURS ON END on google maps and I cannot seem to find it! I was told to search on Reddit but I'm having no luck. I really want to take pictures at this site!!! If anyone has any clues or locations, please send them my way!!!", "title": "Help me find an airplane crash site!?"}, {"created_utc": 1587234378, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g3sbqi/lake_in_the_hills/", "id": "g3sbqi", "is_self": true, "score": 3, "selftext": "I’m looking to move out of the city next year, and Lake in the Hills is on my short list of suburbs I’ll be looking at. I don’t know much about it yet, other than it’s safe and low crime. Does anyone on this sub live there or in a neighboring town? Specifically, what are some things to do, how are the stores, restaurants, bars, etc. and how are the schools? Thanks!", "title": "Lake in the Hills"}, {"created_utc": 1587312047, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g4a1p3/best_time_to_start_looking_for_rentals/", "id": "g4a1p3", "is_self": true, "score": 1, "selftext": "Hey, Suburb native here, accepted a job in Oak Brook for next year and I’m looking for a place to live for next year. I’ve been looking for cheap houses to rent around Westmont, Villa Park, Lombard, and Downers Grove. Anyone know the best time and best place for me to start looking? \n\nThanks in advance!", "title": "Best time to start looking for rentals?"}, {"created_utc": 1587328320, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g4euqe/hoa_not_letting_landlord_fix_fence/", "id": "g4euqe", "is_self": true, "score": 1, "selftext": "Okay so the fence has given up in my patio and fallen apart. Landlords been in process with HOA to try getting it fixed for months now and not getting approval. I’m not the owner so my demand won’t be seriously by HOA . I also cannot put any “structure that resembles a barrier “. It’s getting warm and we share walls with neighbors many who have untrained dogs. I want to sit outside once and while but I can’t now because the dogs jump Into our yard. What do I do? Any suggestions ? It’s been 3 months by now and HOA is not cooperating.", "title": "HOA not letting landlord fix fence?"}, {"created_utc": 1587342924, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g4ivox/my_friend_brian/", "id": "g4ivox", "is_self": true, "score": 1, "selftext": "“My Friend Brian”\n\n\nMy friend Brisn has made an imperative lunch stop today at Portillos on Ontario for a dipped beef with hot peppers (Brian’s way), a large order of fries with a cheese cup to dip, and a large coke. He has lived all his life as a true-blue Chicagoan so this order is undoubtedly preparation for tonight’s airing of MJs “The Last Dance.”  MJ is his hometown hero so there’s no slowing down on the gravy today. He’s probably going to drag his beef through the mud 23 times to pay respect to his hometown hero. Would be a nice tribute after all!\n\nSo back to what I was saying, Brian arrived at the Ontario location drive-thru swiftly before noon to beat the lines. He’s a very calculated young Chicagoan. Everything lined up perfectly to start today’s Chi-indulgence. \n\nBrian, my friend for years, said he was going to the portillos location “downtown” and raises the argument that Ontario location is indeed “downtown.”\n\nThere’s an ongoing debate as to whether this location is considered “downtown”.  We must determine if my friend Brian is lyer. Please share!", "title": "My Friend Brian"}, {"created_utc": 1587358427, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g4mhwq/do_you_need_a_permit_to_use_kayak_on_forest/", "id": "g4mhwq", "is_self": true, "score": 1, "selftext": "Just got some new kayak and was wondering if you needed some sort of sticker or license to you them in public water?", "title": "Do you need a permit to use kayak on forest preserve lakes?"}, {"created_utc": 1587375319, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g4ps08/need_to_make_some_money/", "id": "g4ps08", "is_self": true, "score": 1, "selftext": "\n\n[View Poll](https://www.reddit.com/poll/g4ps08)", "title": "Need to make some money"}, {"created_utc": 1587411443, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g4zj6d/waste_transfer_station/", "id": "g4zj6d", "is_self": true, "score": 1, "selftext": "Does anybody have any advice for what to do with a pick-up truck load of debris from a DIY yard project? I have broken up concrete, pieces, of wood, etc. Image attached.\n\nWhen I was a kid, we could take things to the transfer station and the guy would eyeball the load, tell you how much it would cost, and you'd be done. I brought it to the Waste Management transfer station here, and they told me it would cost a minimum of $160 plus $15 to rent a hardhat and vest. \n\nDoes anybody know of any other / better locations? Or have other recommendations?\n\nhttps://preview.redd.it/shm2941oz0u41.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=8f34a76cc3430c4b0d486c64c8c16e7ad78cb7a6", "title": "Waste Transfer Station"}, {"created_utc": 1587515860, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g5rc6r/comed_power_outages_in_bloomingdale/", "id": "g5rc6r", "is_self": true, "score": 3, "selftext": "Anyone else experiencing intermittent short outages with ComEd in the NW suburbs, including Bloomingdale?  We just had the power cut out for like 30 seconds twice in the past 20 minutes.", "title": "ComEd Power Outages in Bloomingdale"}, {"created_utc": 1587662152, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g6qnd1/beverly_evergreen_park/", "id": "g6qnd1", "is_self": true, "score": 1, "selftext": "What do you guys know/think about living in these two neighborhoods? \n\nMy wife and I are late 20s.  She works in the loop. Spent last few days scanning around sites like Zillow and Niche, and these two spots seem nice and affordable.", "title": "Beverly + Evergreen Park"}, {"created_utc": 1587669165, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g6stqe/anyone_have_experience_with_csa_farms_around_here/", "id": "g6stqe", "is_self": true, "score": 1, "selftext": "Never used one before, but would like to try. I see there's several available with pickups in St Charles.\n\nWhat's your experience with quality, and price comparison to a grocery store?", "title": "Anyone have experience with CSA farms around here?"}, {"created_utc": 1587684664, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g6xh87/time_for_civil_disobedience/", "id": "g6xh87", "is_self": true, "score": 1, "selftext": "Okay so the Coronavirus is real, and it's serious. That said there could be a common sense middleground between shutting down society, ruining the economy, ruining lives, and giving zero fucks and going completely back to normal. Maybe we keep concerts and large venues closed, we wear masks in public and limit occupancy in businesses, but we get back to life.\n\nAt this point the goal posts keep changing, first it's we don't want to overwhelm the hospitals, now we want to see \"no new cases\" which is unrealistic.\n\nAnother month accomplishes nothing, the virus will still be here, it's not going anywhere. I hear some calling for not going back to normal until we have a vaccine which at the soonest \"might\" be september, more than likely a year to 18 months and it could never happen. Personally I'd rather take my risks with the Rona than be the first to take a vaccine that was rushed out.\n\nI'm calling for civil disobedience. Sure exercise some common sense, keep your distance, I'd even cave to wearing a mask despite thinking they aren't that affective and actually cause people to touch their face 100x as much as without one, but I'd even be up for that.\n\nI'm calling for others who agree to open their businesses, get together with friends and family, go to parks. They can't stop us all, there's power in numbers.\n\nThose who are terrified are more than welcome to stay at home and those who are in an at risk group should probably stay at home as well. The rest of us can get back to work, open our businesses, and support those who can't come out. If you're house had termites would you burn down the house or take a more surgical approach and target the problem area? Staying shut down is burning down the house.\n\nIf anyone decides to open back up I'll be the first to frequent your busienss and help support you and your business.\n\nI will no longer be a part of this insanity and hope others will join me\n\nEnd of rant", "title": "Time For Civil Disobedience"}, {"created_utc": 1587739992, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g79r4i/best_credit_union/", "id": "g79r4i", "is_self": true, "score": 1, "selftext": "What local credit unions/banks do you all use and enjoy? I’ve only used seaway bank.", "title": "Best Credit Union"}, {"created_utc": 1587767813, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g7i82z/good_carryout_restaurant_deals/", "id": "g7i82z", "is_self": true, "score": 1, "selftext": "I know olive garden has the Bogo Entrees. \n\nAny other places? \n\nAlso grubhub has $10 off $30 for some restaurants between 5-8pm", "title": "Good carryout restaurant deals?"}, {"created_utc": 1587955797, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g8s6u0/did_anyone_else_see_a_weird_string_of_long_lights/", "id": "g8s6u0", "is_self": true, "score": 1, "selftext": " I've never seen anything like that. Didn't capture on video but we got a still shot of it. So weird!!", "title": "Did anyone else see a weird string of long lights in the sky about 20 or so minutes ago?"}, {"created_utc": 1587955898, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g8s7qh/anyone_see_ufos_mysterious_lights_in_the_sky/", "id": "g8s7qh", "is_self": true, "score": 1, "selftext": "I had a friend tell me that she was smoking outside in Elmhurst and she looked up at the western sky and saw several lights in the sky then immediately disappear.\n\nJust wanted to know if anyone had anything similar.", "title": "Anyone see UFOs /mysterious lights in the sky tonight? 4/26/202"}, {"created_utc": 1587956067, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g8s96l/did_anyone_else_catch_the_starlink_satellite/", "id": "g8s96l", "is_self": true, "score": 1, "selftext": "Really cool to witness. Looked like UFO's!", "title": "Did anyone else catch the Starlink satellite train that just flew over at about 9:20PM?"}, {"created_utc": 1588002784, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g93ajs/avoid_tinley_park_sams_club_if_your_kids_have/", "id": "g93ajs", "is_self": true, "score": 0, "selftext": "Avoid Tinley Park Sams Club if you’re kids have special needs\n\nI just tried to go to Sams Club this morning with my 3 year old son who has autism. I had a mask on, and a mask for him in my bag. We waited outside in line for about 25 minutes when a (very rude) older gentleman approached us and told us we wouldn’t be able to get in unless my son put a mask on. \n\nI bought him a box of Mickey Mouse masks hoping it would help ease him into wearing one. But he wouldn’t. He wouldn’t put it on and the one I had for him - he ripped off his face as I was trying to put it on him since we were being scolded and it landed right in a dirty puddle. I explained to the guy that my son has special needs and he told me I had to get out of line and leave. \n\nI understand there is rules and we are all trying to deal with this pandemic but the way he called me out and continued to argue and embarrass me and then told me I should start paying more attention to the news because Tinley Parks face covering went into effect before Chicago - but I do not live in Tinley Park, I just go to Sams Club there. To make matters worse, I was only going there to get ONE item. I almost waited 30 minutes and was talked to like I was garbage for one item. \n\nI got in my car and bawled my eyes all the way home. I don’t have family here, and my struggles with my son is nobody else’s fault... just sad the lack of compassion. Learn how to talk to people.", "title": "AVOID TINLEY PARK SAMS CLUB IF YOUR KIDS HAVE SPECIAL NEEDS"}, {"created_utc": 1588016963, "full_link": "https://www.reddit.com/r/ChicagoSuburbs/comments/g97xnq/hot_topic/", "id": "g97xnq", "is_self": true, "score": 0, "selftext": "\nHello all, we need help to determine the outcome of an ongoing debate today.  Any feedback would be much appreciated. \n\nMy Friend Briasn was claiming that he’s a real Chicagoan today, brisn born and raised in Palentine IL. \n\nEven made the claim that he’d be considered a truer Chicagoan than someone from Elmhurst. \n\nWhich suburb is would be considered a truer Chi-Burb?\n\nThanks!", "title": "Hot Topic 🔥"}]