[{"id": "f2prvq", "title": "Weekly growth of new infections outside Hubei dropped from 250% to 62% comparing last week to the previous.", "selftext": "For Chinese cities outside Hubei:\n\n* Growth Rate of New Infections from Jan 27th to Feb 2nd: **250%**\n* Growth Rate of New Infections from Feb 3rd to Feb 9th: **62%**\n\nA similar drop in the next 7 days will see growth of new infections in Chinese cities outside of Hubei fall to 15% by Feb 16th.\n\nSource: [John Hopkins University](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html?fbclid=IwAR1xqib94jDzPGgncqgpsA-uyKx2nu7-FMH1LNUR8VG3UAJtBtqQ8ihiCAc#/bda7594740fd40299423467b48e9ecf6)", "full_link": "https://www.reddit.com/r/COVID19/comments/f2prvq/weekly_growth_of_new_infections_outside_hubei/", "created_utc": 1581506518}, {"id": "f4g1gy", "title": "Chinese scientists have been working on methods to quell cytokine storm - a major cause of death of critically ill patients of the novel coronavirus, Zhou Qi, an academician of Chinese Academy of Sciences, said on Saturday.", "selftext": " [http://www.chinadaily.com.cn/a/202002/15/WS5e47c280a310128217277ca0.html](http://www.chinadaily.com.cn/a/202002/15/WS5e47c280a310128217277ca0.html)\n\nSome recent media reports said a number of patients with novel coronavirus have suffered from a cytokine storm, an overreaction of immune cells and their activating compounds known as cytokines caused by external virus, infection or drugs that can damage the body itself while trying to eliminate the virus at the same time.\n\nThe occurrence of a cytokine storm signifies that a patient with novel coronavirus pneumonia has transitioned from having mild symptoms to severe or critical symptoms. It is also a major cause of death of critically ill patients, Zhou said at a news conference.\n\nHe said the Ministry of Science and Technology and the Chinese Academy of Sciences have carried out many projects that focus on discovering ways to reduce a cytokine storm and exploring new treatments by modifying the immune response and suppressing inflammation in a bid to treat critical patients.\n\nTo prevent the occurrence of a cytokine storm, scientists have screened many old drugs, including some drugs that have been proven effective in the treatment of rheumatism. After several preliminary verifications, some drugs have been put into clinical trials on 14 critical cases, with the oldest patients being 82 years old, and the results have appeared encouraging, Zhou said.\n\nHe said the comparative experiment is also underway with 94 cases in the treatment group and 94 in the control group – patients who do not receive the treatment in order to test the effectiveness of the drug.\n\n\"If the initial results prove effective, we will promote these effective treatments to critical patients as soon as possible,\" he said.\n\n\"The work on reducing the cytokine storm is still ongoing. I believe more candidate drugs will be put into treatment,\" he added.\n\nAlso discussed in this Lancet article:  \n[https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)30305-6/fulltext](https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)30305-6/fulltext)\n\nSome background on what cytokine storms are:  \n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4711683/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4711683/)\n\n[https://www.nature.com/articles/cmi201574](https://www.nature.com/articles/cmi201574)  \n\n\ncross posting from my original post in r/China_Flu  \n[https://www.reddit.com/r/China\\_Flu/comments/f4f5jm/chinese\\_scientists\\_have\\_been\\_working\\_on\\_methods/](https://www.reddit.com/r/China_Flu/comments/f4f5jm/chinese_scientists_have_been_working_on_methods/)", "full_link": "https://www.reddit.com/r/COVID19/comments/f4g1gy/chinese_scientists_have_been_working_on_methods/", "created_utc": 1581802056}, {"id": "f4gc3f", "title": "Requesting Your Help : Practical Measures", "selftext": "Hi, there is a new subreddit I have set up a few hours ago called r/PracticalCoronavirus\n\nThe idea behind it is as a place for the public to ask questions about how they can protect themselves. Anyone with any knowledge they can share we will be grateful and it will help to get the right information out there.\n\n*Processing img rmtft18gr5h41...*", "full_link": "https://www.reddit.com/r/COVID19/comments/f4gc3f/requesting_your_help_practical_measures/", "created_utc": 1581803270}, {"id": "f4sao7", "title": "Question re: rent in areas under lockdown.", "selftext": "Has rent been suspened in areas on lockdown? Will people be evicted for not being able to pay or has the government stopped landlords from charging people for any time while they are not permitted to work? Equally, how about interest payments on mortgages etc? Has that also been suspended?", "full_link": "https://www.reddit.com/r/COVID19/comments/f4sao7/question_re_rent_in_areas_under_lockdown/", "created_utc": 1581867751}, {"id": "f5a7ms", "title": "Has anyone calculated what the recent R0 is aboard the Diamond Princess is?", "selftext": "Probably not with the latest figures, which is now [454 infected](https://www3.nhk.or.jp/nhkworld/en/news/20200217_47/9 out of 3,700 total passengers on board. \n\nWhat about links to past estimates? I recall seeing one of around 8, but unfortunately did not bookmark it and now cannot find it. \n\nIt should be said that of course the cruise ship R0 will be a special case, but it is still interesting to know what it is. Especially since another cruise ship with an infected passenger, the [Westerdam, has not been quarantined and rather nearly all of its passengers have dispersed with no or minimal controls](https://www.scmp.com/week-asia/health-environment/article/3051033/malaysia-all-ms-westerdam-passengers-have-left-except).", "full_link": "https://www.reddit.com/r/COVID19/comments/f5a7ms/has_anyone_calculated_what_the_recent_r0_is/", "created_utc": 1581952931}, {"id": "f5s5dm", "title": "Evil within", "selftext": "I was living in my bubble and thinking that people are actually good-hearted but experience and age showed me the otherwise. Seems like we are on the verge of the global pandemic or apocalypse? I see that people are trying to make others sick. Selfishness is on the rise again. The last man standing. What I want to say is If there are good people out there who don't want bad things to happen to others, beware! Because most of the people will think and even do the opposite. Empathy may weaken you. Approach with caution.", "full_link": "https://www.reddit.com/r/COVID19/comments/f5s5dm/evil_within/", "created_utc": 1582034166}, {"id": "f5td7n", "title": "A brief update related to /r/COVID19", "selftext": "Hello everyone,\n\nWe were informed yesterday of a user submitting links to a website that he / she was employed by (or owned).  \n\nI apologize for not being more on top of this issue as one of our moderators highlighted this problem the other day as well.  This user has been permanently banned for failure to inform us of their conflict of interest, and for attempting to monetize the subreddit.  \n\nWe will NOT be allowing anyone to monetize our subreddit, nor use it as a platform to personally benefit from.  \n\nGiven recent issues with community trust in our moderation team, I wanted to inform you all of how we plan on dealing with these issues going forward.  If you see an account trying to link spam or showing a professional conflict of interest on any of /r/COVID19, /r/coronavirus, or /r/China_Flu, please don't hesitate to inform us via DM or the report button.", "full_link": "https://www.reddit.com/r/COVID19/comments/f5td7n/a_brief_update_related_to_rcovid19/", "created_utc": 1582039423}, {"id": "f6dle4", "title": "considering aerosol transmission, how do aerobic septic systems with sprinklers instead of leach fields factor in?", "selftext": "is it dependent on the  sanitizer (usually bleach liquid or tabs that must be added periodically) or will the virus collect with the solids in one of the tanks?\n\nthere are whole communities that utilize these types of wastewater management.", "full_link": "https://www.reddit.com/r/COVID19/comments/f6dle4/considering_aerosol_transmission_how_do_aerobic/", "created_utc": 1582131566}, {"id": "f7epnm", "title": "As the situation in Korea grows more dire, citizens have begun to fear a lockdown scenario similiar to China.", "selftext": "City bus lines in Daegu stopped their service. https://imgur.com/gallery/o4rDPpy\n\nPhoto taken in Daegu; citizens stockpile food in fear of lockdown https://imgur.com/gallery/BzJLiw2\n\nCitizens of Korea have begun to see many doctors in hazmat suits. The situation is becoming worse everyday.\n\n[Seoul, Korea](https://imgur.com/gallery/2wXiaMN)\n\n[unknown location, Korea](http://imgur.com/gallery/kdYXPUF)\n\n[unknown location, Korea](http://imgur.com/gallery/dHUkcqa)\n\nEven amidst the outbreak, [protests](http://imgur.com/gallery/agWYtFw) are still continuing. \n\nThere was a 100% infection increase in one day. Now 204 cases in Korea and 2 deaths.\n\nhttps://www.google.com/amp/s/amp.dw.com/en/coronavirus-infections-in-south-korea-double-as-emergency-measures-declared-for-covid-19/a-52467865", "full_link": "https://www.reddit.com/r/COVID19/comments/f7epnm/as_the_situation_in_korea_grows_more_dire/", "created_utc": 1582307205}, {"id": "f7mlcf", "title": "Is there any proof that the Diamond Princess ship wasn't effective?", "selftext": "Prior to the damning report of the Japanese expert who boarded the ship (who comes across as potentially attention seeking) and the additional 14 cases which were flown back to America I had heard plenty of speculation that the quarantine was ineffective. But at least earlier on, my gut feeling was that this was uneducated and merely motivated by a visceral repulsion to seeing the case count rapidly go up. \n\ntldr: Are there confirmed cases still sailing in after the 14 day \"DP quarantine procedure?\" Are they explainable by the estimation that 5% of cases will have an incubation period of more than 14 days?", "full_link": "https://www.reddit.com/r/COVID19/comments/f7mlcf/is_there_any_proof_that_the_diamond_princess_ship/", "created_utc": 1582340835}, {"id": "f7n35z", "title": "I am from Hong Kong, Here is some suggestion of how we deal with the wuhan coronavirus", "selftext": "Wearing surgical mask whenever you go out. We dont have enough masks in HK, so most of the people only use one mask per day. Our government has a lot of masks, but they choose to donate to China instead of giving out to HK ppl. \n\nN95 is preferable, but if you plan to reuse it. Please sanitize it before use it again. I personally use UVC to sanitize. I think it works very well, at least i am not sick yet. But i will only reuse 2 to three days, cus UV dont play well with pp plastic.\n\nGas mask is also another option here. After half year of protest, everyone should have one gas mask at home. But you still need to clean your mask every night when you go home. For the mask itself, use **1:49** diluted household bleach to clean it. For your filter, use UV or 75% alcohol.\n\nMore importantly, always wash your hand or use hand sanitizer. \n\nAsk me anything, i am more than happy to answer all your question. We won the battle of SARS before, but it was not pretty, almost 300 ppl are dead. I hope everyone is in good health.", "full_link": "https://www.reddit.com/r/COVID19/comments/f7n35z/i_am_from_hong_kong_here_is_some_suggestion_of/", "created_utc": 1582343351}, {"id": "f7xs0m", "title": "This website compiles coronavirus Google searches from China (VPN) in real-time", "selftext": "[https://www.coronasearch.live/](https://www.coronasearch.live/)\n\nI launched this website yesterday. I hope the data might be useful to epidemiologists, in time.\n\nThe data is freely available to download, for anyone.\n\nEach search is someone’s search for truth...and through this data, heretofore unseen trends emerge. May it give anyone who is trying to solve the virus a new way to find patterns and causes—directly informed by what people on the ground in China are typing into Google.\n\nMore datasets will be available in the coming days. (e.g. a campaign for masks...which will create a heatmap for supply needs by city). (I'm paying for each click from China (which occasions each search data) out of my pocket, so I need to expand deliberately.)\n\nThanks for visiting, and I'll hope you'll share with someone who will find this useful.", "full_link": "https://www.reddit.com/r/COVID19/comments/f7xs0m/this_website_compiles_coronavirus_google_searches/", "created_utc": 1582401261}, {"id": "f8lofv", "title": "Why are so many young doctors dying of covid19 in Wuhan? It may be because they are exposed to a high viral load upon infection.", "selftext": "Recently there have been several tragic deaths of young doctors in Wuhan from covid19, including the 29-year-old [Dr. Xia Sisi](https://www.reddit.com/r/Coronavirus/comments/f86hfd/xia_sisi_a_29yearold_doctor_at_a_hospital_in/), the 29-year-old [Dr. Peng Yin Hua](https://www.reddit.com/r/Coronavirus/comments/f6zxfj/29_year_old_wuhan_respirologist_and_icu_doctor_dr/), the 42-year-old [Dr. Huang Wenjun](https://www.reddit.com/r/Coronavirus/comments/f8a8vn/huang_wenjun_a_42yearold_doctor_at_a_hospital/), and of course the 34-year-old [Dr. Li Wenliang](https://en.wikipedia.org/wiki/Li_Wenliang). This is at some odds with general population data showing that deaths of covid19 tend to be highly concentrated in the elderly. It could be a statistical anomaly, but it does seem like death rates may be higher in young doctors than would be expected in the population. \n\nAs an explanation, many of the most upvoted comments on these posts suggest that their immune systems might be suppressed due to overwork, poor sleep, and stress. To me, this seems to be an extremely unlikely explanation for many reasons, including the fact that doctors don't seem to die at relatively higher rates of other infectious illnesses such as influenza. \n\nHowever, some people have mentioned higher viral load as a possibility, which seemed more likely. I did some research and I found this 2005 study on the role of viral load in SARS (which is, of course, very similar to covid19): [https://wwwnc.cdc.gov/eid/article/11/12/pdfs/04-0949.pdf](https://wwwnc.cdc.gov/eid/article/11/12/pdfs/04-0949.pdf) \n\nThe study looked at an outbreak of sars in a particular housing area in Hong Kong. They found that people who had closer contact with the index patient had a higher nasopharyngeal viral load on admission as measured by RT-PCR. Crucially, they also found that people in this area were also the most likely to die. Some quotes: \n\n\"**The median nasopharyngeal viral load in E block patients (5.09 log10 copies/mL) was much higher than in non-E block patients (0 log10 copies/mL) on admission (p&lt;0.001)**... The overall case death rate among the 79 patients was 24.1%. The highest rate was in block E, which accounted for 79% of all deaths, while the death rate in patients living in E7 (the same block as the index patient) was 70% (7 patients). This rate is significantly higher than in other units (p = 0.001 by χ2 test). The index patient was one of the few patients from E7 who survived the disease.\"  \n\"Severity of illness did not differ between block E patients and non-E block patients when they were first seen at the hospital, despite higher viral load in block E patients. However, the death rate was higher in block E. **We have previously demonstrated that patients with high initial and peak viral loads in nasopharyngeal samples were more likely to show a less favorable disease course and lower survival rate (8,18).** Patients living in E7 who had highest nasopharyngeal viral loads explains why their death rate was higher than for those living in other units. The dilution effect resulted in a decreased viral load as the disease spread to other units and in a lower death rate.\"\n\nThis data corroborates the viral load theory. It's not perfect evidence, but the theory also makes basic physiologic sense. A higher viral load on initial infection means that the virus will be able to do more damage and suppress the host's immune system further (lymphopenia) before the host can mount an immune response against the virus. \n\nHospital workers are likely to be exposed to especially high viral loads of covid19. People who are hospitalized with covid19 infections are likely to cough more and require close contact for procedures such as IV placement and intubation. It is hard to know for sure, but healthcare transmission risk may have been especially high in the early stages of the epidemic in Wuhan, when people were not as aware of the high mortality rates of this disease. \n\nIf viral load upon initial infection correlates with disease severity, this may also help to explain why some local clusters seem to have more severe disease, such as the family who all died of the disease. For some reason, people in these clusters may have been exposed to an especially high viral load. Ideally, we could measure the viral load of infected people with RT-PCR to test this, although it's hard enough to get basic yes/no tests for covid19 at this point. \n\nThe viral load theory is not rock solid. It may not explain a large percentage of the variance in disease severity - certainly age seems to be a larger factor. But to me, it is clearly the leading theory why a disproportionate number of young doctors without apparent pre-existing health problems have died of covid19 in Wuhan. \n\nHealthcare workers putting themselves at risk to care for the sick during this pandemic are heroes. It is an urgent priority to have sufficient PPE available to our healthcare staff. We also need to have adequate space available to allow for the adequate distancing of staff and possibly infected patients. The viral load theory suggests that PPE and distancing are not only important for preventing healthcare workers from getting the illness but also decreasing the likelihood that they will die of the illness if they are infected.", "full_link": "https://www.reddit.com/r/COVID19/comments/f8lofv/why_are_so_many_young_doctors_dying_of_covid19_in/", "created_utc": 1582517846}, {"id": "f90i3w", "title": "WHO says it no longer uses 'pandemic' category, but virus still emergency.", "selftext": " [https://uk.reuters.com/article/uk-china-health-who/who-says-it-no-longer-uses-pandemic-category-but-virus-still-emergency-idUKKCN20I0PD?feedType=RSS&amp;feedName=worldNews](https://uk.reuters.com/article/uk-china-health-who/who-says-it-no-longer-uses-pandemic-category-but-virus-still-emergency-idUKKCN20I0PD?feedType=RSS&amp;feedName=worldNews) \n\nThere will be no declaration of a worldwide pandemic!!! ... That's a **huge** relief. \n\nI am singing in the rain while tip toeing through the tulips.", "full_link": "https://www.reddit.com/r/COVID19/comments/f90i3w/who_says_it_no_longer_uses_pandemic_category_but/", "created_utc": 1582587298}, {"id": "f90ujk", "title": "Travelling", "selftext": "How much do you think this will effect my plans to travel Europe? All my friends say it will be fine and to stop worrying but all these subreddits have me sweating", "full_link": "https://www.reddit.com/r/COVID19/comments/f90ujk/travelling/", "created_utc": 1582588696}, {"id": "f95klz", "title": "Wash your hair before you go to bed?", "selftext": "Is it wise to wash your hair before you go to sleep, in case the virus landed there and you get it on your face during the night?", "full_link": "https://www.reddit.com/r/COVID19/comments/f95klz/wash_your_hair_before_you_go_to_bed/", "created_utc": 1582609683}, {"id": "f9vr0r", "title": "When we could know if warming will affect SARS-CoV-2?", "selftext": "Hi,\n\nI saw on [National Geographic](https://www.nationalgeographic.com/science/2020/02/what-happens-to-coronavirus-covid-19-in-warmer-spring-temperatures/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) that it's too early to know if seasonality affect the SARS-CoV-2 virus. But I want to know when we could know if seasonality affect the virus.", "full_link": "https://www.reddit.com/r/COVID19/comments/f9vr0r/when_we_could_know_if_warming_will_affect_sarscov2/", "created_utc": 1582734347}, {"id": "f9y8q0", "title": "How best to sanitize N95 masks for reuse?", "selftext": "Reusing N95 masks will help minimize shortages.  What's the best way to sanitize ones that are still in good condition?", "full_link": "https://www.reddit.com/r/COVID19/comments/f9y8q0/how_best_to_sanitize_n95_masks_for_reuse/", "created_utc": 1582743752}, {"id": "fahvy2", "title": "Could this virus cause a stage 4 or 5 collapse?", "selftext": " Stage 4 collapse\n\n&gt;**For Orlov, in social collapse: “Faith that ‘your people will take care of you’ is lost, as local social institutions, be they charities or other groups that rush in to fill the power vacuum, run out of resources or fail through internal conflict.” For this reason, community organizing is futile because “the central problem with community organizing is that the sort of community that stands a chance post-collapse is simply unacceptable pre-collapse: it is illegal, it is uncomfortable and it is unsafe. No reasonable person would want any part of it.”**\n\nStage 5 collapse\n\n&gt;**Orlov defines cultural collapse in this way: “Faith in the goodness of humanity is** **lost. People lose their capacity for ‘kindness, generosity, consideration,** **affection, honesty, hospitality, compassion, charity.’ Families disband and compete as individuals for scarce resources. The new motto becomes ‘May you die today so that I can die tomorrow’.”**\n\n[https://carolynbaker.net/2013/04/07/the-five-stages-of-collapse-by-dmitry-orlov-reviewed-by-carolyn-baker/](https://carolynbaker.net/2013/04/07/the-five-stages-of-collapse-by-dmitry-orlov-reviewed-by-carolyn-baker/)", "full_link": "https://www.reddit.com/r/COVID19/comments/fahvy2/could_this_virus_cause_a_stage_4_or_5_collapse/", "created_utc": 1582833574}, {"id": "famn0k", "title": "everyone on the news right now are saying tough decisions will need to be made what exactly does that even mean?", "selftext": "since this morning ive heard reporters and scientists saying our medical system is going to have to make difficult decisions in the coming days wtf does that even mean first they tell everyone its just like the flu now they say its very dangerous and that difficult decisions will need to be made??", "full_link": "https://www.reddit.com/r/COVID19/comments/famn0k/everyone_on_the_news_right_now_are_saying_tough/", "created_utc": 1582852801}, {"id": "fapiop", "title": "How quickly does this virus mutate?", "selftext": "Can anyone give me a scientific source on how quickly SARS-CoV-2 mutates (if known)? I've seen people saying all kinds of things - it mutates extremely slowly; it mutates quickly; it mutates quickly, but has a mechanism that repairs most of it's mutations...etc. I guess I'm mostly asking because I'm wondering if by the time a vaccine is approved in 18 months or so (if one of the ones currently in development is approved) it will still be effective, or if the virus could have mutated into a strain too different by then (similar to how we can't make a universal flu vaccine because of how quickly it mutates)", "full_link": "https://www.reddit.com/r/COVID19/comments/fapiop/how_quickly_does_this_virus_mutate/", "created_utc": 1582866165}, {"id": "fawj2l", "title": "Do younger white people also die from Corona virus?", "selftext": "I'm 30, white... and very athletic (been doing various sports for 10 years), I have good immune system and haven't been sick in years... but is it true that healthy white younger people also die from this virus?", "full_link": "https://www.reddit.com/r/COVID19/comments/fawj2l/do_younger_white_people_also_die_from_corona_virus/", "created_utc": 1582904444}, {"id": "fb2jih", "title": "When will domestic airline travel in the USA be way too risky in non cluster areas? Is it already?", "selftext": "I can't remember if this is one of the 'curated' subreddits so I don't know if I'll get a panic answer or a scientific one.", "full_link": "https://www.reddit.com/r/COVID19/comments/fb2jih/when_will_domestic_airline_travel_in_the_usa_be/", "created_utc": 1582927671}, {"id": "fb6zr2", "title": "Is it safe to travel to Japan?", "selftext": "Hey! I from India and I have a question.\n\nI plan to travel with my family to Japan from the 14th of May for 2 weeks. The outbreak of the coronavirus has my family worried and wondering if we should even risk going there. For the record, we are all healthy people, (ages: 15M, 20F, 50F, 53M) and my research tells me that young healthy people, even if they get infected, do not face severe cases of the virus. Regardless, I wanted to know, will this outbreak will get worse by the time we travel?\n\nWe will have to apply for our visas in the first week of April and the flight tickets have been booked.(but they can be canceled for a full refund)\n\nAnother thing that’s playing on out mind is the backlash we might face from travelling. Might we be potential carries for people in India? Our places of work and schools may not allow us back, etc. \n\nSome scientific insight on this apart from the news articles would be greatly appreciated. Thanks!", "full_link": "https://www.reddit.com/r/COVID19/comments/fb6zr2/is_it_safe_to_travel_to_japan/", "created_utc": 1582948995}, {"id": "fb986y", "title": "How high is the chance that marathons taking place soon will be canceled?", "selftext": "This is not some kind of update, but more of a question. I will take part in the Berlin Half Marathon (04/05/2020) and am pretty concerned while watching the Israel Marathon. Just to let you know, I'm German, so sorry for some misspelling.", "full_link": "https://www.reddit.com/r/COVID19/comments/fb986y/how_high_is_the_chance_that_marathons_taking/", "created_utc": 1582961868}, {"id": "fba2pf", "title": "Religious gatherings (mass) should switch to streaming", "selftext": "I get that in the times to come people will need something to hold on to and for many people that is religion (full disclosure: I am not religious). Going to your weekly church service in this situation doesn't seem like the smart thing to do, since this would likely just accelerate spread, so why not have your pastor stream the service and people watch it from home? I'm sure there's an app idea in there somewhere, though I'm not entirely sure what the benefit over just simple streaming platforms like youtube/twitch/whatever would be. (I'm sure you could add many features and make a business out of it, but that's not really my point here...)", "full_link": "https://www.reddit.com/r/COVID19/comments/fba2pf/religious_gatherings_mass_should_switch_to/", "created_utc": 1582967672}, {"id": "fbg1uk", "title": "Study: cats/pigs could act as intermediate hosts. Is this confirmed?", "selftext": "[This study](https://jvi.asm.org/content/early/2020/01/23/JVI.00127-20) models interaction of  the virus' spike protein with ACE2 receptor, and its results are troubling:\n\n&gt;2019-nCoV RBD likely recognizes ACE2 from pigs, ferrets, cats, orangutans, monkeys and humans with similar efficiency , because these ACE2 molecules are identical or similar in the critical virus-binding residues.  \n&gt;  \n&gt;(...)  \n&gt;  \n&gt;Pigs, ferrets, cats and non-human primates contain largely favorable 2019-nCoV -contacting residues in their ACE2, and hence may serve as animal models or **intermediate hosts** for 2019-nCoV. \n\nThey do not mention dogs. However, cats being able to transmit the disease would be a pretty serious problem. \n\nIf pigs can get infected, will pork meat be infectious?\n\nIs there more information about this?", "full_link": "https://www.reddit.com/r/COVID19/comments/fbg1uk/study_catspigs_could_act_as_intermediate_hosts_is/", "created_utc": 1582998160}, {"id": "fbm11z", "title": "How are you all preparing?", "selftext": "I'm in the Bay Area and we're hit by multiple cases just this week, so I've started prepping to be stuck in my home for a bit if things go bad\n\nHow are you guys preparing other than the usual stocking up on: \n\n- water \n- toilet paper \n- Kleenex / paper towels \n- water \n- non-perishable or frozen goods (like ramen, frozen meals, canned soups, etc) \n- hand sanitizers \n- cleaning supplies \n\nWant to make sure I'm not missing anything", "full_link": "https://www.reddit.com/r/COVID19/comments/fbm11z/how_are_you_all_preparing/", "created_utc": 1583023127}, {"id": "fbo9vm", "title": "Is Wind a factor? How far can this thing likely survive?", "selftext": "I heard an interesting point that Europe had very powerful winds in the past few weeks. And suddenly we seem to be getting random untraceable cases out of nowhere all over the place. And to be fair, google returned very little on the subject. So how far can SARS2 probably survive? I can probably imagine droplets being blown across street but can it survive longer travels?", "full_link": "https://www.reddit.com/r/COVID19/comments/fbo9vm/is_wind_a_factor_how_far_can_this_thing_likely/", "created_utc": 1583033740}, {"id": "fbp3f8", "title": "Might Rh Negative Blood Type Confer Immunity To Sars-Cov2 Infection?", "selftext": "My question was inspired by [this comment](https://www.reddit.com/r/COVID19/comments/f48yt1/any_naturally_immune_persons_to_this_virus/fhowct3?utm_source=share&amp;utm_medium=web2x) (and the general thread asking if some individuals might be naturally immune for whatever reason). TL;DR: A claim was made that individuals with an rh-negative blood type do not naturally possess the ACE2 lung receptors necessary to be infected by the virus. \n\nI've been curious about this claim ever since I read it here, but a substantial Google search about this question turned up nothing of value. Anyone able to substantiate or disprove this hypothesis?", "full_link": "https://www.reddit.com/r/COVID19/comments/fbp3f8/might_rh_negative_blood_type_confer_immunity_to/", "created_utc": 1583037971}, {"id": "fbpq6u", "title": "Question about this virus", "selftext": "I have seen people saying it's worst  or as bad as the Spanish Flu?I have even seen that it will be worst than the black plague. Is it really the case tho?", "full_link": "https://www.reddit.com/r/COVID19/comments/fbpq6u/question_about_this_virus/", "created_utc": 1583041504}, {"id": "fbq7h1", "title": "Thoughts on dealing with dead bodies", "selftext": "I haven't seen much discussion about this issue, but I this issue should be addressed. I notice three things I think the hospital/government should be thinking about as situation getting worse.\n\n1. What to do with the body immediately after the death. Normally they will be stored in morgue until the funeral. But what had happened in China is some hospital quickly run out of space. Dead bodies can also be source for further spreading of the virus. So what the Chinese government did is immediately transfer the bodies away, not storing them in the hospital, to protect the medical staff and other patients in hospital. \n2. Bodies in China were immediately cremated after death. Cremation has been the standard procedure in China for a while. During time of pandemic, this would be the best way to treat a body. However, I know burial is the most common way. I think the government really need to think about it whether they can cremate instead bury bodies, but I know it will be very hard to do so. And funerals should be pushed off as well, but storing bodies with virus for a long time is not good for controlling the situation.\n3. As the virus keeps spreading, eventually, there will be dead cases for un-diagnosed patients. Ideally, we want to figure out the cause of death. During a time that living patients are waiting in line to be tested, I'm not sure whether they can be tested. China just cremate those bodies, which caused an underestimation of the real death account, and also triggered huge controversy. But I don't know if there is a better way of handling it in situations like that. \n\nThose are some issues came to my mind. I know it's a sad topic, and people probably don't want to think about it. But the government should start planning things before it really get to that stage. And I welcome any thoughts or better suggestions.", "full_link": "https://www.reddit.com/r/COVID19/comments/fbq7h1/thoughts_on_dealing_with_dead_bodies/", "created_utc": 1583044413}, {"id": "fbqatx", "title": "Canadian researchers will trial Quercetin as an anti-viral treatment for Covid-19", "selftext": "CBC new story-\n\nhttps://www.google.co.jp/amp/s/www.cbc.ca/amp/1.5480134\n\nScientific paper on its prophylactic efficacy against Ebola-\n\nhttps://aac.asm.org/content/60/9/5182", "full_link": "https://www.reddit.com/r/COVID19/comments/fbqatx/canadian_researchers_will_trial_quercetin_as_an/", "created_utc": 1583045024}, {"id": "fbqtfl", "title": "Alarming behaviour from a mod - threatening a ban to shutdown discussion of a link to a Lancet journal article", "selftext": "The link to the discussion is here:\n\nhttps://www.theguardian.com/commentisfree/2020/feb/29/elizabeth-warren-super-pac-week-in-patriarchy\n\nu/C3R3B3 had quoted a sentence from a Lancet article (which they linked) in a discussion over whether Covid-19 could be transmitted via an airborne vector. That redditor was arguing that the quote showed that medical teams were taking precautions that it could.\n\nMod u/JenniferColeRhuk's closing comment in the discussion:\n\n&gt; If you continue to try to argue your case you'll be banned.\n\nNow I don't actually have an opinion one way or the other about the matter under discussion. However I find it alarming that a redditor who was trying to discuss the matter *in good faith* and who linked to a reliable source was shut down by a mod in this way. Understanding comes from open discussion and presenting a good argument, not from this type of mod behaviour. I appreciate that this sub is trying to keep a higher standard of discussion but I can't see where u/C3R3B3 was breaching those standards, even if the position they were taking was wrong.\n\nDisclaimer: I myself have had one interaction with u/JenniferColeRhuk in this sub. You can find that exchange here:\n\nhttps://www.reddit.com/r/COVID19/comments/f9dbeq/covid19_what_do_we_have_to_fear_from_a_pandemic/fiwsj0q/", "full_link": "https://www.reddit.com/r/COVID19/comments/fbqtfl/alarming_behaviour_from_a_mod_threatening_a_ban/", "created_utc": 1583048451}, {"id": "fbr4ev", "title": "To (hopefully) clear up some misconceptions about the efficacy of &gt;= N95 grade masks", "selftext": "Upon learning that the virus was smaller than the size the N95 mask is graded to (~300 micrometers) and then wondering why they're still effective at all, I did some research a few weeks ago on how this type of filtration works.\n\nI came across a comment earlier that made me realize that many people might have some misconceptions on how they actually work, where it's not like some extremely fine type of cheese cloth or something and is functionally quite different. \n\nThe following is my response to that comment edited. Their comment was asking about whether using something like alcohol to \"clean the mask\" was an effective strategy.\n\n(If I'm wrong in any of the following claims or my logic is off / incorrect please let me know)\n\n____\n\n[These grade of masks](https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0186217) use dialectic materials known as [electret](https://en.wikipedia.org/wiki/Electret) to filter electrically charged molecules from the much smaller molecules (with less total charge) like o2.\n\nDissolving something means to, in basic terms, [disassociate something into it's ion parts in a solvent](https://en.m.wikipedia.org/wiki/Solvation), and yes, using a solvent like alcohol on the mask will (depending on the specific chemistry of the material itself), very likely disrupt, I would assume, it's ability to effectively filter molecules of the size of a virus.\n\nEven if electret is, like a magnet, semi-permanently charged, their is a lot of engineering that goes into the layering and positioning of it to create the ionized field to make it effective at such small sizes of particles. \n\n____\n\nSo in effect, these masks are just less than ~95% effective against particles smaller than it, but unlike a cheese clothe or fishing net trying to filter something too small for it (where it passes right through), this type of filtration is still going to filter the vast majority of particles the size of SARS-CoV-2 (also, don't try to decontaminate it with chemicals).", "full_link": "https://www.reddit.com/r/COVID19/comments/fbr4ev/to_hopefully_clear_up_some_misconceptions_about/", "created_utc": 1583050597}, {"id": "fbwrv5", "title": "Not sure if this has been posted but US Navy has ordered a 2 week quarantine of all Pacific naval fleets.", "selftext": "https://www.google.com/amp/s/amp.cnn.com/cnn/2020/02/27/politics/navy-coronavirus-pacific-self-quarantine/index.html", "full_link": "https://www.reddit.com/r/COVID19/comments/fbwrv5/not_sure_if_this_has_been_posted_but_us_navy_has/", "created_utc": 1583081612}, {"id": "fbylxq", "title": "Drug Supplies", "selftext": "A lot has been made about the availability of beds and healthcare workers.\n\nNot so much has been said on if we actually have enough drugs, although treatment guidelines include these. See for example [https://www.thelancet.com/journals/lanres/article/PIIS2213-2600(20)30071-0/fulltext](https://www.thelancet.com/journals/lanres/article/PIIS2213-2600(20)30071-0/fulltext)\n\nThere are clinical trial of various anti-virals at the moment, and antibiotics will also be needed to prevent secondary infections. It looks like corticosteroids have also been used in some cases. \n\nAre there any sources that indicate what supplies of the required medicines are available in different countries or also how quickly supply could be ramped up?", "full_link": "https://www.reddit.com/r/COVID19/comments/fbylxq/drug_supplies/", "created_utc": 1583088805}, {"id": "fbzenc", "title": "Coworker is coming back from Egypt", "selftext": "So my coworker is in Egypt right now. However her and her husband and their son will be back here within the next few days. We work in a hospital. My administration hasn’t said anything but I’m honestly concerned.", "full_link": "https://www.reddit.com/r/COVID19/comments/fbzenc/coworker_is_coming_back_from_egypt/", "created_utc": 1583091888}, {"id": "fc1gwz", "title": "Will Covid 19 wear down when the temperatures goes up?", "selftext": "Trump says a lot of nonsense, but does he have a point that the virus might have a harder time spreading under warmer condition?", "full_link": "https://www.reddit.com/r/COVID19/comments/fc1gwz/will_covid_19_wear_down_when_the_temperatures/", "created_utc": 1583100099}, {"id": "fc1y47", "title": "Is there a source showing what diagnostic methods each health authority is using to confirm infection, and how prevalent each is?", "selftext": "Maybe this was asked, I couldn't find it.  What I'm basically wondering is if there's a source that will show what each health authority is using to confirm individuals have been infected with CoV-SARS-2, and how prevalent testing with each method is.  I'm wondering this because I realized as I'm looking at all of these confirmed cases vs critical vs deaths, numbers reported by a health authority that's doing surveillance testing of asymptomatic individuals with a diagnostic test that can confirm such infections will mean something much different than, say, numbers reported by a health authority doing only RT-PCR diagnostic testing on individuals presenting specific systems.  Thanks in advance for any responses.", "full_link": "https://www.reddit.com/r/COVID19/comments/fc1y47/is_there_a_source_showing_what_diagnostic_methods/", "created_utc": 1583102042}, {"id": "fc2eui", "title": "Take this advice with a \"grain of salt,\" but it might work. Salt coated masks appear to protect against and kill the virus. (Link to scientific research in text comments)", "selftext": "(I found this information on another site, might be useful)\n\n\"HOW TO CREATE A 100 % EFFECTIVE RESPIRATORY PROTECTION\"\n\n*Aerosolized pathogens are a leading cause of respiratory infection and transmission. Currently used protective measures pose potential risk of primary/secondary infection and transmission.*\n\n*Here, we report the development of a universal, reusable virus deactivation system by functionalization of the main fibrous filtration unit of surgical mask with sodium chloride salt. The salt coating on the fiber surface dissolves upon exposure to virus aerosols and recrystallizes during drying, destroying the pathogens. *\n\n*When tested with tightly sealed sides, salt-coated filters showed remarkably higher filtration efficiency than conventional mask filtration layer, and 100% survival rate was observed in mice infected with virus penetrated through salt-coated filters.*\n\n*Viruses captured on salt-coated filters exhibited rapid infectivity loss compared to gradual decrease on bare filters. Salt-coated filters proved highly effective in deactivating influenza viruses regardless of subtypes and following storage in harsh environmental conditions.*\n\n*Our results can be applied in obtaining a broad-spectrum, airborne pathogen prevention device in preparation for epidemic and pandemic of respiratory diseases.\nless than 50%.*\n\n**Recipe:**\n\n28% salt\n1 % anionic detergent (Tween20) etc\n71 % distilled water\n\nMIX thoroughly; soak the mask inside; dry it gently\n\nThis will turn the hydrophobic mask into a hydrophilic \"sponge\" with a salt-coating. The virus-laden droplets will stick on the salty fibres much better; the salt will be dissoved into the droplet; upon drying up, the recrystallization process destroys the viruses.\n\n- 100% effective\n- works best with masks with exhalation-valves \n\n[Universal and reusable virus deactivation system for respiratory protection](https://www.nature.com/articles/srep39956)", "full_link": "https://www.reddit.com/r/COVID19/comments/fc2eui/take_this_advice_with_a_grain_of_salt_but_it/", "created_utc": 1583103960}, {"id": "fc4hm1", "title": "Sacrificing containment will overwhelm medical systems, prioritizing containment will kill the economy. Is there no way out?", "selftext": "China looks to have levelled off, however factories are told to use electricity even if not producing as that is how the gov't is declaring production capacity returning. Currently reporting around 40%. The supply chain has been and still is in a massive hole from China the last 2 months, and now with the spread in other countries, company efficiency and consumer spending will fall and continue the supply chain disruption. Deaths were initially estimated around 2.3%, that number is rising to 3%+ but it's not even the deaths or # of infected, its the economic impact such as consumer spending and events getting cancelled, medical systems being overwhelmed and with China sucking up the supplies the world is in for a massive shortage. All of these factors trickling through such as unemployment to mortgage defaults, bankruptcies, etc will crash the global economy. Keep in mind that there is a lag from when this all flows through society.\n\nI honestly just don't think there are a lot of positives in this. I mean really, the ONLY escape from this imploding human society is warm weather in 2-3 months or an expedited vaccine. Containment isn't being taken seriously anywhere due to economic fallout. China lagged their efforts initially but played it fast and hard in catching up. Even now the numbers are probably being faked as to not spook the population back at work. However if we take them as an example, their medical system was overwhelmed BADLY and the WHO clearly stated they were more medically adaptive than any other country could be. Not to mention the containment measures they enacted which helped. Imo, we are objectively FUCKED. I'd love to hear otherwise though as I have yet to come across convincing opinions that doesn't result in a collapse.", "full_link": "https://www.reddit.com/r/COVID19/comments/fc4hm1/sacrificing_containment_will_overwhelm_medical/", "created_utc": 1583113185}, {"id": "fc5uff", "title": "Any idea of the risk to a young pregnant woman?", "selftext": "It's really hard to get straightforward answers from google. I'm a healthy 25yo and I'm 4 months pregnant with my first baby. The only health issue I have is that my midwife recently told me I'm slightly anemic with normal iron levels.\n\nAt this point, I've accepted that nothing can stop this virus and there's no way I would excommunicate my family if they got sick, so I just want to know what to expect.", "full_link": "https://www.reddit.com/r/COVID19/comments/fc5uff/any_idea_of_the_risk_to_a_young_pregnant_woman/", "created_utc": 1583119498}, {"id": "fc5yrd", "title": "Need a bit of advice, only rational sub.", "selftext": "The other covid subs are going crazy, and this isn't scientific, but I'd like y'all advice since people seem more rational here.\n\nBasically, dad just had heart attack.  mom has health issues, auto immune.  they are in mid 60s.  They are thinking of retiring  and isolating for a few months because they are pretty scared of catching this and complications, but they aren't really as sound as they could be.  They do have health issues though, recent heart attack etc.\n\nIt's not really my place, but I feel like they are overreacting a bit.  I told them to ask there health care professional, and I guess he wasn't informed and didn't say much.  I mean, will they even get this?  It's not that they couldn't retire, and it doesn't matter what I think really, I just don't want them to isolate and go crazy.  They could wait for a few months and maybe it would die down, but i'd feel awful if they did catch this and something happened, ofc no matter what.\n\nBlah, anyway, any advice would be appreciated.", "full_link": "https://www.reddit.com/r/COVID19/comments/fc5yrd/need_a_bit_of_advice_only_rational_sub/", "created_utc": 1583120075}, {"id": "fc8r4z", "title": "Community Spread", "selftext": "Wasn’t international community spread the last criteria the WHO said they needed evidence of to classify it as a Pandemic? And will they?", "full_link": "https://www.reddit.com/r/COVID19/comments/fc8r4z/community_spread/", "created_utc": 1583135409}, {"id": "fcdikh", "title": "Actual statistically-based studies on mask usage?", "selftext": "The efficacy of masks seems to be the most hostly debated issue right now. I am aware that much of the \"don't buy masks\" rhetoric boils down to a supply issue, but I've also heard a lot of \"they don't work if you don't follow the right protocols 100% and replace them every 20min/2hrs\", which seems wrong to me but IANAD. Curious if anyone can list actual epidemiological studies on this.\n\nMy background (anecdotal study, n=1): I've worn N95/R95 masks regularly to commute/work for the past 10 years. First, in Asia in dense traffic I wore R95 mostly to block VOCs/PM or whatever the diesel buses/trucks were spewing, in very hot/humid conditions while sweating profusely. I had a beard, and I reused the same mask usually for several weeks (until it got too nasty). I had a very clear ongoing daily \"fit test\" of \"can I smell the nasty shit in the air right now?\" - even after a couple weeks of use, the answer was that it blocked maybe 90-95% of the stink/PM. There was also the *massive* reducing in respiratory irritation I suffered after switching to the masks. This led me to believe that even without a perfect fit or whatever, the masks work pretty damn well.\n\nLater on I started doing construction work. The N95 dust masks are ubiquitous, and lots of guys wear them almost all day doing aerobic-ish exercise, myself included, hours a day, same mask reused for a week or two, with an even larger beard now. I can literally see the stuff in the air I'm using the mask to block, dust everywhere, and even with \"not following the rules\" it clearly blocks the vast majority of particles, with a severe reduction in the \"my lungs hurt\" thing after work. And yes, I can still breathe with the mask on.\n\nI get that \"it just takes one viral particle\", but in my experience the masks even when used improperly will block the vast majority of whatever it is in the air, and the vast majority of the airflow entering the mask will go through the filter rather than the gaps when fitted properly (by a layman, even bearded). I'm not sure if the masks getting humid from your breath will allow the viral particles to somehow worm through the damp filter and then get sucked in to your lungs? What exactly is the concern there?\n\nAlso I'm pretty sure they'll be far more effective at blocking viral particles being emitted from the wearer, which probably is more of a concern. But I can't say the number of times in life I've been in direct contact with someone clearly contagiously coughing (as opposed to nervously, ofc), and presto bango 2-3 days later I come down sick from whatever they were expelling into the air. I get that 99% of the time in public you're not going to be subjected to direct aerosols, but I'm also aware you're wearing the mask for that 1% of the time you're stuck next to someone on the train who should've stayed home and is filling the air around you with their disease.", "full_link": "https://www.reddit.com/r/COVID19/comments/fcdikh/actual_statisticallybased_studies_on_mask_usage/", "created_utc": 1583162287}, {"id": "fcf4r4", "title": "[question] Do we have any first hand accounts of the virus?", "selftext": "I'm admittedly super anxious and paranoid about the virus. I'm in nyc and everything I hear scares me more. I know it isn't productive. I have a 2 week old (thank god it seems more mild to them). I haven't stopped cloroxing and washing myself and everything in the house for a week. My 2 year old is running a fever with no other visible symptoms. Says he feels fine. My wife says I need to calm down and I know I'm wearing on her and logically whole heartedly agree but the pit in my stomach is just eating me up more and more. I've searched for any livestreams or first hand accounts of the virus with no luck. I know ABC had a guy on the ship checking in every night and he went from pretty decent to pretty bad over 5 days and he stayed in Japan while his wife came home and that's the last I heard fro. anyone who has it. I also saw an interview of a chinese chick downplaying it pretty heavily and while I'd like to believe her, I really don't believe anything coming out of China. I feel like accounts of the virus might be censored but I'm sure that it's just that we are recieving so much info right now that the search results are so convoluted that I'm not finding what I'm looking for. I know this sub is very much about numbers and facts and the bottom line but I think if I could see enough people with a cold and giving an honest account of it- it would really ease the toll this is taking on me and my family. I know I'm fucked up. I know that life has to go on but I'm scared to hit the grocery and hold my baby. I don't  know what I can do other than what I am doing. I'm at the point where Ive washed my hands so much that they are cracking and bleeding from it. I'm fucked.", "full_link": "https://www.reddit.com/r/COVID19/comments/fcf4r4/question_do_we_have_any_first_hand_accounts_of/", "created_utc": 1583168588}, {"id": "fcjba4", "title": "Weeky Questions Thread - 02.03-08.03.20", "selftext": "Due to popular demand, we hereby introduce the question sticky!\n\nPlease post questions about the science of this virus and disease here to collect them for others and clear up post space for research articles. We have decided to include a specific rule set for this thread to support answers to be informed and verifiable:\n\nSpeculation about medical treatments and questions about medical or travel advice will have to be removed and referred to official guidances as we do not and cannot guarantee (even with the rules set below) that all information in this thread is correct. \n\nWe require top level answers in this thread to be appropriately sourced using primarily peer-reviewed articles and government agency releases, both to be able to verify the postulated information, and to facilitate further reading. \n\nPlease only respond to questions that you are comfortable in answering without having to involve guessing or speculation. Answers that strongly misinterpret the quoted articles will be removed and upon repeated offences users will be muted for these threads.\n\nIf you have any suggestions or feedback, please send us a modmail, we highly appreciate it. \n\nPlease keep questions focused on the science. Stay curious!", "full_link": "https://www.reddit.com/r/COVID19/comments/fcjba4/weeky_questions_thread_0203080320/", "created_utc": 1583184403}, {"id": "fckysi", "title": "Do you believe there is significant evidence or a reasonable chance this will effect sperm production in men?", "selftext": "I know there was a preprint about this but what is the reasonable take or insight of experts on the effects of male fertility?", "full_link": "https://www.reddit.com/r/COVID19/comments/fckysi/do_you_believe_there_is_significant_evidence_or_a/", "created_utc": 1583190811}, {"id": "fcl9ln", "title": "Hello, r/COVID19, I'd like to offer my services as a translator for articles that are in French or Swedish.", "selftext": "I can give accurate translations to English, so tha nothing will get mixed up, I understand both languages, and I know some articles are stuck between other languages. I recommend other speakers of foreign languages to try to translate articles written in your language.\n\nAlthough I read my news in French, I dont check other news languages, so if people post links to Swedish or French articles, or you find a link to a French or Swedish article, post it here so I can translate it for you, thanks!", "full_link": "https://www.reddit.com/r/COVID19/comments/fcl9ln/hello_rcovid19_id_like_to_offer_my_services_as_a/", "created_utc": 1583192041}, {"id": "fcnbtw", "title": "I have reason to believe that this will turn into a human apocalypse", "selftext": "That’s all", "full_link": "https://www.reddit.com/r/COVID19/comments/fcnbtw/i_have_reason_to_believe_that_this_will_turn_into/", "created_utc": 1583201001}, {"id": "fcny3w", "title": "Coronavirus patient being treated in my town", "selftext": "There has to have been local spread by the time they verified them. What can I do to prevent the spread in my home? How can I treat my family? How will I know if it’s coronavirus vs flu? How do I know when to take someone to the hospital?\n\n\nSorry for all these questions but I’m feeling very anxious and stressed for my family they refused to listen to me now we don’t have many resources available maybe a week of food max no water. It’s like talking to a brick wall they either joke about it or deny it I just don’t even know what to do I’m scared. \n\nSorry if this isn’t the correct place for these types of questions", "full_link": "https://www.reddit.com/r/COVID19/comments/fcny3w/coronavirus_patient_being_treated_in_my_town/", "created_utc": 1583203805}, {"id": "fcpynq", "title": "People Worldwide are in Panic Mode rushes to stores to Prepare for Outbreak", "selftext": "This video shows how tragic the Happenings inside Hongkong and also reported on BBC.\n\nThis man struggles to protect his daughter from police beatings in Hong Kong as his face is soaked in pepper spray.\n\nPolice thought that these people are extreme protester.\n\nWhat do you think about\nThis? You will be the Judge!", "full_link": "https://www.reddit.com/r/COVID19/comments/fcpynq/people_worldwide_are_in_panic_mode_rushes_to/", "created_utc": 1583213707}, {"id": "fculg3", "title": "Will \"Vicks First Defence Micro-Gel Nasal Spray\" work on Covid19?", "selftext": "This stuff.\n\nhttps://www.vicks.co.uk/en-gb/shop-products/vicks-cold-prevention-products/vicks-first-defence-nasal-spray", "full_link": "https://www.reddit.com/r/COVID19/comments/fculg3/will_vicks_first_defence_microgel_nasal_spray/", "created_utc": 1583242297}, {"id": "fcw4pq", "title": "Worldwide Epidemic Panic causes People to Rush in Stores to Prepare for the coming Outbreak. People are Freaking out all over the World.", "selftext": "This video shows how tragic the Happenings inside Hongkong and also reported on BBC.\n\nThis man struggles to protect his daughter from police beatings in Hong Kong as his face is soaked in pepper spray.\n\nPolice thought that these people are extreme protester.\n\nWhat do you think about\nThis? You will be the Judge!\n\nLink is in the Comment - just watch it", "full_link": "https://www.reddit.com/r/COVID19/comments/fcw4pq/worldwide_epidemic_panic_causes_people_to_rush_in/", "created_utc": 1583249129}, {"id": "fd59h2", "title": "A compilation of possible long term effects for Covid-19 survivors", "selftext": "Here is a list of possible long term effects from a Covid-19 (SARS-CoV-2) infection and a possible link to another already known human Coronavirus, which, allthough being a different family (Alphacoronavirus), shares the same mechanism as SARS or SARS2: the ACE-2 receptor. So, here is the list!\n\n- [Testis and kidneys damage](https://www.medrxiv.org/content/10.1101/2020.02.12.20022418v1)\n- [Pulmonary fibrosis](https://www.medrxiv.org/content/10.1101/2020.02.18.20024539v2)\n- [Schizophrenia](http://www.chinaxiv.org/abs/202003.00003)\n- [Heart injuries](https://www.medrxiv.org/content/10.1101/2020.02.26.20028589v1)\n- [Gastrointestinal infection](https://www.medrxiv.org/content/10.1101/2020.02.17.20023721v1)\n- [Neuroinvasive behavior (thalamus and brain stem)](https://onlinelibrary.wiley.com/doi/abs/10.1002/jmv.25728)\n- [Liver damage](https://www.medrxiv.org/content/10.1101/2020.02.26.20026971v2)\n- [Acute cerebrovascular disease](https://www.medrxiv.org/content/10.1101/2020.02.22.20026500v1)\n- [Thrombophilia (hypercoagulability)](https://www.medrxiv.org/content/10.1101/2020.02.27.20027557v1)\n- [Weight loss (during infection)](https://www.biorxiv.org/content/10.1101/2020.02.07.939389v3)\n\n&amp;#x200B;\n\nThings to think about: \n\nThe schizophrenia might be linked to the thalamus and brain stem infection, where the virus acts like a \"component cause\" much like the link between THC and schizophrenia; see [https://link.springer.com/article/10.1007%2Fs00406-009-0024-2](https://link.springer.com/article/10.1007%2Fs00406-009-0024-2)\n\nAsymptomatic carriers, altered state of mind, gastrointestinal infection and a variety of lung deseases can also be observed with another human coronavirus: HCoV-NL63, [which is the only known Alphacoronavirus which also shares ACE-2 as entry](https://the-eye.eu/public/Papers/CoronaVirusPapers/2005%20Human%20coronavirus%20NL63%20employs%20the%20severe%20acute%20respiratory%20syndrome%20coronavirus%20receptor%20for%20cellular%20entry.pdf)\n\n- [Asthma](https://the-eye.eu/public/Papers/CoronaVirusPapers/2007%20Coronavirus%20NL63%20Illnesses%20in%20Infancy%20are%20a%20Risk%20Factor%20for%20Asthma%20at%20Age%20Six.pdf)\n- [Croup](https://the-eye.eu/public/Papers/CoronaVirusPapers/2010%20Role%20of%20Human%20Coronavirus%20NL63%20in%20Hospitalized%20Children%20With%20Croup.pdf)\n- [Asymptomatic Carrier / acute gas­troenteritis](https://the-eye.eu/public/Papers/CoronaVirusPapers/2011%20Human%20coronavirus%20NL63_%20a%20clinically%20important%20virus_.pdf)\n- [Altered mental status](https://the-eye.eu/public/Papers/CoronaVirusPapers/2018%20Severe%20Respiratory%20Illness%20Outbreak%20Associated%20with%20Human%20Coronavirus%20NL63%20in%20a%20Long-Term%20Care%20Facility.pdf)\n- [Adult respiratory syndrome (ARDS)](https://the-eye.eu/public/Papers/CoronaVirusPapers/2016%20Coronavirus%20NL63-induced%20Adult%20Respiratory%20Distress%20Syndrome.pdf)\n\nThe Mouse Hepatitis Virus (MHV, another Coronavirus) infects [Brainstem causing cytokin storm](https://the-eye.eu/public/Papers/CoronaVirusPapers/2018%20Fine%20Tuning%20the%20Cytokine%20Storm%20by%20IFN%20and%20IL-10%20Following%20Neurotropic%20Coronavirus%20Encephalomyelitis.pdf)\n\n&amp;#x200B;\n\nThere is quite a lot to be alarmed about, especially the link to mental illness, the loss of fertility or kidney or liver damage is something. The true devastating result of this outbreak is yet to come and will be observed within the next years.", "full_link": "https://www.reddit.com/r/COVID19/comments/fd59h2/a_compilation_of_possible_long_term_effects_for/", "created_utc": 1583285190}, {"id": "fd8692", "title": "How could we responsibly use GPS data (voluntarily of course) to help people know if they have crossed paths with infected persons?", "selftext": "Seems like people who test positive might be willing to share their GPS tracks over the course of a few weeks so that others can cross-reference their own movements. Might help with containment.", "full_link": "https://www.reddit.com/r/COVID19/comments/fd8692/how_could_we_responsibly_use_gps_data_voluntarily/", "created_utc": 1583298886}, {"id": "fdlmvk", "title": "Should I inform someone?", "selftext": "I recently traveled internationally to brazil. I came back about 1 week ago. Our returning flight São Paulo to Chicago had a flight that was from shanghai before ours. A couple days after, me and my girlfriend got sick. Started with coughing, then fever, chills, chest congestion etc. we’re doing a bit better now, but I’m still coughing like a maniac. I went to the doctor, let them know that I traveled internationally and had the same exact symptoms as covid-19. They took me in, 0 precautions whatsoever, didn’t even ask me to wear a mask, and told me it was probably just the regular flu because there were 0 cases in my state. Took a chest X-ray, and sent me on my way. Is this not... irresponsible? I feel like there should have been more precaution taking place IF I did have covid... should I inform someone else?", "full_link": "https://www.reddit.com/r/COVID19/comments/fdlmvk/should_i_inform_someone/", "created_utc": 1583363348}, {"id": "fdz57c", "title": "Will warmer temperatures have any positive effect?", "selftext": "I am not a virologist. We often think of the flu season as the winter because people are cooped up indoors and spreading germs. Does anyone believe that as the weather warms up for the northern hemisphere, the virus will be transmitted less or perhaps die out the same way the seasonal flu is less of a concern during warmer months?", "full_link": "https://www.reddit.com/r/COVID19/comments/fdz57c/will_warmer_temperatures_have_any_positive_effect/", "created_utc": 1583431092}, {"id": "fdzw9m", "title": "Why aren't tech companies stepping up to use user tracking data?", "selftext": "Google, Facebook, Apple, or any other tech company that tracks user movement could easily be stepping up and alerting people who have crossed paths with a potentially infected person.    Once a person has been confirmed infected, that person could easily approve the release of their tracking data to be used to notify users who they have crossed paths with. \n\n&amp;#x200B;\n\nWhat legal problems exist that are shutting a solution like this down?", "full_link": "https://www.reddit.com/r/COVID19/comments/fdzw9m/why_arent_tech_companies_stepping_up_to_use_user/", "created_utc": 1583434021}, {"id": "fe8sk9", "title": "Any groups that crowdsource research paper links all into one place?", "selftext": "I have yet to find a centralized source. Anyone out there compiling all known links into an open Google doc or something and having users able to remove duplicates in English and multiple languages?", "full_link": "https://www.reddit.com/r/COVID19/comments/fe8sk9/any_groups_that_crowdsource_research_paper_links/", "created_utc": 1583472306}, {"id": "fe9l7i", "title": "Can Folding@home help?", "selftext": "First I should say that I work in technology, not medicine. \n\nThe Stanford Folding@home project is focusing their distributed computing power against coronavirus. I’m wondering if this effort can materially help scientists in the near-term.  Is it just a question of resources? \n\nI’m asking because as a technology expert, I know there are vast untapped computational resources that could be applied to this problem if people were motivated to do so. Governments could instruct citizens, corporations, and especially cloud service providers to participate by installing the FAH client, vastly increasing the performance of the FAH network.", "full_link": "https://www.reddit.com/r/COVID19/comments/fe9l7i/can_foldinghome_help/", "created_utc": 1583476879}, {"id": "fecp6m", "title": "Will politicizing Coronavirus Covid19 increase the risk of spread &amp;/or deaths? Politicians STOP looking back to blame! Look at now &amp; ahead for a cure!", "selftext": "Facts on the science, not pointing fingers to get votes.  Please...", "full_link": "https://www.reddit.com/r/COVID19/comments/fecp6m/will_politicizing_coronavirus_covid19_increase/", "created_utc": 1583497269}, {"id": "fedacj", "title": "Oldish but in a risk category. If have groceries delivered what shoud I do to ensure they are safe?", "selftext": "I'm in my later 50s but have really bad asthma so if I get this it will probably not be a few sniffles.  (When things hit my lungs it hits freaking hard).  So I am working from home and minimizing contact with others.  As far as food goes... even if it is delivered or I do a drive by pickup what do I need to do to make sure the bags or cans aren't contaminated?", "full_link": "https://www.reddit.com/r/COVID19/comments/fedacj/oldish_but_in_a_risk_category_if_have_groceries/", "created_utc": 1583500412}, {"id": "fednga", "title": "Travelling to Eastern Europe at the end of March - what is the likelihood that our trip will be cancelled?", "selftext": "I'm planning to go from Ireland to Poland for a weekend at the end of March...", "full_link": "https://www.reddit.com/r/COVID19/comments/fednga/travelling_to_eastern_europe_at_the_end_of_march/", "created_utc": 1583502235}, {"id": "feexly", "title": "Chinese National Health Commission reported a spike in Influenza cases in December", "selftext": " [https://medium.com/@sesrenaconference/chinas-coronavirus-numbers-are-suspicious-68d4e2b6be6d](https://medium.com/@sesrenaconference/chinas-coronavirus-numbers-are-suspicious-68d4e2b6be6d) \n\nFrom this post:\n\n\"According to the reports of the National Health Commission, the total incidence of infectious disease was 670,999 in November. This number leapt to more than 1.71 *million* in December. That is to say, December’s reported incidence of infectious disease is roughly a million cases over the previous month’s numbers and ... *roughly a million cases over the monthly average* *across the previous three years*.\" \n\n\"... out of the 1.71 million cases of infectious disease reported in December, an unprecedented 1.2 million were diagnosed as cases of influenza\"", "full_link": "https://www.reddit.com/r/COVID19/comments/feexly/chinese_national_health_commission_reported_a/", "created_utc": 1583508100}, {"id": "fefa2b", "title": "Coronavirus during summer", "selftext": "Is it true that coronavirus will stop spreading in countries with high temperature ?", "full_link": "https://www.reddit.com/r/COVID19/comments/fefa2b/coronavirus_during_summer/", "created_utc": 1583509566}, {"id": "fekkkc", "title": "CFR estimates don't take outcome latency into account? Won't that undercount the CFR?", "selftext": "The 2.3% and later 3.4% numbers seem to be the ratio of deaths/confirmed cases.  However deaths tend to occur after diagnosis, so the true death counts will lag confirmed cases by days to weeks.  This would imply that the ratio of current deaths to current confirmed cases, under-represents the actual CFR, once you allow for the recently diagnosed to resolve.  Is that not true?\n\nI tried to model the latency here: [https://imgur.com/a/gVh0uml](https://imgur.com/a/gVh0uml)\n\nSteps:\n\n* Represent the death and recovered event probability vs days-after-diagnosis as a normal distribution\n* Integrate the normal distributions to get a Cumulative Density Function, which now represents the probability of being dead or recovered as a function of days-after-diagnosis\n* Apply the CDF separately to each population of confirmed cases per-day\n* Sum the outcomes of each daily population to get the total death/recovered outcomes per-day\n* Use least squares to estimate the sigma and mean of the normal distribution, such that the daily predicted totals match the actual totals\n\nData:\n\n* John's Hopkins dataset:  [Novel Coronavirus (COVID-19) Cases - Humanitarian Data Exchange](https://data.humdata.org/dataset/novel-coronavirus-2019-ncov-cases) \n\nCode:\n\n*  [https://gist.github.com/ctung/b31726c64e55b7ce48887f98b52c6acf](https://gist.github.com/ctung/b31726c64e55b7ce48887f98b52c6acf) \n\nCaveats:\n\n* This model does not factor in age, location, pre-existing co-morbidities, etc, so it will not be useful for predicting individual outcomes\n* Changes in the length of time to complete a diagnosis will skew the end results.\n* This models deaths vs confirmed cases (CFR).  This does not attempt to model deaths vs infections (IFR).\n* Outcomes may not be normal (eg different countries will have different mean and amplitude), which could lead to a profile with multiple peaks.\n\nConclusions from the model (which may or may not be true)\n\n* The CFR has to be around 4% to accurately explain the death count profile. \n* The mean date for death is 7 days after diagnosis  ( I have read the actual is 14?)\n* Some small percentage of the confirmed cases are determined post-mortem?\n* recovery takes on average 21 days after diagnosis\n\nIs there anything wrong with this analysis approach?", "full_link": "https://www.reddit.com/r/COVID19/comments/fekkkc/cfr_estimates_dont_take_outcome_latency_into/", "created_utc": 1583530157}, {"id": "felh4q", "title": "\"At least 1 year. We're optimistically at least 1 year from a vaccine,\" says Dr. John Torres, medical correspondent for NBC News, and Dr. Joseph Fair, a virologist, epidemiologist and global outbreak responder.", "selftext": "Source: [Virus Engine](https://virusengine.com/post/professional-opinions)\n\n**Full response:**\n\n&gt; *\"At least 1 year. We're optimistically at least 1 year from a vaccine. We will presumably see a drop in cases in the summer. And even if there is a dip in cases in the summer, the southern hemisphere will be entering its cold and flu season.\"*", "full_link": "https://www.reddit.com/r/COVID19/comments/felh4q/at_least_1_year_were_optimistically_at_least_1/", "created_utc": 1583533775}, {"id": "felwwr", "title": "Asthma", "selftext": "I'm 21 and have asthma on the mild end of the spectrum, only have symptoms with a lot of cardio or with colds, get the odd mucass disturbing my left lung but i take antihistamines to prevent it. How vulnerable am i?", "full_link": "https://www.reddit.com/r/COVID19/comments/felwwr/asthma/", "created_utc": 1583535571}, {"id": "fep23k", "title": "There has been an article floating around that suggests that the coronavirus is less deadly than the flu. Can we please fact-check it? (Article provided)", "selftext": "\nhttps://www.google.com/amp/s/www.westernjournal.com/numbers-show-coronavirus-appears-far-less-deadly-flu-govt-media-keep-promoting-panic/amp/", "full_link": "https://www.reddit.com/r/COVID19/comments/fep23k/there_has_been_an_article_floating_around_that/", "created_utc": 1583550050}, {"id": "fepg94", "title": "Hypochondria and Covid-19", "selftext": "I started developing a sore throat and runny nose last night. This morning I woke up and could barely go back to sleep due to my throat being sore. Throughout the day I've been developing a painful dry cough. I work in a warehouse so my chances of getting Covid-19 is probably a little higher. Covid-19 was also reported in two counties 30 minutes away from me. Im pretty sure it's just a common cold but that's the thing with this new virus, you can't tell and there's no way of truly knowing. Even the tests are inaccurate as hell. And people keep getting sick at my job. I think the government is grossly under reporting and covering up how much it's spreading in the US and can't help to think that it's already everywhere.", "full_link": "https://www.reddit.com/r/COVID19/comments/fepg94/hypochondria_and_covid19/", "created_utc": 1583551989}, {"id": "fepwv8", "title": "If you forget ethics and go from small-group safety trials directly to large-group human effectiveness trials, how fast could a vaccine be ready in volume?", "selftext": "Most of the process of vaccine development appears to be optional in an emergency and is not strictly necessary to develop a safe and effective vaccine.\n\nIf we went ahead and just did small-scale safety trials, then jumping directly to a large trial of volunteers who will be experimentally exposed to the virus, how quickly could a vaccine be available in volume?", "full_link": "https://www.reddit.com/r/COVID19/comments/fepwv8/if_you_forget_ethics_and_go_from_smallgroup/", "created_utc": 1583554395}, {"id": "fexcxt", "title": "Need help verifying info in covid-19 chain message", "selftext": "so recently i've been seeing this chain message going around, it goes like this:\n\n#--begin quote--\n\n溫馨提示：\n\nDoctor's advice about coronavirus:\n醫生關於新型冠狀病毒的建議：\n\n1. It is pretty large in size (cell is about 400-500nm diameter), so any normal mask (not just the N95 feature) should be able to filter it out. \nHowever, when someone who's infected sneezes in front of you, it will take a great 3 meters (about 10 feet) before it drops to the ground and is no longer airborne. \n1. 病毒細胞直徑大約400-500納米，任何正常口罩（不一定是N95類型）都可以將病毒細胞過濾出去。當感染者在你面前打噴嚏，病毒細胞會經過橫向距離為3米的拋物線落在地上，之後才會不經過空氣傳播。\n\n2. When the virus drops on metal surface, it will live for at least 12 hours. So remember if you come in contact with any metal surface, wash your hands with soap thoroughly. \n2. 當病毒細胞落在金屬表面後會存活12個小時。所以如果你觸碰了金屬表面的話，請記得認真用肥皂或者洗手液洗手。\n\n3. The virus can remain active on fabric for 6-12 hours. Normal laundry detergent should kill the virus. For winter clothing that does not require daily washing, you can put it out under the sun to kill the virus. \n3. 病毒在布料上可以存活6到12個小時。普通的洗衣液即可殺死病毒。如果是在衣物無需每天清洗的冬天，將衣服放在太陽下曬一曬可以有助於殺死病毒。\n\nAbout the symptoms of the pneumonia caused by Coronavirus:\n以下是新型冠狀病毒肺炎的癥狀：\n\n1. It will first infect the throat, so the throat will have the dry sore throat feeling which will last for 3 to 4 days\n1. 一開始病毒會感染喉嚨，喉嚨會覺得很乾，這種感覺大約持續3-4天。\n\n2. Then the virus will blend into the nasal fluid and drips into the trachea and enter the lungs, causing pneumonia. This process will take 5 to 6 days.    \n2. 然後病毒會侵入鼻液，再流入氣管，最後進入肺部導致肺炎。這個過程大約持續5-6天。\n\n3. With pneumonia, comes high fever and difficulty in breathing. The nasal congestion is not like the normal kind. You will feel like you are drowning in water. It's important to go seek immediate medical attention if you feel like this. \n3. 這個肺炎的表現是高燒和呼吸困難。鼻腔堵塞的感覺跟普通感冒不太一樣，你會覺得有一種溺水無法呼吸的感覺。如果發生這種狀況的話請及時就醫。\n\nAbout prevention:\n關於預防：\n\n1. The most common way of getting infected is by touching things in public, so you must wash your hands frequently. The virus can only live on your hands for 5-10 mins, but a lot can happen in those 5-10 mins (you can rub your eyes or pick your nose unwittingly).\n1. 通常最有可能感染的方式是在公共場合觸摸了帶有病毒的物體，所以記得勤洗手。病毒在你手上只會存活5-10分鐘，不過即使是短短的5-10分鐘，也要十分警惕（不要用手揉眼睛或者不自覺地摳鼻子😄）\n\n2. Aside from washing your hands frequently, you can gargle with Betadine Sore Throat Gargle to eliminate or minimize the germs while they are still in your throat (before dripping down to your lungs). \n3. 除了勤洗手之外，還可以用漱口水漱口，這樣可以殺死或者減少存留在喉嚨裏的病菌，防止起落入肺部引起肺炎。\n\nTake extra care and drink plenty of water.\n請一定多加小心，記得多喝水。\nPlease copy, paste and repost.\n請複製，粘貼，並轉發。\n\n#--end quote--\n\ncan anyone help me verify the statements here?\n\nmuch thanks in advance.", "full_link": "https://www.reddit.com/r/COVID19/comments/fexcxt/need_help_verifying_info_in_covid19_chain_message/", "created_utc": 1583598225}, {"id": "feynz9", "title": "CoronaVirus Map", "selftext": "I make this android app for everyone who is interesting in new state of infected cases.\n\nThe app is free and have no ads. Enjoy.\n\n  \n\n\nhttps://play.google.com/store/apps/details?id=com.github.bobekos.coronavirustracker", "full_link": "https://www.reddit.com/r/COVID19/comments/feynz9/coronavirus_map/", "created_utc": 1583603677}, {"id": "fezcju", "title": "Q- Has Anyone looked into low NaCl, Hypotension, and correlation to Resistance or Reduced Infection?", "selftext": "If we think the S is bonding through ACE2 receptors\nAnd if those receptors were less available due to higher quantities of ACE2 through elevated renin activity\nCould those facing potential exposure potentially reduce their chances of infection through functionally lowering their blood pressure?\nAnd how could they do that safely?\n\n(This question is just based on the renin-angiotensin system and is a request for more educated/qualified information NOT a speculated conclusion.)", "full_link": "https://www.reddit.com/r/COVID19/comments/fezcju/q_has_anyone_looked_into_low_nacl_hypotension_and/", "created_utc": 1583606402}, {"id": "ff3pdt", "title": "Asymptomatic infections ?", "selftext": "So at this point all the information points to the fact that more than 50% of the infections are asymptomatic or don't show any worrying symptoms.\n\nDoes this mean that these people will just get rid of the virus after a while without any particular treatment, somewhat like a mild flu ?", "full_link": "https://www.reddit.com/r/COVID19/comments/ff3pdt/asymptomatic_infections/", "created_utc": 1583624215}, {"id": "ff4vai", "title": "Is Covid-19 the new chicken pox?", "selftext": "I was born before there was a vaccine for chicken pox. When I caught it, I remember my mother telling me it was good that I was a child, because it was so dangerous for adults. \n\nCovid-19 seems to be falling along these lines. \n\nAre we looking at a great culling of the elderly population and post-infection immunity of todays youth? \n\nIf this disease becomes endemic, will it become what chicken pox used to be?", "full_link": "https://www.reddit.com/r/COVID19/comments/ff4vai/is_covid19_the_new_chicken_pox/", "created_utc": 1583629488}, {"id": "ff87xx", "title": "For goofs let’s say someone owns a sauna ...", "selftext": "...they strip down after a grocery run and hop in the Sauna.  Will 5 minutes in those high temps be enough to bitch slap ol Coronolus back to the micro world?", "full_link": "https://www.reddit.com/r/COVID19/comments/ff87xx/for_goofs_lets_say_someone_owns_a_sauna/", "created_utc": 1583645853}, {"id": "ff8h7d", "title": "There’s been a lot of talk about existing drugs that may help treat/make symptoms less severe overall. Do we know when those will have been studied enough/be available for use should they be viable?", "selftext": "I have seen posted snippets of several such drugs, the most commonly posted being [remdesivir](https://www.scientificamerican.com/article/a-promising-antiviral-is-being-tested-for-the-coronavirus-but-results-are-not-yet-out/). I’ve also heard that some may be easier to mass produce than others, but most of this is Reddit hearsay and I do apologize for that. Thank you for reading.", "full_link": "https://www.reddit.com/r/COVID19/comments/ff8h7d/theres_been_a_lot_of_talk_about_existing_drugs/", "created_utc": 1583647323}, {"id": "ff9t9l", "title": "Public Paranoia: An Open Letter", "selftext": "An open letter to all the Corona-Conscious,\n\nI’ve recently (now seemingly luckily) become self-employed working out of home. My previous employment was a small sized company with a giant cess pool of illness-spreading employees. Having been given no official “sick time” just PTO (general Paid Time Off) they would constant work sick and regularly spread whatever virus throughout the office as common practice. As someone who rarely gets sick, I found myself catching more and more colds/infections as time went on. The pure lack of consideration and stupidity of it all was sickening in itself.\n\nSo now here I am, with only family and I in close quarters. I’ve limited my outings in the past couple weeks due mostly to hunkering down on completing projects for work and growing concerns of the virus (to a lesser extent); until today. \n\nI’ve ventured out to a social dinner/theater in support of a close family member who has spent weeks directing and coordinating the event. Having sat with some close family members and a handful of random people at a round table, the predictable small-talk ensued; including weather, daylight-savings, and Coronavirus. The pure ignorance of the general public in regards to the virus is astounding. Having come to light for myself today after reading/studying the virus’s impact for over 2 months now, it is more than unsettling.\n\nThis is where paranoia set in.\n\nClosely watching social interactions, several people coughing and sneezing all over, close talking, no seeming consideration for anyone or anything. Buffet style, over a 100 people touching doors, chairs, tables; using the same tongs and grabbing food with their hands, then just eating without washing prior... \n\nAnxiety sets in and all self-conscious questionings ensue... My utensils, glass, plates... who has touched them... are they clean? What if one single person in this room is indeed infected, how many more could this spread to just from this event, then how many from here on out exponentially?!\n\nPure.  Fucking.  Anxiety.\n\nHave I just become a vigilant germaphobe or am I just paranoid? Right now, in the US, we may not have a definite answer, but I believe I will not be going out socially again (to this degree) until all of this has passed; at least for my own sanity and piece of mind.\n\nStay vigilant, have social consideration, and practice regular cleanliness and hygiene. Godspeed and good health to all of you... for in time, this all will pass.\n\n\nSincerely,\n\nConcerned Citizen (Pre_paired1)", "full_link": "https://www.reddit.com/r/COVID19/comments/ff9t9l/public_paranoia_an_open_letter/", "created_utc": 1583656109}, {"id": "ffa94o", "title": "How can it really spread from one to another?", "selftext": "As far as i have gathered, Covid-19 isn't airborne but is carried via water droplets when users cough or sneeze - is this correct?  \n\n\nTherefore the virus stays in the air for a while and drops on to surfaces....   \n\n\nIf this is true then I assume that the virus can be mainly transferred only through   \n1. When someone coughs directly at you or around you, and during that time the droplets are still in the air, you inhale some of that...   \n\n\n2. When you touch a surface , picking up the virus, and then touching your face  \n\n\nAny other means of catching this?  \n\n\nA. like if someone infected prepares your food, and gets your food contaminated, but you ingest it - will you get the virus form ingestion or just inhaling (if virus gets in your lungs)? Coz i saw some tips of drinking water a lot and keeping your throat moist - im trying to understand the logic - if virus gets in your mouth but goes directly to your stomach, acids will kill it?   \n\n\nB. When they say you can get infected when TOuCHING YOUR FACE, what part really? when you touch your cheeks? rub your eyes? or your mouth?   \n\n\nC. can the virus survive on your hair? coz a lot of people are washing their hands properly now but many subconsciously can't touch or scratch their hair (re-contaminating your hands) ..  \n\n\n  \nThere are lots of tips but I am trying to understand the physics behind the transmissions", "full_link": "https://www.reddit.com/r/COVID19/comments/ffa94o/how_can_it_really_spread_from_one_to_another/", "created_utc": 1583659275}, {"id": "ffb7fs", "title": "Fast food restaurants are a transmission nightmare because of touch screens.", "selftext": "Perhaps they should be disabled until things calm down a bit and people can go back to ordering from the till, or have most restaurants gotten rid of the till ordering points and so this is impossible? \n\n\nSeems that touching a screen multiple times that others have touched, with no guarantee they’ve washed their hands, and then touching your food after, really isn’t the best way to go to minimise transmission. Possibly antiseptic cleaning lotion should be made available at the food pick-up points?\n\n\nI don’t use these places regularly but it will be cashier order and take away from now on.", "full_link": "https://www.reddit.com/r/COVID19/comments/ffb7fs/fast_food_restaurants_are_a_transmission/", "created_utc": 1583666000}, {"id": "fgll8k", "title": "Questions Thread - 10.03.2020", "selftext": "Please post questions about the science of this virus and disease here to collect them for others and clear up post space for research articles. We have decided to include a specific rule set for this thread to support answers to be informed and verifiable:\n\n**Speculation about medical treatments and questions about medical or travel advice will have to be removed and referred to official guidances as we do not and cannot guarantee** (even with the rules set below) that all information in this thread is correct.\n\nWe ask for top level answers in this thread to be appropriately sourced using primarily peer-reviewed articles and government agency releases, both to be able to verify the postulated information, and to facilitate further reading.\n\nPlease only respond to questions that you are comfortable in answering without having to involve guessing or speculation. Answers that strongly misinterpret the quoted articles will be removed and upon repeated offences users will be muted for these threads.\n\nIf you have any suggestions or feedback, please send us a modmail, we highly appreciate it.\n\nPlease keep questions focused on the science. Stay curious!", "full_link": "https://www.reddit.com/r/COVID19/comments/fgll8k/questions_thread_10032020/", "created_utc": 1583876253}]