[{"created_utc": 1576018110, "full_link": "https://www.reddit.com/r/illinois/comments/e8y56m/have_you_seen_a_winged_humanoid_huge_batwinged/", "id": "e8y56m", "is_self": true, "score": 1, "selftext": "Have you seen a winged humanoid / huge bat-winged entity? Serious inquiry.\n\nHave you had a sighting of a winged humanoid or huge bat-like creature in Chicagoland, as well as Illinois, Wisconsin or Indiana? The entity has also been referred to as the 'Chicago Mothman' &amp; 'Chicago Man-Bat.' The average description is of a dark winged human-sized entity. Some have been said to have bright red eyes. The sightings have been documented and posted on an interactive map at [http://bit.ly/2qDMxFq](http://bit.ly/2qDMxFq) and chronicled at [http://bit.ly/2RAho0O](http://bit.ly/2RAho0O) \\- Please feel free to contact me at [lonstrickler@phantomsandmonsters.com](mailto:lonstrickler@phantomsandmonsters.com) \\- your anonymity is guaranteed. Our investigative group is conducting a serious examination of his phenomenon. We are merely seeking the truth and wish to determine what eyewitnesses have been encountering. Your cooperation is truly appreciated. You can call me directly at 410-241-5974 as well. Thanks...Lon Strickler", "title": "Have you seen a winged humanoid / huge bat-winged entity? Serious inquiry."}, {"created_utc": 1576930951, "full_link": "https://www.reddit.com/r/illinois/comments/edpcap/final_repost_for_research_respondentsyou_all_have/", "id": "edpcap", "is_self": true, "score": 1, "selftext": "**Update: Need 200 more respondents to finalize this survey with hopefully 50 people or more providing follow-up email addresses**\n\n**Update: About 2/5 of the way there! Everyone is really coming through. Please keep sharing it or taking if you haven't already**\n\n**Update: I'm really starting to get responses and am about 1/5 of the way to my target goal. Any help with this would be great and hopefully, provide a platform to increase research on cannabis!**\n\nMy name is Kyle Miller and I am a doctoral student at Southern Illinois University. I am researching behaviors associated with cannabis and alcohol usage among adults living in the United States. Below is a link for an anonymous survey that asks about your use of these substances as well as beliefs about them. It will take 10-15 minutes to complete this survey. It is completely voluntary and all responses will be kept in a password-protected account. If you are interested in participating in this study, follow the link and carefully read the “Informed Consent” page before proceeding.\n\n[Cannabis Survey](https://www.surveymonkey.com/r/5KNMR9K)\n\nIf you have any questions about the study, please email me at [kyle.miller@siu.edu](mailto:kyle.miller@siu.edu) or Dr. Justin McDaniel, Associate professor (p: (618) 453-1866, e: [jtmcd@siu.edu](mailto:jtmcd@siu.edu)).\n\nThis project has been reviewed and approved by the SIUC Human Subjects Committee. Questions concerning your rights as a participant in this research may be addressed to the Committee Chairperson, Office of Research Compliance, Southern Illinois University, Carbondale, IL 62901-4709. Phone (618) 453-4534. E-mail: [siuhsc@siu.edu](mailto:siuhsc@siu.edu)", "title": "Final repost for research respondents-You all have been great with suggestions for this survey and when I have the initial findings I will share them!"}, {"created_utc": 1577344937, "full_link": "https://www.reddit.com/r/illinois/comments/efsg9q/how_easy_is_it_to_get_a_medical_marajuana_card/", "id": "efsg9q", "is_self": true, "score": 1, "selftext": "Hi, after jan 1st how easy is it will it be to obtain a medical marajuana card since the list of qualifying conditions have increased? Will it be like in California where you just skype a doctor for a few minutes to get a MMJ card or is it a more lengthy process? Also, anyone have any good recommendations for marajuana doctors/nurses?  \n\n\nThanks!", "title": "How easy is it to get a medical marajuana card?"}, {"created_utc": 1577488125, "full_link": "https://www.reddit.com/r/illinois/comments/egihf1/how_can_we_make_it_harder_for_people_to_leave/", "id": "egihf1", "is_self": true, "score": 1, "selftext": "Too many people are leaving and that is just going to hurt us. The only way to survive is to try to keep people here. Is there a way to make it harder for people to leave? Can we pass something to keep people from being able to easily move? It's getting to the point where we need to be a little tougher. If we can make them stay, eventually they may come around to supporting the state. We are all in this together and the best way to save the state is to make people stay.\n\nMaybe raise taxes on those who want to leave the state? By a lot? Have some sort of pay penalty if they try to move?", "title": "How can we make it harder for people to leave Illinois?"}, {"created_utc": 1577488276, "full_link": "https://www.reddit.com/r/illinois/comments/egiijl/starved_rock_and_matthiessen_state_park_in_the/", "id": "egiijl", "is_self": true, "score": 1, "selftext": "We are thinking of hitting up Starved Rock and Matthiessen state parks this weekend. How are the winter trail conditions over there? We have hiked at Starved Rock before in the summer but have no idea about the current conditions. The parks website indicates some trail closures but I could not find any more information.\n\nAnyone have any more info?", "title": "Starved Rock and Matthiessen state park in the winter?"}, {"created_utc": 1577598396, "full_link": "https://www.reddit.com/r/illinois/comments/eh2a8j/question_about_ipass/", "id": "eh2a8j", "is_self": true, "score": 1, "selftext": "I have gotten SEVEN separate emails in the last 4 days about my iPass about low or negative funds - I haven't been in Illinois let alone the tollway in a week. I replenished my account with $25 and just got another email saying I have low or negative funds and it is at 0.95 cents now. What is going on????? I'm on an entire different coast!! It also says I have open violations which makes no sense?? Someone please help before I call the tollway people!!!", "title": "Question about iPass???"}, {"created_utc": 1577761707, "full_link": "https://www.reddit.com/r/illinois/comments/ehwvpe/illinois_residents_and_former_residents_how/", "id": "ehwvpe", "is_self": true, "score": 1, "selftext": "I know that Illinois is kind of a tossup with part of it bordering Wisconsin. Part of it bordering Indiana, and I imagine that there is some Rams fans left over  because Illinois is right across the river from St. Louis", "title": "Illinois residents and former residents: how popular are the Bears in Illinois?"}, {"created_utc": 1577805806, "full_link": "https://www.reddit.com/r/illinois/comments/ei46lr/shoe_law/", "id": "ei46lr", "is_self": true, "score": 1, "selftext": "I'm visiting your fine state and have been yelled at twice for not wearing shoes. \nI'm staying in a hotel (that does not change sheets between guests) and when running down to the lobby to grab a cup coffee to bring back to my room I've been yelled at. The hotel staff tells me I have to wear shoes, unless I'm in the water of the pool, that it's a law and they get citations for barefoot guests.\n\nThis seems crazy to me. Isn't the point of hotels to feel like home? \n\nIs this an actual law?\n\nI just want to know before I leave a review for this hotel (It's gonna be one star anyway, the staff are bi-lingual and assume their guests arent. I don't appreciate being talked about, especially when I'm present and not quite fluent enough to respond)", "title": "shoe law?"}, {"created_utc": 1577923755, "full_link": "https://www.reddit.com/r/illinois/comments/eiq4kd/to_people_who_do_not_smoke_marijuana/", "id": "eiq4kd", "is_self": true, "score": 1, "selftext": "Fuck! You!\n\nWe win\n\nThat's all I gotta say...", "title": "To people who do not smoke marijuana..."}, {"created_utc": 1578667505, "full_link": "https://www.reddit.com/r/illinois/comments/emrv9y/is_anyone_missing_a_little_dog/", "id": "emrv9y", "is_self": true, "score": 1, "selftext": "I found what looked like a Jack Russell, he's a tiny thing, white with brown splotches, had a collar but I didn't see a tag, I couldn't get ahold of him, I saw him last at Park Ave. Hanover Park.", "title": "Is anyone missing a little dog?"}, {"created_utc": 1578765932, "full_link": "https://www.reddit.com/r/illinois/comments/enasiu/so_does_anyone_know_any_body_that_was_actually/", "id": "enasiu", "is_self": true, "score": 1, "selftext": "My friends and I have been wondering if you guys know anyone who got fired because of the new weed laws?\n\nWe thought we would see employers getting rid of their unproductive/unwanted employees and would use weed as the excuse. But we haven't even heard of anyone getting fired because of it.", "title": "So does anyone know any body that was actually fired because they smoked weed?"}, {"created_utc": 1578862312, "full_link": "https://www.reddit.com/r/illinois/comments/ent8ml/i_have_an_illinois_property_state_tax_question_if/", "id": "ent8ml", "is_self": true, "score": 1, "selftext": "I moved to Wisconsin,  but I still work in Illinois and I have filled the form that exempts me from Illinois state tax deduction. However, back in 2013, I acquired an investment property under my name. In Illinois. I do not benefit from this property at all. My mother does. \n\n*she had come across this house for sale, but the bank had this condition that they wanted a 1st time owner to buy it. So she asked me as a favor. I agreed.\nShe handles everything and collects all rents. The house is simply just in my name. The house has no mortgage as it was paid full in cash.\n\nMy question now is, how does this affect me state tax wise? When I file for my taxes I claim all the rents in cash.", "title": "I have an Illinois property state tax question, if anyone here can help me out I would definitely appreciate it!"}, {"created_utc": 1579063627, "full_link": "https://www.reddit.com/r/illinois/comments/eoxluv/whats_the_biggest_problem_in_the_young/", "id": "eoxluv", "is_self": true, "score": 1, "selftext": "Hey guys! Question: Whats the biggest problem for the young latinos in Chicago?", "title": "What's the biggest problem in the young latino/hispanic community in Chicago?"}, {"created_utc": 1579146097, "full_link": "https://www.reddit.com/r/illinois/comments/epdpeu/vehicle_renewal_fees/", "id": "epdpeu", "is_self": true, "score": 1, "selftext": "From what I gather the Illinois plate stickers are $151 dollars now , my vehicle registration says “renewal fee due $196” does the 196 include stickers or do I add both numbers for my total ?", "title": "Vehicle renewal fees"}, {"created_utc": 1579362115, "full_link": "https://www.reddit.com/r/illinois/comments/eqhufr/good_and_bad_things_about_illinois_for_those_who/", "id": "eqhufr", "is_self": true, "score": 1, "selftext": "I'm about to graduate but I still have not found any jobs yet I'm thinking of moving to Illinois. My girlfriend is looking for homes here as well as the general feel of society. We're use to r/Oklahoma so how's it like over there?", "title": "Good and bad things about Illinois for those who want to live there."}, {"created_utc": 1580621108, "full_link": "https://www.reddit.com/r/illinois/comments/exjm6k/illinois_positivity_post/", "id": "exjm6k", "is_self": true, "score": 1, "selftext": "We’re all inundated with negativity about our home state. What’s something you feel grateful for about Illinois? Big or small.\n\nI’ve got one. Today I had to get a new license at the DMV. For all the bad press the DMV (and Illinois Bureaucracy) gets, it was a very efficient process. Hundreds of people trying to get their DMV business done, and the workers did a tremendous job flying everybody through. They were nice, helpful, and time-sensitive. Speaking of which, Illinois is filled to the brim with sincerely nice people.", "title": "Illinois Positivity Post"}, {"created_utc": 1582046509, "full_link": "https://www.reddit.com/r/illinois/comments/f5v7p9/toronto_on_to_chicago_il_drivers_licenses/", "id": "f5v7p9", "is_self": true, "score": 1, "selftext": "Hi Reddit!\n\nMy husband and I recently moved from Toronto, ON, Canada to Chicago, IL, USA. My husband has an H1B visa, and I have an H4 visa. He has an SSN; I do not (and cannot under this visa class).\n\nWe have drivers licenses from Ontario but will need to obtain licenses here in Chicago. (We don't own vehicles but may wish to rent a car here and there.) What is the process for this? Is testing required for us as Canadians, or can we \"swap out\" our Ontario licenses for Illinois licenses? Where do we go for this? What documents should we bring, as we aren't American citizens?\n\nThanks!", "title": "Toronto, ON to Chicago, IL - Drivers Licenses"}, {"created_utc": 1582128052, "full_link": "https://www.reddit.com/r/illinois/comments/f6cpkc/trump_finally_does_something_right_although_years/", "id": "f6cpkc", "is_self": true, "score": 1, "selftext": "Governor Blagojevich's sentence was EXTREME. He should've commuted it three years ago.  Always thought he seemed like a nice guy too.", "title": "Trump Finally Does Something Right, Although Years Delayed..."}, {"created_utc": 1582348831, "full_link": "https://www.reddit.com/r/illinois/comments/f7o4o6/is_there_a_pdf_downloadable_map_of_illinoiss/", "id": "f7o4o6", "is_self": true, "score": 1, "selftext": "Like this one of NJ: [https://libguides.njstatelib.org/ld.php?content\\_id=17908386](https://libguides.njstatelib.org/ld.php?content_id=17908386)", "title": "Is there a PDF downloadable map of Illinois's townships and counties?"}, {"created_utc": 1582690590, "full_link": "https://www.reddit.com/r/illinois/comments/f9ni8l/moving_to_monett_mo_sight_unseen_maybe/", "id": "f9ni8l", "is_self": true, "score": 1, "selftext": "My husband and I may move to a small town in Missouri. We can go once to secure housing. Any advice? We are from IN and it looks much like where we come from.", "title": "Moving to Monett MO sight unseen. Maybe"}, {"created_utc": 1583560200, "full_link": "https://www.reddit.com/r/illinois/comments/feqywb/on_a_4lane_2_way_road_a_driver_on_the_opposite/", "id": "feqywb", "is_self": true, "score": 1, "selftext": "http://www.isp.state.il.us/docs/schoolbussafety5542.pdf\n\nsee last page.\n\nWhy do so many drivers not know this? I see so many people stopping when they don't need to.", "title": "On a 4-lane, 2 way road, a driver on the opposite direction can pass a stopped school bus if clear."}, {"created_utc": 1583951597, "full_link": "https://www.reddit.com/r/illinois/comments/fh1vvh/anyone_have_experience_with_a_ticket_for_adams/", "id": "fh1vvh", "is_self": true, "score": 1, "selftext": "Last month I was pulled over on the 355, I had just merged onto the tollway about 1 mile back and there was a good amount of traffic. I saw 2 state troopers on the right shoulder pulling someone over, I got over to the second lane and sped up to try and get over again but couldn't. Second later I had a state trooper pulling me over. He was such a JERK, the speed limit had just changed from 70 to 65, I was going 77. He also said he citing me for improperly passing an emergency vehicle and said I must appear in court.\n\n&amp;#x200B;\n\nMy court date is tomorrow, I have been a driver for 15 years and have never had a ticket or traffic violation. Any idea what I can expect in court tomorrow? If anyone else has received this type of citation. thank you!!!", "title": "Anyone Have Experience with a ticket for Adam's Law in Illinois?"}, {"created_utc": 1584019710, "full_link": "https://www.reddit.com/r/illinois/comments/fhgbrz/call_the_governors_office_and_demand_drivethru/", "id": "fhgbrz", "is_self": true, "score": 1, "selftext": "The federal government is clearly failing at containing this outbreak and their refusal to expand testing is endangering lives.  Washington state has implemented drive-thru testing on their own and we should be doing the same. Simply waiting until there are enough people who are infected before doing so is stupidity. Anyone who believes they have symptoms should have access to testing to prevent further spread of the disease.\n\nI have called the Governor's office this morning and expressed my disappointment and concern that this is not already happening. I encourage all others to do the same, (please be respectful to the receptionist) PH#  217-782-6830. We need to  ensure they cannot avoid our calls for increased testing.", "title": "Call the Governor's Office and Demand Drive-Thru Testing"}, {"created_utc": 1584165161, "full_link": "https://www.reddit.com/r/illinois/comments/fidvda/hazlecrest_has_3_positive_patients_in_the_hospital/", "id": "fidvda", "is_self": true, "score": 1, "selftext": "Be safe out there if you live in the south suburbs. I'm sure this will be on the news sooner or later hopefully.", "title": "Hazlecrest has 3 positive patients in the hospital."}, {"created_utc": 1584196869, "full_link": "https://www.reddit.com/r/illinois/comments/fijcpc/shopping/", "id": "fijcpc", "is_self": true, "score": 1, "selftext": "Where are you guys going to shop and buy stuff? What times do you guys go shopping? It’s been so hard to buy basic necessities. Like body wash, soap, toilet paper, food, medical supplies (for my dad) and etc. Since everyone is panicking and hoarding all the food.", "title": "Shopping?"}, {"created_utc": 1584219474, "full_link": "https://www.reddit.com/r/illinois/comments/fipelv/shout_out_to_all_the_st_patricks_day_revelers_in/", "id": "fipelv", "is_self": true, "score": 1, "selftext": "Thanks for putting others’ health at risk for a watered-down green beer.", "title": "Shout out to all the St. Patrick’s Day revelers in downtown Chicago."}, {"created_utc": 1584436775, "full_link": "https://www.reddit.com/r/illinois/comments/fk283z/idfpr/", "id": "fk283z", "is_self": true, "score": 1, "selftext": "Anyone know if IDFPR (dept of financial and prof regulation) is functioning?", "title": "IDFPR"}, {"created_utc": 1584762547, "full_link": "https://www.reddit.com/r/illinois/comments/fm8uun/i_work_for_a_nonessential_business_that_is/", "id": "fm8uun", "is_self": true, "score": 1, "selftext": "As the title says, the company I work for is non-essential. My office is an environmental consulting firm, but the parent company that owns us is a huge, multinational materials and products testing company. Granted, we do have some service lines that may be considered essential, and workers whose work cannot be done from home.\n\nThe company has taken the stance that, since not everyone is able to work from home, NO ONE is allowed to work from home - even people whose work can easily be done remotely (and frankly already has often BEEN done remotely). Most people in my office can do their work remotely. But if we don’t want to work during this shelter in place period, we either have to use sick time, vacation time, or unpaid time. \n\nMy greedy company is proving that they don’t care about public health and safety nor about the well being of their employees. Do we as employees have any rights here? Sure, we could stay home - but it seems like it’s punishment to force us to use vacation/sick time if we could just...do our work at home.", "title": "I work for a non-essential business that is ignoring the statewide shelter in place"}, {"created_utc": 1584833660, "full_link": "https://www.reddit.com/r/illinois/comments/fmpit4/essential_business_would_an_apparel_fulfillment/", "id": "fmpit4", "is_self": true, "score": 1, "selftext": "There is a small(ish) business that produces and ships apparel from Illinois. Production has been shut down, and all customer service representatives are working from home. But members of fulfillment are still being required to work. Is this considered essential enough to ignore the Stay-at-Home order?", "title": "\"Essential\" business. Would an apparel fulfillment center be considered essential?"}, {"created_utc": 1584889441, "full_link": "https://www.reddit.com/r/illinois/comments/fn15yw/illinois_shelter_in_place/", "id": "fn15yw", "is_self": true, "score": 1, "selftext": "Since Illinois put up the shelter in place on Saturday at 5pm. They say don’t leave your house unless it’s for an essential good. Is the police going to be stopping anyone and asking where they are going? What I want to go visit my boyfriends?", "title": "Illinois shelter in place"}, {"created_utc": 1584939904, "full_link": "https://www.reddit.com/r/illinois/comments/fned65/illinois_defaulting_on_debt_seems_inevitable_now/", "id": "fned65", "is_self": true, "score": 1, "selftext": "\nFirst, the pension funds. We've seen a 30% drop in equity values, and that's just the beginning. It's very likely \"Investment grade\" corporate bonds will see many defaults as well. The drop in asset values will result in even more severe underfunding for state pensions. As a result, the state will need to contribute more to ensure pensions are paid in full.\n\nAt the same time, state sales and income tax revenue is going to decline significantly as people are stuck at home, unable to work, and retail stores that people spend at are closed.\n\nMy guess is Illinois defaults within 10-20 years. The funded % of the pensions will continue to decline, and the size of deficits and interest on debt will continue to rise, until the state becomes unable to balance bond interest payments, pension liabilities, and overall spending. Taxes will likely go up, but that will only exacerbate the problem by weakening the state economy and accelerating the exodus.", "title": "Illinois defaulting on debt seems inevitable now"}, {"created_utc": 1585472447, "full_link": "https://www.reddit.com/r/illinois/comments/fr2zdo/do_i_qualify_for_illinois_unemployment_benefits/", "id": "fr2zdo", "is_self": true, "score": 1, "selftext": "Hello so I recently turned 18 back in February and have never got a job so I don’t have no check stubs or anything equivalent and I don’t have a state id no drivers license but I did create a bank account,brokerage account etc.\nSo I was wondering if I could some how qualify?", "title": "Do I qualify for Illinois unemployment benefits"}, {"created_utc": 1586020194, "full_link": "https://www.reddit.com/r/illinois/comments/fuxauj/ksb_hospital_in_lee_county_is_bullshit/", "id": "fuxauj", "is_self": true, "score": 2, "selftext": "Any website that shows a county breakdown of positive covid-19 has Lee county at zero. I know for a fact that's bull and the fact they aren't reporting their cases and being upfront during this time is shameful.", "title": "KSB hospital in Lee County is bullshit"}, {"created_utc": 1587359965, "full_link": "https://www.reddit.com/r/illinois/comments/g4mt8i/covid19_research/", "id": "g4mt8i", "is_self": true, "score": 1, "selftext": "Hi all! I'm an undergraduate studying psychology and public health, hoping that gaining a better understanding of how people across the US are affected by the COVID-19 pandemic will help inform how we can effectively communicate public health information in the future. **I have a ton of women in my sample, so I would especially appreciate male participants :). Looking for participants 18-35 years old.** I'm hoping to get all states represented equally, so if you get a chance, it's anonymous and takes about 30 minutes:\n\nMy psychology research lab is conducting a study on young adults’ responses to the COVID-19 pandemic. If you are interested in participating, please click the link! Please do not comment on this post regarding your participation in the study or lack thereof. Sharing of this study link is voluntary and any risks associated with sharing of this link are assumed by any individuals who choose to do so.\n\n[https://loyno.az1.qualtrics.com/jfe/form/SV\\_07e2KkQlDsGAT3f ](https://loyno.az1.qualtrics.com/jfe/form/SV_07e2KkQlDsGAT3f)", "title": "COVID-19 Research"}, {"created_utc": 1587662344, "full_link": "https://www.reddit.com/r/illinois/comments/g6qpjb/anybody_else_have_any_luck_securing_unemployment/", "id": "g6qpjb", "is_self": true, "score": 1, "selftext": "Every time i call the IDES phone line on my designated day they’re never accepting calls due to high call volumes. i try to login on the website but it takes so long my page times out. I applied way back in march and tried to re-certify a week ago through teleserve but i’ve yet to see any unemployment money and i can’t reach anybody. what is going on i’m almost out of money 😭😭😭😭", "title": "Anybody else have any luck securing unemployment?"}, {"created_utc": 1587674207, "full_link": "https://www.reddit.com/r/illinois/comments/g6uehn/does_anyone_live_in_the_st_clair_county_area/", "id": "g6uehn", "is_self": true, "score": 1, "selftext": "Just concerned about them since my parents go to grocery stores without masks and talk to their friends for hours at a time. It's ridiculous. Is it bad there?", "title": "Does anyone live in the st clair County area where Shiloh, Belleville and O'Fallon are? My family lives there and I wanted to know how bad the virus is there?!"}, {"created_utc": 1587873262, "full_link": "https://www.reddit.com/r/illinois/comments/g87m6z/if_you_conceal_carry_consider_this/", "id": "g87m6z", "is_self": true, "score": 1, "selftext": "Yep your rights are being attacked but you wanted to ignore the warnings:\n\nIllinois Governor Pritzker might be well advised to find new legal counsel, unless this was intentional, as it appears his upcoming Executive Order taking effect May 1st, 2020 does one of two things.\n\nStrips a gun owner of his rights while complying with the Executive Order to wear a mask, or\nmakes them a criminal if they exercise their gun rights while complying with the Executive Order to wear a mask.\nProposed May 1, 2020, Executive Order\n\n“Wearing a face covering in public places or when working. Any individual who is over age two and able to medically tolerate a face-covering (a mask or cloth face- covering) shall be required to cover their nose and mouth with a face-covering when in a public place and unable to maintain a six-foot social distance. Face-coverings are required in public indoor spaces such as stores.”\n\nCriminal Code\n\nSec. 24-1. Unlawful use of weapons.\n(a) A person commits the offense of unlawful use of weapons when he knowingly:\n(9) Carries or possesses in a vehicle or on or about his or her person any pistol, revolver, stun gun or taser or firearm or ballistic knife, when he or she is hooded, robed or masked in such manner as to conceal his or her identity;  (this violation is a Class 4 Felony)\n\nConsidering a mask that covers the mouth and nose will clearly conceal a person’s identity, those people complying with the Executive Order by wearing a mask while also exercising their right to bear arms, both under the State Constitution, US Constitution, and Illinois Firearms and Concealed Carry laws would be violating the criminal code.\n\nThis is yet another example of a political figure invoking rules upon citizens with little to no regard for their constitutionally protected rights.", "title": "If you conceal carry, consider this..."}, {"created_utc": 1587944604, "full_link": "https://www.reddit.com/r/illinois/comments/g8p9ke/pritzker/", "id": "g8p9ke", "is_self": true, "score": 1, "selftext": "this stupid faggot bitch motherfuker Cunt mother fucking bitch motherfucker pritzker fat bitch fucking Jigglypuff ass stupid mofo fat fuck stupid ass wants to close gyms and pools for the summer cause his fat ass wants to save lives that are gonna die once this shit is over anyway bro someone needs to tell this fat bitch what a treadmill is.", "title": "Pritzker"}]