[{"id": "e5m7fs", "title": "Megathread: Impeachment (December 3, 2019)", "selftext": "Keep it Clean.\n\nToday, the House Intelligence Committee released a report concluding that President Trump attempted to solicit foreign interference for his reelection campaign through the power of his office. This report will be delivered to the House Judiciary Committee, which will consider articles of impeachment based on the Intelligence Committee's findings.  \n\nPlease use this thread to discuss all developments in the impeachment process. Keep in mind that our rules are still in effect.", "full_link": "https://www.reddit.com/r/PoliticalDiscussion/comments/e5m7fs/megathread_impeachment_december_3_2019/", "created_utc": 1575401377}, {"id": "e8ugxp", "title": "Megathread: Impeachment (December 10, 2019)", "selftext": "Keep it Clean.\n\nToday, the House Judiciary Committee announced two proposed articles of impeachment, accusing the President of 1) abuse of power, and 2) obstruction of Congress. The articles will be debated later in the week, and if they pass the Judiciary Committee they will be sent to the full House for a vote. \n\nPlease use this thread to discuss all developments in the impeachment process. Keep in mind that our rules are still in effect.", "full_link": "https://www.reddit.com/r/PoliticalDiscussion/comments/e8ugxp/megathread_impeachment_december_10_2019/", "created_utc": 1576002322}, {"id": "ej9moy", "title": "Iranian General Qassim Soleimani was killed by a US rocket strike in the Baghdad airport. What effect will this have on Iranian-American relations? Was this justified?", "selftext": "[Qassem Soleimani and others killed in Baghdad Airport](https://apnews.com/5597ff0f046a67805cc233d5933a53ed?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n\nBAGHDAD (AP) — The Pentagon said Thursday that the U.S. military has killed Gen. Qassem Soleimani, the head of Iran’s elite Quds Force, at the direction of President Donald Trump.\n\nAn airstrike killed Soleimani, architect of Iran’s regional security apparatus, at Baghdad’s international airport Friday, Iranian state television and three Iraqi officials said, an attack that’s expected to draw severe Iranian retaliation against Israel and American interests.\n\nThe Defense Department said Soleimani “was actively developing plans to attack American diplomats and service members in Iraq and throughout the region.” It also accused Soleimani of approving the attacks on the U.S. Embassy in Baghdad earlier this week.", "full_link": "https://www.reddit.com/r/PoliticalDiscussion/comments/ej9moy/iranian_general_qassim_soleimani_was_killed_by_a/", "created_utc": 1578022912}, {"id": "elkxvb", "title": "[Megathread] Iran Fires Missiles at U.S. Bases in Iraq Following US Strike Killing IRGC Major General Suleimani", "selftext": "Please use this thread to discuss recent events between the United States and Iran.\n\nKeep in mind:\n\n* Breaking news reports may be based off erroneous or incomplete information\n\n* Subreddit rules still apply in this thread. Please remain civil and focus on substantive discussion.\n\nArticles about Iranian missile attack on US:\n\n[NYTimes](https://www.nytimes.com/2020/01/07/world/middleeast/trump-iran.html#commentsContainer)\n[CNN](https://www.cnn.com/middleeast/live-news/us-iran-soleimani-tensions-intl-01-07-20)", "full_link": "https://www.reddit.com/r/PoliticalDiscussion/comments/elkxvb/megathread_iran_fires_missiles_at_us_bases_in/", "created_utc": 1578444890}, {"id": "eryrw9", "title": "[Megathread] Senate considers articles of impeachment against President Trump", "selftext": "Beginning today and continuing over the next few weeks, the US Senate will consider the impeachment articles against President Trump and ultimately vote on whether to remove the president or dismiss the charges.\n\nPlease use this thread to discuss impeachment process as it works it way through the Senate.\n\nLive coverage can be found [here](https://www.nytimes.com/live/2020/impeachment-trial-01-21).", "full_link": "https://www.reddit.com/r/PoliticalDiscussion/comments/eryrw9/megathread_senate_considers_articles_of/", "created_utc": 1579631325}, {"id": "et1hrc", "title": "Megathread Impeachment Continued", "selftext": "Beginning today and continuing over the next few weeks, the US Senate will consider the impeachment articles against President Trump and ultimately vote on whether to remove the president or dismiss the charges.\n\nPlease use this thread to discuss impeachment process as it works it way through the Senate.\n\nLive coverage can be found [here](https://www.nytimes.com/live/2020/impeachment-trial-live-01-23)", "full_link": "https://www.reddit.com/r/PoliticalDiscussion/comments/et1hrc/megathread_impeachment_continued/", "created_utc": 1579822078}, {"id": "ezgw2p", "title": "Megathread: President Trump has been Acquitted by the Senate on both Articles of Impeachment and will not be removed from office", "selftext": "Today, February 5, 2020, president Donald Trump has been acquitted by the US Senate on both articles of impeachment and will not face removal from office. Trump is now the third US President to face an impeachment trial, and the third to be acquitted on all charges. \n\n**Please use this thread to discuss the impeachment inquiry, trial, and final verdict.**\n\n*Media and Articles:*\n\n- [PBS News Hour Live Coverage](https://www.youtube.com/watch?v=GwoAUNJgLlU&amp;feature=emb_title)\n\n\n\n-------------\n\n**Discussion Disclaimer:** Please remember to be civil in discussion and remain on-topic. We understand that politics (particularly with the president) are polarizing, and that many of you are passionate about your views. However, this does not give you a free pass to insult other users or all members of a political party/ideology. Comments/users that violate subreddit rules will face moderator action.", "full_link": "https://www.reddit.com/r/PoliticalDiscussion/comments/ezgw2p/megathread_president_trump_has_been_acquitted_by/", "created_utc": 1580938380}]